illumos/illumos-gate/usr/src/man/man1has/file.1has
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online at
.\" http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open
.\" Group, have given us permission to reprint portions of their
.\" documentation.
.\"
.\" In the following statement, the phrase ``this text'' refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form
.\" in the SunOS Reference Manual, from IEEE Std 1003.1, 2004 Edition,
.\" Standard for Information Technology -- Portable Operating System
.\" Interface (POSIX), The Open Group Base Specifications Issue 6,
.\" Copyright (C) 2001-2004 by the Institute of Electrical and Electronics
.\" Engineers, Inc and The Open Group.  In the event of any discrepancy
.\" between these versions and the original IEEE and The Open Group
.\" Standard, the original IEEE and The Open Group Standard is the referee
.\" document.  The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited.  All Rights Reserved.
.\" Portions Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\"
.TH FILE 1HAS "Apr 11, 2014"
.SH NAME
file \- determine file type
.SH SYNOPSIS
.nf
\fB/usr/bin/file\fR [\fB-bdh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/file\fR [\fB-bdh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-i\fR [\fB-bh\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-i\fR [\fB-bh\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-c\fR [\fB-d\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR [\fB-bdh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR [\fB-bdh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-i\fR [\fB-bh\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-i\fR [\fB-bh\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-c\fR [\fB-d\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR]
.fi

.SH DESCRIPTION
The \fBfile\fR utility performs a series of tests on each file supplied by
\fIfile\fR and, optionally, on each file listed in \fIffile\fR in an attempt to
classify it. If the file is not a regular file, its file type is identified.
The file types directory, \fBFIFO\fR, block special, and character special are
identified as such. If the file is a regular file and the file is zero-length,
it is identified as an empty file.
.LP
If \fIfile\fR appears to be a text file, \fBfile\fR examines the first 512
bytes and tries to determine its programming language. If \fIfile\fR is a
symbolic link, by default the link is followed and \fBfile\fR tests the file to
which the symbolic link refers.
.LP
If \fIfile\fR is a relocatable object, executable, or shared object, \fBfile\fR
prints out information about the file's execution requirements. This
information includes the machine class, byte-ordering, static/dynamic linkage,
and any software or hardware capability requirements. If \fIfile\fR is a
runtime linking configuration file, \fBfile\fR prints information about the
target platform, including the machine class and byte-ordering.
.LP
By default, \fBfile\fR will try to use the localized magic file
\fB/usr/lib/locale/\fIlocale\fR/LC_MESSAGES/magic\fR, if it exists, to identify
files that have a magic number. For example, in the Japanese locale, \fBfile\fR
will try to use \fB/usr/lib/locale/ja/LC_MESSAGES/magic\fR. If a localized
magic file does not exist, \fBfile\fR will utilize \fB/etc/magic\fR. A magic
number is a numeric or string constant that indicates the file type. See
\fBmagic\fR(5) for an explanation of the format of \fB/etc/magic\fR.
.LP
If \fIfile\fR does not exist, cannot be read, or its file status could not be
determined, it is not considered an error that affects the exit status. The
output will indicate that the file was processed, but that its type could not
be determined.
.SH OPTIONS
The following options are supported:
.sp
.ne 2
.na
\fB\fB-b\fR\fR
.ad
.RS 12n
Be brief, do not print leading filename.
.RE

.sp
.ne 2
.na
\fB\fB-c\fR\fR
.ad
.RS 12n
Checks the magic file for format errors. For reasons of efficiency, this
validation is normally not carried out.
.RE

.sp
.ne 2
.na
\fB\fB-d\fR\fR
.ad
.RS 12n
Applies any position-sensitive and context-sensitive default system tests to
the file.
.RE

.sp
.ne 2
.na
\fB\fB-f\fR \fIffile\fR\fR
.ad
.RS 12n
\fIffile\fR contains a list of the files to be examined.
.RE

.sp
.ne 2
.na
\fB\fB-h\fR\fR
.ad
.RS 12n
When a symbolic link is encountered, this option identifies the file as a
symbolic link. If \fB-h\fR is not specified and \fIfile\fR is a symbolic link
that refers to a non-existent file, the \fBfile\fR utility identifies the file
as a symbolic link, as if \fB-h\fR had been specified.
.RE

.sp
.ne 2
.na
\fB\fB-i\fR\fR
.ad
.RS 12n
If a file is a regular file, this option does not attempt to classify the type
of file further, but identifies the file as a "regular file".
.RE

.sp
.ne 2
.na
\fB\fB-m\fR \fImfile\fR\fR
.ad
.RS 12n
.sp
.ne 2
.na
\fB\fB/usr/bin/file\fR\fR
.ad
.RS 22n
Uses \fImfile\fR as an alternate magic file, instead of \fB/etc/magic\fR.
.RE

.sp
.ne 2
.na
\fB\fB/usr/xpg4/bin/file\fR\fR
.ad
.RS 22n
Specifies the name of a file containing position-sensitive tests that are
applied to a file in order to classify it (see \fBmagic\fR(5)). If the \fB-m\fR
option is specified without specifying the \fB-d\fR option or the \fB-M\fR
option, position-sensitive default system tests are applied after the
position-sensitive tests specified by the \fB-m\fR option.
.RE

.RE

.sp
.ne 2
.na
\fB\fB-M\fR \fIMfile\fR\fR
.ad
.RS 12n
Specifies the name of a file containing position-sensitive tests that are
applied to a file in order to classify it (see \fBmagic\fR(5)). No
position-sensitive default system tests nor context-sensitive default system
tests are applied unless the \fB-d\fR option is also specified.
.RE

.LP
If the \fB-M\fR option is specified with the \fB-d\fR option, the \fB-m\fR
option, or both, or if the \fB-m\fR option is specified with the \fB-d\fR
option, the concatenation of the position-sensitive tests specified by these
options is applied in the order specified by the appearance of these options.
.SH OPERANDS
The following operands are supported:
.sp
.ne 2
.na
\fB\fIfile\fR\fR
.ad
.RS 8n
A path name of a file to be tested.
.RE

.SH USAGE
See \fBlargefile\fR(7) for the description of the behavior of \fBfile\fR when
encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXAMPLES
\fBExample 1 \fRDetermining if an Argument is a Binary Executable Files
.LP
The following example determine if an argument is a binary executable file:

.sp
.in +2
.nf
file "$1" | grep \(miFq executable &&
          printf "%s is executable.\en" "$1"
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
See \fBenviron\fR(7) for descriptions of the following environment variables
that affect the execution of \fBfile\fR: \fBLANG\fR, \fBLC_ALL\fR,
\fBLC_CTYPE\fR, \fBLC_MESSAGES\fR, and \fBNLSPATH\fR.
.SH EXIT STATUS
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 6n
Successful completion.
.RE

.sp
.ne 2
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
An error occurred.
.RE

.SH FILES
.ne 2
.na
\fB\fB/etc/magic\fR\fR
.ad
.RS 14n
\fBfile\fR's magic number file
.RE

.SH ATTRIBUTES
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
CSI	Enabled
_
Interface Stability	Standard
.TE

.SH SEE ALSO
.BR crle (1),
.BR elfdump (1),
.BR ls (1),
.BR magic (5),
.BR attributes (7),
.BR environ (7),
.BR largefile (7),
.BR standards (7)
