illumos/illumos-gate/usr/src/man/man1b/chown.1b
'\" te
.\"  Copyright (c) 1980 Regents of the University of California. All rights reserved. The Berkeley software License Agreement specifies the terms and conditions for redistribution. Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH chown 1B "21 Jun 2004" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
chown \- change owner
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/chown\fR [\fB-fR\fR] \fIowner\fR[.group] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
\fBchown\fR changes the owner of the \fIfilename\fRs to \fIowner\fR. The owner
can be either a decimal user \fBID\fR (\fBUID\fR) or a login name found in the
password file. An optional \fIgroup\fR can also be specified. The group can be
either a decimal group \fBID\fR (\fBGID\fR) or a group name found in the
\fBGID\fR file.
.sp
.LP
In the default case, only the super-user of the machine where  the file is
physically located can change the owner. The system configuration option
\fB{_POSIX_CHOWN_RESTRICTED}\fR and the privileges \fBPRIV_FILE_CHOWN\fR and
\fBPRIV_FILE_CHOWN_SELF\fR also affect who can change the ownership of a file.
See \fBchown\fR(2) and \fBprivileges\fR(5).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Do not report errors.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
Recursively descend into directories setting the ownership of all files in each
directory encountered. When symbolic links are encountered, their ownership is
changed, but they are not traversed.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBchown\fR when
encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
.rt  
Password file
.RE

.SH SEE ALSO
.sp
.LP
\fBchgrp\fR(1), \fBchown\fR(2), \fBgroup\fR(4), \fBpasswd\fR(4),
\fBattributes\fR(5), \fBlargefile\fR(5), \fBprivileges\fR(5)
