illumos/illumos-gate/usr/src/man/man1b/exportfs.1b
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH EXPORTFS 1B "Nov 6, 2000"
.SH NAME
exportfs \- translates exportfs options to share/unshare commands
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/exportfs\fR [\fB-aiuv\fR] [\fB-o\fR \fIoptions\fR] [\fIpathname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBexportfs\fR translates SunOS 4.x \fBexportfs\fR options to the corresponding
\fBshare\fR/\fBunshare\fR options and invokes \fBshare\fR/\fBunshare\fR with
the translated options.
.sp
.LP
With no options or arguments, \fBexportfs\fR invokes \fBshare\fR to print out
the list of all currently shared \fBNFS\fR filesystems.
.sp
.LP
\fBexportfs\fR is the BSD/Compatibility Package command of \fBshare\fR(1M) and
\fBunshare\fR(1M). Use  \fBshare\fR(1M)/ \fBunshare\fR(1M) whenever possible.
.SH OPTIONS
.sp
.ne 2
.na
\fB\fB-a\fR\fR
.ad
.RS 14n
Invokes \fBshareall\fR(1M), or if \fB-u\fR is specified, invokes
\fBunshareall\fR(1M).
.RE

.sp
.ne 2
.na
\fB\fB-i\fR\fR
.ad
.RS 14n
Ignore options in \fB/etc/dfs/dfstab\fR.
.RE

.sp
.ne 2
.na
\fB\fB-u\fR\fR
.ad
.RS 14n
Invokes \fBunshare\fR(1M) on \fIpathname\fR.
.RE

.sp
.ne 2
.na
\fB\fB-v\fR\fR
.ad
.RS 14n
Verbose.
.RE

.sp
.ne 2
.na
\fB\fB-o\fR\fI options\fR\fR
.ad
.RS 14n
Specify a comma-separated list of optional characteristics for the filesystems
being exported. \fBexportfs\fR translates \fIoptions\fR to
\fBshare\fR-equivalent options. (see \fBshare\fR(1M) for information about
individual options).
.RE

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M), \fBshareall\fR(1M), \fBunshare\fR(1M), \fBunshareall\fR(1M),
\fBattributes\fR(5)
