illumos/illumos-gate/usr/src/man/man1b/lpq.1b
'\" te
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH lpq 1B "2 Jun 2006" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
lpq \- display the content of a print queue
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/lpq\fR [\fB-P\fR \fIdestination\fR] [\fB-l\fR] [+ [\fIinterval\fR]] 
     [\fIrequest-ID\fR...] [\fIuser\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBlpq\fR utility displays the information about the contents of a print
queue. A print queue is comprised of print requests that are waiting  in the
process of being printed.
.sp
.LP
\fBlpq\fR displays the following information to the standard output:
.RS +4
.TP
.ie t \(bu
.el o
the username of the person associated with a print request,
.RE
.RS +4
.TP
.ie t \(bu
.el o
the position of a print request in the print queue,
.RE
.RS +4
.TP
.ie t \(bu
.el o
the name of file or files comprising a print request,
.RE
.RS +4
.TP
.ie t \(bu
.el o
the job number of a print request, and
.RE
.RS +4
.TP
.ie t \(bu
.el o
the size of the file requested by a print request. File size is reported in
bytes.
.RE
.sp
.LP
Normally, only as much information as will fit on one line is displayed. If the
name of the input file associated with a print request is not available, the
input file field indicates the standard input.
.sp
.LP
The print client commands locate destination information using the
\fBprinters\fR database in the name service switch. See \fBnsswitch.conf\fR(4),
\fBprinters\fR(4), and \fBprinters.conf\fR(4) for details.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 18n
.rt  
Displays information in long format. Long format includes the name of the host
from which a print request originated in the display.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIdestination\fR\fR
.ad
.RS 18n
.rt  
Displays information about printer or class of printers (see \fBlpadmin\fR(1M))
\fI\&.\fR Specify \fIdestination\fR using atomic, URI-style
(\fIscheme\fR\fB://\fR\fBendpoint\fR), or POSIX-style
(\fIserver\fR\fB:\fR\fIdestination\fR) names. See \fBprinters.conf\fR(4) for
information regarding destination names.
.RE

.sp
.ne 2
.mk
.na
\fB\fB+\fR [\fIinterval\fR]\fR
.ad
.RS 18n
.rt  
Displays information at specific time intervals. Stops displaying information
when the print queue is empty. Clears the screen before reporting displaying
the print queue. Specify \fIinterval\fR as the number of seconds between
displays. If  \fIinterval\fR is not specified only executes once.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIrequest-ID\fR\fR
.ad
.RS 14n
.rt  
The job number associated with a print request.
.RE

.sp
.ne 2
.mk
.na
\fB\fIuser\fR\fR
.ad
.RS 14n
.rt  
The name of the user about whose jobs  \fBlpq\fR reports information. Specify
\fIuser\fR as a valid username.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.RS 12n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB$HOME/.printers\fR\fR
.ad
.RS 24n
.rt  
User-configurable printer database
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/printers.conf\fR\fR
.ad
.RS 24n
.rt  
System printer configuration database
.RE

.sp
.ne 2
.mk
.na
\fB\fBprinters.conf.byname\fR\fR
.ad
.RS 24n
.rt  
NIS version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBprinters.org_dir\fR\fR
.ad
.RS 24n
.rt  
NIS+ version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBou=printers\fR\fR
.ad
.RS 24n
.rt  
LDAP version of \fB/etc/printers.conf\fR
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
\fBlp\fR(1), \fBlpc\fR(1B), \fBlpr\fR(1B), \fBlprm\fR(1B), \fBlpstat\fR(1),
\fBlpadmin\fR(1M), \fBnsswitch.conf\fR(4), \fBprinters\fR(4),
\fBprinters.conf\fR(4), \fBattributes\fR(5), \fBstandards\fR(5)
.SH NOTES
.sp
.LP
When IPP is in use, the user is prompted for a passphrase if the remote print
service is configured to require authentication.
