illumos/illumos-gate/usr/src/man/man1b/stty.1b
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH STTY 1B "Feb 14, 2005"
.SH NAME
stty \- set the options for a terminal
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/stty\fR [\fB-a\fR] [\fB-g\fR] [\fB-h\fR] [\fImodes\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBstty\fR sets certain terminal I/O options for the device that is the current
standard output. Without arguments, \fBstty\fR reports the settings of certain
options.
.SH OPTIONS
.sp
.LP
In this report, if a character is preceded by a caret (\fB^\fR), then the value
of that option is the corresponding CTRL character (for example, \fB^h\fR is
CTRL-h. In this case, recall that CTRL-h is the same as the BACKSPACE key.) The
sequence \fB^@\fR means that an option has a null value.
.sp
.ne 2
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
Reports all of the option settings.
.RE

.sp
.ne 2
.na
\fB\fB-g\fR\fR
.ad
.RS 6n
Reports current settings in a form that can be used as an argument to another
\fBstty\fR command.
.RE

.sp
.ne 2
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
Reports all the option settings with the control characters in an easy to read
column format.
.RE

.sp
.LP
Options in the last group are implemented using options in the previous groups.
Many combinations of options make no sense, but no sanity checking is
performed. Hardware flow control and clock modes options might not be supported
by all hardware interfaces. The options are selected from the following:
.SS "Special Requests"
.sp
.ne 2
.na
\fB\fBall\fR\fR
.ad
.RS 14n
Reports the same option settings as \fBstty\fR without arguments,  but with the
control characters in column format.
.RE

.sp
.ne 2
.na
\fB\fBeverything\fR\fR
.ad
.RS 14n
Everything \fBstty\fR knows about is printed. Same as \fB-h\fR option.
.RE

.sp
.ne 2
.na
\fB\fBspeed\fR\fR
.ad
.RS 14n
The terminal speed alone is reported on the standard output.
.RE

.sp
.ne 2
.na
\fB\fBsize\fR\fR
.ad
.RS 14n
The terminal (window) sizes are printed on the standard output, first rows and
then columns. This option is only appropriate if currently running a window
system.
.sp
\fBsize\fR and \fBspeed\fR always report on the settings of \fB/dev/tty\fR, and
always report the settings to the standard output.
.RE

.SS "Control Modes"
.sp
.ne 2
.na
\fB\fBparenb\fR (\fB-parenb\fR)\fR
.ad
.sp .6
.RS 4n
Enable (disable) parity generation and detection.
.RE

.sp
.ne 2
.na
\fB\fBparext\fR (\fB\fR\fB-parext\fR\fB)\fR\fR
.ad
.sp .6
.RS 4n
Enable (disable) extended parity generation and detection for mark and space
parity.
.RE

.sp
.ne 2
.na
\fB\fBparodd\fR (\fB-parodd\fR)\fR
.ad
.sp .6
.RS 4n
Select odd (even) parity, or mark (space) parity if \fBparext\fR is enabled.
.RE

.sp
.ne 2
.na
\fB\fBcs5 cs6 cs7 cs8\fR\fR
.ad
.sp .6
.RS 4n
Select character size (see \fBtermio\fR(7I)).
.RE

.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Hang up line immediately.
.RE

.sp
.ne 2
.na
\fB\fB110 300 600 1200 1800 2400 4800 9600 19200 exta 38400 extb\fR\fR
.ad
.sp .6
.RS 4n
Set terminal baud rate to the number given, if possible. (All speeds are not
supported by all hardware interfaces.)
.RE

.sp
.ne 2
.na
\fB\fBispeed 0 110 300 600 1200 1800 2400 4800 9600 19200 exta 38400 extb\fR\fR
.ad
.sp .6
.RS 4n
Set terminal input baud rate to the number given, if possible. (Not all
hardware supports split baud rates.)  If the input baud rate is set to zero,
the input baud rate is specified by the value of the output baud rate.
.RE

.sp
.ne 2
.na
\fB\fBospeed 0 110 300 600 1200 1800 2400 4800 9600 19200 exta 38400 extb\fR\fR
.ad
.sp .6
.RS 4n
Set terminal output baud rate to the number given, if possible. (Not all
hardware supports split baud rates.)  If the  baud rate is set to zero, the
line is hung up immediately.
.RE

.sp
.ne 2
.na
\fB\fBhupcl\fR (\fB-hupcl\fR)\fR
.ad
.sp .6
.RS 4n
Hang up (do not hang up) connection on last close.
.RE

.sp
.ne 2
.na
\fB\fBhup\fR (\fB-hup\fR)\fR
.ad
.sp .6
.RS 4n
Same as \fBhupcl\fR (\fB-hupcl\fR).
.RE

.sp
.ne 2
.na
\fB\fBcstopb\fR (\fB-cstopb\fR)\fR
.ad
.sp .6
.RS 4n
Use two (one) stop bits per character.
.RE

.sp
.ne 2
.na
\fB\fBcread\fR (\fB-cread\fR)\fR
.ad
.sp .6
.RS 4n
Enable (disable) the receiver.
.RE

.sp
.ne 2
.na
\fB\fBclocal\fR (\fB-clocal\fR)\fR
.ad
.sp .6
.RS 4n
Assume a line without (with) modem control.
.RE

.sp
.ne 2
.na
\fB\fBcrtscts\fR (\fB-crtscts\fR)\fR
.ad
.sp .6
.RS 4n
Enable hardware flow control.  Raise the RTS  (Request to Send) modem control
line.  Suspends  output until the  \fBCTS\fR (Clear to Send) line is  raised.
.RE

.sp
.ne 2
.na
\fB\fBloblk\fR (\fB-loblk\fR)\fR
.ad
.sp .6
.RS 4n
Block (do not block) output from a non-current layer.
.RE

.SS "Input Modes"
.sp
.ne 2
.na
\fB\fBignbrk\fR (\fB-ignbrk\fR)\fR
.ad
.RS 22n
Ignore (do not ignore) break on input.
.RE

.sp
.ne 2
.na
\fB\fBbrkint\fR (\fB-brkint\fR)\fR
.ad
.RS 22n
Signal (do not signal) INTR on break.
.RE

.sp
.ne 2
.na
\fB\fBignpar\fR (\fB-ignpar\fR)\fR
.ad
.RS 22n
Ignore (do not ignore) parity errors.
.RE

.sp
.ne 2
.na
\fB\fBparmrk\fR (\fB-parmrk\fR)\fR
.ad
.RS 22n
Mark (do not mark) parity errors (see \fBtermio\fR(7I)).
.RE

.sp
.ne 2
.na
\fB\fBinpck\fR (\fB-inpck\fR)\fR
.ad
.RS 22n
Enable (disable) input parity checking.
.RE

.sp
.ne 2
.na
\fB\fBistrip\fR (\fB-istrip\fR)\fR
.ad
.RS 22n
Strip (do not strip) input characters to seven bits.
.RE

.sp
.ne 2
.na
\fB\fBinlcr\fR (\fB-inlcr\fR)\fR
.ad
.RS 22n
Map (do not map) NL to CR on input.
.RE

.sp
.ne 2
.na
\fB\fBigncr\fR (\fB-igncr\fR)\fR
.ad
.RS 22n
Ignore (do not ignore) CR on input.
.RE

.sp
.ne 2
.na
\fB\fBicrnl\fR (\fB-icrnl\fR)\fR
.ad
.RS 22n
Map (do not map) CR to NL on input.
.RE

.sp
.ne 2
.na
\fB\fBiuclc\fR (\fB-iuclc\fR)\fR
.ad
.RS 22n
Map (do not map) upper-case alphabetics to lower case on input.
.RE

.sp
.ne 2
.na
\fB\fBixon\fR (\fB-ixon\fR)\fR
.ad
.RS 22n
Enable (disable) START/STOP output control.  Output is stopped by sending an
STOP and started by sending an START.
.RE

.sp
.ne 2
.na
\fB\fBixany\fR (\fB-ixany\fR)\fR
.ad
.RS 22n
Allow any character (only START) to restart output.
.RE

.sp
.ne 2
.na
\fB\fBdecctlq\fR (\fB-decctlq\fR)\fR
.ad
.RS 22n
Same as \fB-ixany\fR.
.RE

.sp
.ne 2
.na
\fB\fBixoff\fR (\fB-ixoff\fR)\fR
.ad
.RS 22n
Request that the system send (not send) START/STOP characters when the input
queue is nearly empty/full.
.RE

.sp
.ne 2
.na
\fB\fBtandem\fR (\fB\fR\fB-tandem\fR\fB)\fR\fR
.ad
.RS 22n
Same as \fBixoff\fR.
.RE

.sp
.ne 2
.na
\fB\fBimaxbel\fR (\fB\fR\fB-imaxbel\fR\fB)\fR\fR
.ad
.RS 22n
Echo (do not echo)  \fBBEL\fR when the input line is too long.
.RE

.sp
.ne 2
.na
\fB\fBiexten\fR (\fB\fR\fB-iexten\fR\fB)\fR\fR
.ad
.RS 22n
Enable (disable) extended (implementation-defined) functions for input data.
.RE

.SS "Output Modes"
.sp
.ne 2
.na
\fB\fBopost\fR (\fB-opost\fR)\fR
.ad
.RS 23n
Post-process output (do not post-process output; ignore all other output
modes).
.RE

.sp
.ne 2
.na
\fB\fBolcuc\fR (\fB-olcuc\fR)\fR
.ad
.RS 23n
Map (do not map) lower-case alphabetics to upper case on output.
.RE

.sp
.ne 2
.na
\fB\fBonlcr\fR (\fB-onlcr\fR)\fR
.ad
.RS 23n
Map (do not map) NL to CR-NL on output.
.RE

.sp
.ne 2
.na
\fB\fBocrnl\fR (\fB-ocrnl\fR)\fR
.ad
.RS 23n
Map (do not map) CR to NL on output.
.RE

.sp
.ne 2
.na
\fB\fBonocr\fR (\fB-onocr\fR)\fR
.ad
.RS 23n
Do not (do) output CRs at column zero.
.RE

.sp
.ne 2
.na
\fB\fBonlret\fR (\fB-onlret\fR)\fR
.ad
.RS 23n
On the terminal NL performs (does not perform) the CR function.
.RE

.sp
.ne 2
.na
\fB\fBofill\fR (\fB-ofill\fR)\fR
.ad
.RS 23n
Use fill characters (use timing) for delays.
.RE

.sp
.ne 2
.na
\fB\fBofdel\fR (\fB-ofdel\fR)\fR
.ad
.RS 23n
Fill characters are DELs (NULs).
.RE

.sp
.ne 2
.na
\fB\fBcr0 cr1 cr2 cr3\fR\fR
.ad
.RS 23n
Select style of delay for carriage returns (see \fBtermio\fR(7I)).
.RE

.sp
.ne 2
.na
\fB\fBnl0 nl1\fR\fR
.ad
.RS 23n
Select style of delay for line-feeds (see \fBtermio\fR(7I)).
.RE

.sp
.ne 2
.na
\fB\fBtab0 tab1 tab2 tab3\fR\fR
.ad
.RS 23n
Select style of delay for horizontal tabs (see \fBtermio\fR(7I)).
.RE

.sp
.ne 2
.na
\fB\fBbs0 bs1\fR\fR
.ad
.RS 23n
Select style of delay for backspaces (see \fBtermio\fR(7I)).
.RE

.sp
.ne 2
.na
\fB\fBff0 ff1\fR\fR
.ad
.RS 23n
Select style of delay for form-feeds (see \fBtermio\fR(7I)).
.RE

.sp
.ne 2
.na
\fB\fBvt0 vt1\fR\fR
.ad
.RS 23n
Select style of delay for vertical tabs (see \fBtermio\fR(7I)).
.RE

.SS "Local Modes"
.sp
.ne 2
.na
\fB\fBisig\fR (\fB-isig\fR)\fR
.ad
.RS 24n
Enable (disable) the checking of characters against the special control
characters INTR, QUIT, and SWTCH. For information on \fBSWTCH\fR, see
\fBNOTES\fR.
.RE

.sp
.ne 2
.na
\fB\fBicanon\fR (\fB-icanon\fR)\fR
.ad
.RS 24n
Enable (disable) canonical input (ERASE and KILL processing). Does not set MIN
or TIME.
.RE

.sp
.ne 2
.na
\fB\fBcbreak\fR (\fB-cbreak\fR)\fR
.ad
.RS 24n
Equivalent to \fB-icanon min 1 time 0\fR.
.RE

.sp
.ne 2
.na
\fB\fBxcase\fR (\fB-xcase\fR)\fR
.ad
.RS 24n
Canonical (unprocessed) upper/lower-case presentation.
.RE

.sp
.ne 2
.na
\fB\fBecho\fR (\fB-echo\fR)\fR
.ad
.RS 24n
Echo back (do not echo back) every character typed.
.RE

.sp
.ne 2
.na
\fB\fBechoe\fR (\fB-echoe\fR)\fR
.ad
.RS 24n
Echo (do not echo) ERASE character as a backspace-space-backspace string.
Note:  This mode erases the ERASEed character on many CRT terminals; however,
it does \fInot\fR keep track of column position and, as a result, can be
confusing on escaped characters, tabs, and backspaces.
.RE

.sp
.ne 2
.na
\fB\fBcrterase\fR (\fB-crterase\fR)\fR
.ad
.RS 24n
Same as \fBechoe\fR.
.RE

.sp
.ne 2
.na
\fB\fBechok\fR (\fB-echok\fR)\fR
.ad
.RS 24n
Echo (do not echo) NL after KILL character.
.RE

.sp
.ne 2
.na
\fB\fBlfkc\fR (\fB-lfkc\fR)\fR
.ad
.RS 24n
The same as \fBechok\fR (\fB-echok\fR); obsolete.
.RE

.sp
.ne 2
.na
\fB\fBechonl\fR (\fB-echonl\fR)\fR
.ad
.RS 24n
Echo (do not echo) NL.
.RE

.sp
.ne 2
.na
\fB\fBnoflsh\fR (\fB-noflsh\fR)\fR
.ad
.RS 24n
Disable (enable) flush after INTR, QUIT, or SWTCH. For information on
\fBSWTCH\fR, see \fBNOTES\fR.
.RE

.sp
.ne 2
.na
\fB\fBstwrap\fR (\fB-stwrap\fR)\fR
.ad
.RS 24n
Disable (enable) truncation of lines longer than 79 characters on a synchronous
line.  (Does not apply to the 3B2.)
.RE

.sp
.ne 2
.na
\fB\fBtostop\fR (\fB-tostop\fR)\fR
.ad
.RS 24n
Send (do not send)  \fBSIGTTOU\fR for background processes.
.RE

.sp
.ne 2
.na
\fB\fBechoctl\fR (\fB\fR\fB-echoctl\fR\fB)\fR\fR
.ad
.RS 24n
Echo (do not echo) control characters as ^\fIchar\fR, delete as ^?
.RE

.sp
.ne 2
.na
\fB\fBctlecho\fR (\fB\fR\fB-ctlecho\fR\fB)\fR\fR
.ad
.RS 24n
Same as \fBechoctl\fR.
.RE

.sp
.ne 2
.na
\fB\fBechoprt\fR (\fB\fR\fB-echoprt\fR\fB)\fR\fR
.ad
.RS 24n
Echo (do not echo) erase character as character is ``erased''.
.RE

.sp
.ne 2
.na
\fB\fBprterase\fR (\fB-prterase\fR)\fR
.ad
.RS 24n
Same as \fBechoprt\fR.
.RE

.sp
.ne 2
.na
\fB\fBechoke\fR (\fB\fR\fB-echoke\fR\fB)\fR\fR
.ad
.RS 24n
BS-SP-BS erase (do not BS-SP-BS erase) entire line on line kill.
.RE

.sp
.ne 2
.na
\fB\fBcrtkill\fR (\fB-crtkill\fR)\fR
.ad
.RS 24n
Same as \fBechoke\fR.
.RE

.sp
.ne 2
.na
\fB\fBflusho\fR (\fB\fR\fB-flusho\fR\fB)\fR\fR
.ad
.RS 24n
Output is (is not) being flushed.
.RE

.sp
.ne 2
.na
\fB\fBpendin\fR (\fB\fR\fB-pendin\fR\fB)\fR\fR
.ad
.RS 24n
Retype (do not retype) pending input at next read or input character.
.RE

.sp
.ne 2
.na
\fB\fBstflush\fR (\fB-stflush\fR)\fR
.ad
.RS 24n
Enable (disable) flush on a synchronous line after every \fBwrite\fR(2). (Does
not apply to the 3B2.)
.RE

.sp
.ne 2
.na
\fB\fBstappl\fR (\fB-stappl\fR)\fR
.ad
.RS 24n
Use application mode (use line mode) on a synchronous line. (Does not apply to
the 3B2.)
.RE

.SS "Hardware Flow Control Modes"
.sp
.ne 2
.na
\fB\fBrtsxoff\fR (\fB-rtsxoff\fR)\fR
.ad
.RS 24n
Enable (disable) RTS hardware flow control on input.
.RE

.sp
.ne 2
.na
\fB\fBctsxon\fR (\fB-ctsxon\fR)\fR
.ad
.RS 24n
Enable (disable) CTS hardware flow control on output.
.RE

.sp
.ne 2
.na
\fB\fBdterxoff\fR (\fB-dterxoff\fR)\fR
.ad
.RS 24n
Enable (disable) DTER hardware flow control on input.
.RE

.sp
.ne 2
.na
\fB\fBrlsdxon\fR (\fB-rlsdxon\fR)\fR
.ad
.RS 24n
Enable (disable) RLSD hardware flow control on output.
.RE

.sp
.ne 2
.na
\fB\fBisxoff\fR (\fB-isxoff\fR)\fR
.ad
.RS 24n
Enable (disable) isochronous hardware flow control on input.
.RE

.SS "Clock Modes"
.sp
.ne 2
.na
\fB\fBxcibrg\fR\fR
.ad
.RS 12n
Get transmit clock from internal baud rate generator.
.RE

.sp
.ne 2
.na
\fB\fBxctset\fR\fR
.ad
.RS 12n
Get the transmit clock from transmitter signal element timing (DCE source)
lead, CCITT V.24 circuit 114, EIA-232-D pin 15.
.RE

.sp
.ne 2
.na
\fB\fBxcrset\fR\fR
.ad
.RS 12n
Get transmit clock from receiver signal element timing (DCE source) lead, CCITT
V.24 circuit 115, EIA-232-D pin 17.
.RE

.sp
.ne 2
.na
\fB\fBrcibrg\fR\fR
.ad
.RS 12n
Get receive clock from internal baud rate generator.
.RE

.sp
.ne 2
.na
\fB\fBrctset\fR\fR
.ad
.RS 12n
Get receive clock from transmitter signal element timing (DCE source) lead,
CCITT V.24 circuit 114, EIA-232-D pin 15.
.RE

.sp
.ne 2
.na
\fB\fBrcrset\fR\fR
.ad
.RS 12n
Get receive clock from receiver signal element timing (DCE source) lead, CCITT
V.24 circuit 115, EIA-232-D pin 17.
.RE

.sp
.ne 2
.na
\fB\fBtsetcoff\fR\fR
.ad
.RS 12n
Transmitter signal element timing clock not provided.
.RE

.sp
.ne 2
.na
\fB\fBtsetcrc\fR\fR
.ad
.RS 12n
Output receive clock on transmitter signal element timing (DTE source) lead,
CCITT V.24 circuit 113, EIA-232-D pin 24, clock source.
.RE

.sp
.ne 2
.na
\fB\fBtsetcxc\fR\fR
.ad
.RS 12n
Output transmit clock on transmitter signal element timing (DTE source) lead,
CCITT V.24 circuit 113, EIA-232-D pin 24, clock source.
.RE

.sp
.ne 2
.na
\fB\fBrsetcoff\fR\fR
.ad
.RS 12n
Receiver signal element timing clock not provided.
.RE

.sp
.ne 2
.na
\fB\fBrsetcrc\fR\fR
.ad
.RS 12n
Output receive clock on receiver signal element timing (DTE source) lead, CCITT
V.24 circuit 128, no EIA-232-D pin, clock source.
.RE

.sp
.ne 2
.na
\fB\fBrsetcxc\fR\fR
.ad
.RS 12n
Output transmit clock on receiver signal element timing (DTE source) lead,
CCITT V.24 circuit 128, no EIA-232-D pin, clock source.
.RE

.SS "Control Assignments"
.sp
.ne 2
.na
\fB\fIcontrol-character c\fR\fR
.ad
.RS 23n
Set \fIcontrol-character\fR to \fIc\fR, where \fIcontrol-character\fR is
\fBintr\fR, \fBquit\fR, \fBerase\fR, \fBkill\fR, \fBeof\fR, \fBeol\fR,
\fBeol2\fR, \fBswtch\fR, \fBstart\fR, \fBstop\fR, \fBsusp\fR, \fBdsusp\fR,
\fBrprnt\fR, \fBflush\fR, \fBwerase\fR, \fBlnext\fR \fBmin\fR, \fBctab\fR,
\fBtime\fR, or \fBbrk\fR) (\fBctab\fR is used with \fB-stappl\fR; \fBmin\fR and
\fBtime\fR are used with \fB-icanon\fR; see \fBtermio\fR(7I)). If \fIc\fR is
preceded by an (escaped from the shell) caret (\fB^\fR), then the value used is
the corresponding CTRL character (for example, ``^d'' is a Control-d). ``^?''
is interpreted as DEL and ``\fB^\(mi\fR'' is interpreted as undefined. For
information on \fBSWTCH\fR, see \fBNOTES\fR.
.RE

.sp
.ne 2
.na
\fB\fBline\fR\fI i\fR\fR
.ad
.RS 23n
Set line discipline to \fIi\fR (0 < \fIi\fR < 127 ).
.RE

.SS "Combination Modes"
.sp
.ne 2
.na
\fB\fBevenp\fR or \fBparity\fR\fR
.ad
.RS 24n
Enable \fBparenb\fR and \fBcs7\fR.
.RE

.sp
.ne 2
.na
\fB\fB-evenp\fR, or \fB-parity\fR\fR
.ad
.RS 24n
Disable \fBparenb\fR, and set \fBcs8\fR.
.RE

.sp
.ne 2
.na
\fB\fBeven\fR (\fB-even\fR)\fR
.ad
.RS 24n
Same as \fBevenp\fR (\fB-evenp\fR).
.RE

.sp
.ne 2
.na
\fB\fBoddp\fR\fR
.ad
.RS 24n
Enable \fBparenb\fR, \fBcs7\fR, and \fBparodd\fR.
.RE

.sp
.ne 2
.na
\fB\fB-oddp\fR\fR
.ad
.RS 24n
Disable \fBparenb\fR and \fBparodd\fR, and set \fBcs8\fR.
.RE

.sp
.ne 2
.na
\fB\fBodd\fR (\fB-odd\fR)\fR
.ad
.RS 24n
Same as  \fBoddp\fR (\fB-oddp\fR).
.RE

.sp
.ne 2
.na
\fB\fBspacep\fR\fR
.ad
.RS 24n
Enable \fBparenb\fR, \fBcs7\fR, and \fBparext\fR.
.RE

.sp
.ne 2
.na
\fB\fB-spacep\fR\fR
.ad
.RS 24n
Disable \fBparenb\fR and \fBparext\fR, and set \fBcs8\fR.
.RE

.sp
.ne 2
.na
\fB\fBmarkp\fR\fR
.ad
.RS 24n
Enable \fBparenb\fR, \fBcs7\fR, \fBparodd\fR, and \fBparext\fR.
.RE

.sp
.ne 2
.na
\fB\fB-markp\fR\fR
.ad
.RS 24n
Disable \fBparenb\fR, \fBparodd\fR, and \fBparext\fR, and set \fBcs8\fR.
.RE

.sp
.ne 2
.na
\fB\fBraw\fR (\fB-raw\fR or \fBcooked\fR)\fR
.ad
.RS 24n
Enable (disable) raw input and output (no ERASE, KILL, INTR, QUIT, SWTCH, EOT,
or output post processing). For information on \fBSWTCH\fR, see \fBNOTES\fR.
.RE

.sp
.ne 2
.na
\fB\fBnl\fR (\fB-nl\fR)\fR
.ad
.RS 24n
Unset (set) \fBicrnl\fR, \fBonlcr\fR. In addition \fB-nl\fR unsets \fBinlcr\fR,
\fBigncr\fR,  \fBocrnl\fR, and \fBonlret\fR.
.RE

.sp
.ne 2
.na
\fB\fBlcase\fR (\fB-lcase\fR)\fR
.ad
.RS 24n
Set (unset) \fBxcase\fR, \fBiuclc\fR, and \fBolcuc\fR.
.RE

.sp
.ne 2
.na
\fB\fBLCASE\fR (\fB-LCASE\fR)\fR
.ad
.RS 24n
Same as \fBlcase\fR (\fB-lcase\fR).
.RE

.sp
.ne 2
.na
\fB\fBtabs\fR (\fB-tabs\fR or \fBtab3\fR)\fR
.ad
.RS 24n
Preserve (expand to spaces) tabs when printing.
.RE

.sp
.ne 2
.na
\fB\fBek\fR\fR
.ad
.RS 24n
Reset ERASE and KILL characters back to normal DEL and CTRL-u, respectively.
.RE

.sp
.ne 2
.na
\fB\fBsane\fR\fR
.ad
.RS 24n
Reset all modes to some reasonable values.
.RE

.sp
.ne 2
.na
\fB\fBterm\fR\fR
.ad
.RS 24n
Set all modes suitable for the terminal type \fIterm\fR, where \fIterm\fR is
one of \fBtty33\fR, \fBtty37\fR, \fBvt05\fR,  \fBtn300\fR, \fBti700\fR, or
\fBtek\fR.
.RE

.sp
.ne 2
.na
\fB\fBasync\fR\fR
.ad
.RS 24n
Set normal asynchronous communications where clock settings are \fBxcibrg\fR,
\fBrcibrg\fR,  \fBtsetcoff\fR and \fBrsetcoff\fR.
.RE

.sp
.ne 2
.na
\fB\fBlitout (\fR\fB-litout\fR\fB)\fR\fR
.ad
.RS 24n
Disable (enable) \fBparenb\fR, \fBistrip\fR, and \fBopost\fR, and set \fBcs8\fR
(\fBcs7\fR).
.RE

.sp
.ne 2
.na
\fB\fBpass8 (\fR\fB-pass8\fR\fB)\fR\fR
.ad
.RS 24n
Disable (enable) \fBparenb\fR and \fBistrip\fR, and set \fBcs8 \fR (\fBcs7\fR).
.RE

.sp
.ne 2
.na
\fB\fBcrt\fR\fR
.ad
.RS 24n
Set options for a \fBCRT\fR (\fBechoe\fR, \fBechoctl\fR, and, if >= 1200 baud,
\fBechoke\fR.)
.RE

.sp
.ne 2
.na
\fB\fBdec\fR\fR
.ad
.RS 24n
Set all modes suitable for Digital Equipment Corp. operating systems users
ERASE, KILL, and INTR characters to \fB^?\fR, \fB^U\fR, and \fB^C\fR,
\fBdecctlq\fR, and \fBcrt\fR.)
.RE

.SS "Window Size"
.sp
.ne 2
.na
\fB\fBrows\fR\fIn\fR\fR
.ad
.RS 12n
Set window size to \fIn\fR \fIrows\fR.
.RE

.sp
.ne 2
.na
\fB\fBcolumns\fR\fIn\fR\fR
.ad
.RS 12n
Set window size to \fIn\fR \fIcolumns\fR.
.RE

.sp
.ne 2
.na
\fB\fBcols\fR\fIn\fR\fR
.ad
.RS 12n
An alias for \fBcolumns\fR\fI n\fR.
.RE

.sp
.ne 2
.na
\fB\fBypixels\fR\fIn\fR\fR
.ad
.RS 12n
Set vertical window size to \fIn\fR \fIpixels\fR.
.RE

.sp
.ne 2
.na
\fB\fBxpixels\fR\fIn\fR\fR
.ad
.RS 12n
Set horizontal window size to \fIn\fR \fIpixels\fR.
.RE

.SH SEE ALSO
.sp
.LP
\fBtabs\fR(1), \fBioctl\fR(2), \fBattributes\fR(5), \fBtermio\fR(7I),
\fBtermiox\fR(7I)
.SH NOTES
.sp
.LP
Solaris does not support any of the actions implied by \fBswtch\fR, which was
used by the \fBsxt\fR driver on System V release 4.  Solaris allows the
\fBswtch\fR value to be set, and prints it out if set, but it does not perform
the \fBswtch\fR action.
.sp
.LP
The job switch functionality on Solaris is actually handled by job control.
\fBsusp\fR is the correct setting for this.
