illumos/illumos-gate/usr/src/man/man1m/6to4relay.1m
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH 6to4relay 1M "19 Nov 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
6to4relay \- administer configuration for 6to4 relay router communication
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/6to4relay\fR 
.fi

.LP
.nf
\fB/usr/sbin/6to4relay\fR [\fB-e\fR] [\fB-a\fR \fIaddr\fR]
.fi

.LP
.nf
\fB/usr/sbin/6to4relay\fR [\fB-d\fR]
.fi

.LP
.nf
\fB/usr/sbin/6to4relay\fR [\fB-h\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fB6to4relay\fR command is used to configure 6to4 relay router
communication. Relay router communication support is enabled by setting the
value of a variable that stores an IPv4 address within the \fBtun\fR module.
This variable is global to all tunnels and defines the policy for communication
with relay routers. By default, the address is set to \fBINADDR_ANY\fR
(\fB0.0.0.0\fR), and the kernel interprets the value to indicate that support
for relay router communication is disabled. Otherwise, support is enabled, and
the specified address is used as the IPv4 destination address when packets
destined for native IPv6 (non-6to4) hosts are sent through the 6to4 tunnel
interface. The \fB6to4relay\fR command uses a project private ioctl to set the
variable.
.sp
.LP
\fB6to4relay\fR used without any options outputs the current, in-kernel,
configuration status. Use the \fB-a\fR option to send packets to a specific
relay router's \fBunicast\fR address instead of the default \fBanycast\fR
address. The address specified with the \fB-a\fR option does not specify the
policy for receiving traffic from relay routers. The source relay router on a
received packet is non-deterministic, since a different relay router may be
chosen for each sending native IPv6 end-point.
.sp
.LP
Configuration changes made by using the \fB6to4relay\fR are not persistent
across reboot. The changes will persist in the kernel only until you take the
tunnel down
.SH OPTIONS
.sp
.LP
The \fB6to4relay\fR command supports the following options:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR \fIaddr\fR\fR
.ad
.RS 11n
.rt  
Use the specified address, \fIaddr\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 11n
.rt  
Enable support for relay router. Use \fB-a\fR \fIaddr\fR if it is specified.
Otherwise, use the default \fBanycast\fR address, 192.88.99.1.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 11n
.rt  
Disable support for the relay router.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 11n
.rt  
Help
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIaddr\fR\fR
.ad
.RS 8n
.rt  
A specific relay router's unicast address. \fIaddr\fR must be specified as a
dotted decimal representation of an IPv4 address. Otherwise, an error will
occur, and the command will fail.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRPrinting the In-Kernel Configuration Status
.sp
.LP
Use \fB/usr/sbin/6to4relay\fR without any options to print the in-kernel
configuration status.

.sp
.in +2
.nf
example# \fB/usr/sbin/6to4relay\fR
.fi
.in -2
.sp

.sp
.LP
If 6to4 relay router communication is disabled, the administrator will see the
following message:

.sp
.in +2
.nf
6to4relay: 6to4 Relay Router communication support is disabled.
.fi
.in -2
.sp

.sp
.LP
If 6to4 router communication is enabled, the user will see this message:
.sp
.in +2
.nf
6to4relay: 6to4 Relay Router communication support is enabled.
IPv4 destination address of Relay Router = 192.88.99.1
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/sbin/6to4relay\fR \fR
.ad
.RS 24n
.rt  
The default installation root
.RE

.SH SEE ALSO
.sp
.LP
\fBifconfig\fR(1M), \fBattributes\fR(5)
.sp
.LP
Huitema, C. \fIRFC 3068, An Anycast Prefix for 6to4 Relay Routers\fR. Network
Working Group. June, 2001.
.sp
.LP
Carpenter, B. and Moore, K. \fIRFC 3056, Connection of IPv6 Domains via IPv4
Clouds\fR. Network Working Group. February, 2001.
.SH DIAGNOSTICS
.sp
.LP
The \fB6to4relay\fR reports the following messages:
.sp
.in +2
.nf
6to4relay: input (0.0.0.0) is not a valid IPv4 unicast address
.fi
.in -2
.sp

.RS +4
\fBExample: \fR
.sp
.LP
The following example provides an incorrect unicast address.
.sp
.in +2
.nf
example# \fB6to4relay -e -a 0.0.0.0\fR
.fi
.in -2
.sp
\fBDescription: \fR
.sp
.LP
The address specified with the \fB-a\fR option must be a valid unicast address.
.RE

.sp
.in +2
.nf
6to4relay: option requires an argument -a
usage:
    6to4relay
    6to4relay -e [-a <addr>]
    6to4relay -d
    6to4relay -h
.fi
.in -2
.sp

.RS +4
\fBExample: \fR
.sp
.LP
The following example does not include an argument for the \fB-a\fR option.
.sp
.in +2
.nf
example# \fB6to4relay -e -a \fR
.fi
.in -2
.sp
\fBDescription: \fR
.sp
.LP
The \fB-a\fR option requires an argument.
.RE

.sp
.in +2
.nf
usage:
    6to4relay
    6to4relay -e [-a <addr>]
    6to4relay -d
    6to4relay -h
.fi
.in -2
.sp

.RS +4
\fBExample: \fR
.sp
.LP
The following example specifies options that are not permitted.
.sp
.in +2
.nf
example# \fB6to4relay -e -d\fR
.fi
.in -2
.sp
\fBDescription: \fR
.sp
.LP
The options specified are not permitted. A usage message is output to the
screen.
.RE

.sp
.in +2
.nf
usage:
    6to4relay
    6to4relay -e [-a <addr>]
    6to4relay -d
    6to4relay -h
.fi
.in -2
.sp

.RS +4
\fBExample: \fR
.sp
.LP
The following example specifies the \fB-a\fR option without specifying the
\fB-e\fR option.
.sp
.in +2
.nf
example# \fB6to4relay -a 1.2.3.4\fR
.fi
.in -2
.sp
\fBDescription: \fR
.sp
.LP
The \fB-e\fR option is required in conjunction with the \fB-a\fR option. A
usage message is output to the screen.
.RE

.sp
.in +2
.nf
6to4relay: ioctl (I_STR) : Invalid argument
.fi
.in -2
.sp

.RS +4
\fBExample: \fR
.sp
.LP
The following example specifies an invalid address.
.sp
.in +2
.nf
example# \fB6to4relay -e -a 239.255.255.255\fR
.fi
.in -2
.sp
\fBDescription: \fR
.sp
.LP
The address specified with the \fB-a\fR option must not be a class d
\fIaddr\fR.
.RE

