illumos/illumos-gate/usr/src/man/man1m/bootconfchk.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH BOOTCONFCHK 1M "Apr 18, 2003"
.SH NAME
bootconfchk \- verify the integrity of a network boot configuration file
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/bootconfchk\fR [\fIbootconf-file\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBbootconfchk\fR command checks that the file specified is a valid network
boot configuration file as described in \fBwanboot.conf\fR(4).
.sp
.LP
Any discrepancies are reported on standard error.
.SH EXIT STATUS
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 5n
Successful completion.
.RE

.sp
.ne 2
.na
\fB\fB1\fR\fR
.ad
.RS 5n
An error occurred.
.RE

.sp
.ne 2
.na
\fB\fB2\fR\fR
.ad
.RS 5n
Usage error.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
\fBwanboot.conf\fR(4), \fBattributes\fR(5)
