illumos/illumos-gate/usr/src/man/man1m/check-permissions.1m
'\" te
.\"  Copyright (c) 2003 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH check-permissions 1M "10 Nov 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
check-permissions \- check permissions on mail rerouting files
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/check-permissions\fR [\fIlogin\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The  \fBcheck-permissions\fR script is intended as a migration aid for
\fBsendmail\fR(1M). It checks the \fB/etc/mail/sendmail.cf\fR file for all
configured alias files, and checks the alias files for \fB:include:\fR files.
It also checks for certain \fB\&.forward\fR files. For each file that
\fBcheck-permissions\fR checks, it verifies that none of the parent directories
are group- or world-writable. If any directories are overly permissive, it is
reported. Otherwise it reports that no unsafe directories were found.
.sp
.LP
As to which \fB\&.forward\fR files are checked, it depends on the arguments
included on the command line. If no argument is given, the current user's home
directory is checked for the presence of a  \fB\&.forward\fR file. If any
arguments are given, they are assumed to be valid logins, and the home
directory of each one is checked.
.sp
.LP
If the special argument \fBALL\fR is given,  the \fBpasswd\fR entry in the
\fB/etc/nsswitch.conf\fR file is checked, and all password entries that can be
obtained through the switch file are checked. In large domains, this can be
time-consuming.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIlogin\fR\fR
.ad
.RS 9n
.rt  
Where \fIlogin\fR is a valid user name, checks the home directory for
\fIlogin\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBALL\fR\fR
.ad
.RS 9n
.rt  
Checks the home directory of  \fBall\fR users.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/sendmail.cf\fR\fR
.ad
.RS 25n
.rt  
Defines environment for  \fBsendmail\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/aliases\fR\fR
.ad
.RS 25n
.rt  
Ascii mail aliases file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBgetent\fR(1M), \fBsendmail\fR(1M), \fBaliases\fR(4), \fBattributes\fR(5)
