illumos/illumos-gate/usr/src/man/man1m/clear_locks.1m
'\" te
.\"  Copyright (c) 1996, Sun Microsystems, Inc.
.\"  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CLEAR_LOCKS 1M "Oct 6, 2004"
.SH NAME
clear_locks \- clear locks held on behalf of an NFS client
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/clear_locks\fR [\fB-s\fR] \fIhostname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBclear_locks\fR command removes all file, record, and share locks created
by the \fIhostname\fR and held on the current host, regardless of which process
created or owns the locks.
.sp
.LP
This command can be run only by the super-user.
.sp
.LP
This command should only be used to repair the rare case of a client crashing
and failing to clear held locks. Clearing locks held by an active client may
cause applications to fail in an unexpected manner.
.SH OPTIONS
.sp
.ne 2
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
Remove all locks created by the current machine and held by the server
\fIhostname\fR.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.na
\fB\fIhostname\fR\fR
.ad
.RS 12n
name of host server
.RE

.SH EXIT STATUS
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 5n
Successful operation.
.RE

.sp
.ne 2
.na
\fB\fB1\fR\fR
.ad
.RS 5n
If not root.
.RE

.sp
.ne 2
.na
\fB\fB2\fR\fR
.ad
.RS 5n
Usage error.
.RE

.sp
.ne 2
.na
\fB\fB3\fR\fR
.ad
.RS 5n
If unable to contact server (\fBRPC\fR).
.RE

.SH SEE ALSO
.sp
.LP
\fBfcntl\fR(2), \fBattributes\fR(5)
