illumos/illumos-gate/usr/src/man/man1m/devattr.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH devattr 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
devattr \- display device attributes
.SH SYNOPSIS
.LP
.nf
\fBdevattr\fR [\fB-v\fR] \fIdevice\fR [\fIattribute\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBdevattr\fR displays the values for a device's attributes. The display can be
presented in two formats. Used without the  \fB-v\fR option, only the attribute
values are shown. Used with the  \fB-v\fR option, the attributes are shown in
an  \fIattribute\fR\fB=\fR\fIvalue\fR format. When no attributes are given on
the command line, all attributes for the  specified device are displayed in
alphabetical order by attribute name. If attributes are given on the command
line, only those attributes  are shown, displayed in command line order.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 6n
.rt  
Specifies verbose format. Attribute values are displayed in an
\fIattribute\fR\fB=\fR\fIvalue\fR format.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIattribute\fR\fR
.ad
.RS 13n
.rt  
Defines which attribute, or attributes, should be shown. Default is to show all
attributes for a device. See the \fBputdev\fR(1M) manual page for a complete
listing and description of available attributes.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdevice\fR\fR
.ad
.RS 13n
.rt  
Defines the device whose attributes should be displayed. Can be the pathname of
the device or the device alias.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
Command syntax was incorrect, invalid option was used, or an internal error
occurred.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Device table could not be opened for reading.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 5n
.rt  
Requested device could not be found in the device table.
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 5n
.rt  
Requested attribute was not defined for the specified device.
.RE

.SH FILES
.sp
.LP
\fB/etc/device.tab\fR
.SH SEE ALSO
.sp
.LP
\fBgetdev\fR(1M), \fBputdev\fR(1M), \fBattributes\fR(5)
