illumos/illumos-gate/usr/src/man/man1m/devnm.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DEVNM 1M "Sep 14, 1992"
.SH NAME
devnm \- device name
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/devnm\fR \fIname\fR [\fIname\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdevnm\fR command identifies the special file associated with the mounted
file system where the argument \fIname\fR resides. One or more \fIname\fR can
be specified.
.SH EXAMPLES
.LP
\fBExample 1 \fRUsing the devnm Command
.sp
.LP
Assuming that \fB/usr\fR is mounted on \fB/dev/dsk/c0t3d0s6\fR, the following
command :

.sp
.in +2
.nf
/usr/sbin/devnm /usr
.fi
.in -2
.sp

.sp
.LP
produces:
.sp
.in +2
.nf
/dev/dsk/c0t3d0s6 /usr
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.na
\fB\fB/dev/dsk/*\fR\fR
.ad
.RS 15n

.RE

.sp
.ne 2
.na
\fB\fB/etc/mnttab\fR\fR
.ad
.RS 15n

.RE

.SH SEE ALSO
.sp
.LP
\fBmnttab\fR(4), \fBattributes\fR(5)
