illumos/illumos-gate/usr/src/man/man1m/dfmounts.1m
'\" te
.\"  Copyright 1989 AT&T Copyright (c) 1995, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH dfmounts 1M "24 May 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
dfmounts \- display mounted resource information
.SH SYNOPSIS
.LP
.nf
\fBdfmounts\fR [\fB-F\fR \fIFSType\fR] [\fB-h\fR] [\fB-o\fR \fIspecific_options\fR] 
     [\fIrestriction\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBdfmounts\fR shows the local resources shared through a distributed file
system \fIFSType\fR along with a list of clients that have the resource
mounted. If \fIrestriction\fR is not specified, \fBdfmounts\fR shows file
systems that are currently shared on any \fBNFS\fR server.
\fIspecific_options\fR as well as the availability and semantics of
\fIrestriction\fR are specific to particular distributed file system types.
.sp
.LP
If \fBdfmounts\fR is entered without arguments, remote resources currently
mounted on the local system are displayed, regardless of file system type.
However, the \fBdfmounts\fR command does not display the names of NFS Version 4
clients.
.SS "\fBdfmounts\fR Output"
.sp
.LP
The output of \fBdfmounts\fR consists of an optional header line (suppressed
with the \fB-h\fR flag) followed by a list of lines containing
whitespace-separated fields. For each resource, the fields are:
.sp
.in +2
.nf
\fIresource server pathname clients ...\fR
.fi
.in -2

.sp
.LP
where:
.sp
.ne 2
.mk
.na
\fB\fIresource\fR\fR
.ad
.RS 12n
.rt  
Specifies the resource name that must be given to the \fBmount\fR(1M) command.
.RE

.sp
.ne 2
.mk
.na
\fB\fIserver\fR\fR
.ad
.RS 12n
.rt  
Specifies the system from which the resource was mounted.
.RE

.sp
.ne 2
.mk
.na
\fB\fIpathname\fR\fR
.ad
.RS 12n
.rt  
Specifies the pathname that must be given to the \fBshare\fR(1M) command.
.RE

.sp
.ne 2
.mk
.na
\fB\fIclients\fR\fR
.ad
.RS 12n
.rt  
Is a comma-separated list of systems that have mounted the resource. Clients
are listed in the form \fIdomain.\fR, \fIdomain.system\fR, or \fIsystem\fR,
depending on the file system type.
.RE

.sp
.LP
A field can be null. Each null field is indicated by a hyphen (\(mi) unless the
remainder of the fields on the line are also null, in which case the hyphen can
be omitted.
.sp
.LP
Fields with whitespace are enclosed in quotation marks (\fB"\|"\fR).
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIFSType\fR\fR
.ad
.RS 23n
.rt  
Specify filesystem type. Defaults to the first entry in \fB/etc/dfs/fstypes\fR.
\fBNote\fR: currently the only valid \fIFSType\fR is \fBnfs\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 23n
.rt  
Suppress header line in output.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIspecific_options\fR\fR
.ad
.RS 23n
.rt  
Specify options specific to the filesystem provided by the \fB-F\fR option.
\fBNote\fR: currently no options are supported.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/fstypes\fR\fR
.ad
.RS 20n
.rt  
file system types
.RE

.SH SEE ALSO
.sp
.LP
\fBdfshares\fR(1M), \fBmount\fR(1M), \fBshare\fR(1M), \fBunshare\fR(1M),
\fBattributes\fR(5)
