illumos/illumos-gate/usr/src/man/man1m/dlmgmtd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DLMGMTD 1M "Jul 30, 2008"
.SH NAME
dlmgmtd \- datalink management daemon
.SH SYNOPSIS
.LP
.nf
\fB/sbin/dlmgmtd\fR
.fi

.LP
.nf
svc:/network/datalink-management:default
.fi

.SH DESCRIPTION
.sp
.LP
\fBdlmgmtd\fR is a system daemon that handles administrative events for network
datalink interfaces. It is controlled through the service management facility
(SMF) service instance:
.sp
.in +2
.nf
svc:/network/datalink-management:default
.fi
.in -2
.sp

.sp
.LP
The daemon should not be invoked directly. It does not constitute an
administrative nor a programming interface. The administrative interface for
managing datalinks is \fBdladm\fR(1M).
.SH OPTIONS
.sp
.LP
The daemon has no options.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Private
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5)
