illumos/illumos-gate/usr/src/man/man1m/dscfglockd.1m
'\" te
.\"  Copyright (c) 2007, Sun Microsystems, Inc.  All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH dscfglockd 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
dscfglockd \- Availability Suite Services lock daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/dscfglockd\fR [\fB-e\fR \fIprogram\fR | \fB-f\fR \fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdscfglockd\fR daemon coordinates StorageTek configuration database lock
requests between nodes within a cluster.
.SH OPTIONS
.sp
.LP
The \fBdscfglockd\fR supports the following options:
.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIprogram\fR\fR
.ad
.sp .6
.RS 4n
Executes the script and arguments in \fIprogram\fR. The executable and any
arguments it needs must be supplied with suitable quoting as a single argument
to this option. This argument is processed by \fBsh\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile\fR\fR
.ad
.sp .6
.RS 4n
Reads the list of names for peer hosts from \fIfile\fR.
.RE

.sp
.LP
If no arguments are specified, \fBdscfglockd\fR acts as a local lock daemon,
but coordinates lock requests with any other daemons that might contact the
local host as part of their own configuration process.
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
Daemon failed to start.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-scm\fR\fR
.ad
.sp .6
.RS 4n
Shell script for starting and stopping \fBdscfglockd\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBsh\fR(1), \fBattributes\fR(5)
