illumos/illumos-gate/usr/src/man/man1m/fbconf_xorg.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FBCONF_XORG 1M "Jan 26, 2009"
.SH NAME
fbconf_xorg \- configure frame buffer devices for Xorg
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/fbconfig/fbconf_xorg\fR [\fB-dev\fR \fIdevice-file\fR]
     [\fB-file\fR machine | system | \fIconfig-path\fR]
     [\fB-res\fR \fIvideo-mode\fR [nocheck | noconfirm]]
     [\fIdevice-specific-options\fR]
     [\fB-defaults\fR] [\fB-prconf\fR] [\fB-predid\fR [raw] [parsed]] [\fB-propt\fR]
.fi

.LP
.nf
\fB/usr/lib/fbconfig/fbconf_xorg\fR [\fB-dev\fR \fIdevice-file\fR] [\fB-prconf\fR] [\fB-propt\fR]
.fi

.LP
.nf
\fB/usr/lib/fbconfig/fbconf_xorg\fR [\fB-dev\fR \fIdevice-file\fR] [\fB-help\fR] [\fB-res\fR ?]
.fi

.LP
.nf
For \fBkfb\fR devices:
.fi

.LP
.nf
\fB/usr/lib/fbconfig/fbconf_xorg\fR [\fB-dev\fR \fIdevice-file\fR]
     [\fB-file\fR machine | system | \fIconfig-path\fR]
     [\fB-res\fR \fIvideo-mode\fR [nocheck | noconfirm]]
     [\fB-deflinear\fR true | false] [\fB-defoverlay\fR true | false]
     [\fB-deftransparent\fR true | false]
     [\fB-doublehigh\fR enable | disable]
     [\fB-g\fR \fIgamma-correction-value\fR]
     [\fB-multisample\fR available | disable | forceon]
     [-\fBoffset\fR \fIx-val\fR \fIy-val\fR] [\fB-samples\fR 1 | 2 | 4 | 8 | 16 ]
     [\fB-slave\fR disable | multiview] [\fB-stereo\fR true | false]
     [\fB-defaults\fR] [\fB-prconf\fR] [\fB-predid\fR [raw] [parsed]] [\fB-propt\fR]
.fi

.SH DESCRIPTION
.LP
The \fBfbconf_xorg\fR utility configures Frame Buffer devices and some of the
X11 window system defaults for Xorg by updating the \fBxorg.conf\fR
configuration file.
.sp
.LP
The first \fBfbconf_xorg\fR command form shown in the \fBSYNOPSIS\fR section
stores the specified option values in the \fBxorg.conf\fR configuration file.
These settings are used to initialize the frame buffer device the next time the
window system is run on that device. The persistence of these settings across
window system sessions and system reboots is determined by the \fBxorg.conf\fR
file.
.sp
.LP
The second and third command forms display information, and do not alter the
\fBxorg.conf\fR file. The presence of the \fB-help\fR and/or \fB-res\fR \fB?\fR
options will cause any other option (not shown in the third form) to be
ignored.
.sp
.LP
You can configure only one frame buffer device at a time. To configure multiple
devices, invoke the \fBfbconf_xorg\fR utility separately for each device.
.sp
.LP
Only frame buffer device options can be specified with \fBfbconf_xorg\fR. Use
the normal window system options to specify default depth (see
\fBsvccfg\fR(1M)), default visual class, and so forth. Specify these as device
modifiers on the command line. See\fI Xserver(1)\fR, part of the OpenWindows,
not the SunOS, man page collection.
.sp
.LP
You can specify which \fBxorg.conf\fR file to open. By default,
\fBfbconf_xorg\fR opens the machine-specific file, \fB/etc/X11/xorg.conf\fR.
Use the \fB-file\fR option to specify an alternate file. For example, the
system-global file, \fB/usr/X11/xorg.conf\fR, can be opened instead.
.sp
.LP
These standard \fBxorg.conf\fR files can be written only by the superuser or
someone with the Primary Administrator role. Consequently, the
\fBfbconf_xorg\fR program is run with setuid root permission.
.SH OPTIONS
.LP
The following options are supported for all frame buffer devices:
.sp
.ne 2
.na
\fB\fB-defaults\fR\fR
.ad
.sp .6
.RS 4n
Sets configuration options for the specified device to their default values.
This does not affect the \fB-res\fR video mode setting. See the device-specific
portions of the \fBDEFAULTS\fR section below.
.RE

.sp
.ne 2
.na
\fB\fB-dev\fR \fIdevice-file\fR\fR
.ad
.sp .6
.RS 4n
Specifies the frame buffer device by either its full pathname or simple
filename (for example, \fB/dev/fbs/kfb0\fR or \fBkfb0\fR). Pathnames of
installed devices can be displayed using the \fB-list\fR option to
\fBfbconfig\fR(1M). If the \fB-dev\fR option is omitted, the default device,
\fB/dev/fb\fR, is used.
.RE

.sp
.ne 2
.na
\fB\fB-file\fR \fBmachine\fR | \fBsystem\fR | \fIconfig-path\fR\fR
.ad
.sp .6
.RS 4n
Specifies which \fBxorg.conf\fR file to open. If \fBmachine\fR is specified,
the machine-specific \fB/etc/X11/xorg.conf\fR file is opened. If system is
specified, the global \fB/usr/X11/xorg.conf\fR file is opened. The absolute
pathname of  a configuration file can be used instead. If the specified file
does not exist and is to be updated, it will be created. The file system that
will contain the \fBxorg.conf\fR file must be writable by someone with
superuser-like privileges. This option has no effect unless other options are
specified. The default is \fBmachine\fR.
.RE

.sp
.ne 2
.na
\fB\fB-help\fR\fR
.ad
.sp .6
.RS 4n
Display the \fBfbconf_xorg\fR command line options that are supported in
conjunction with the frame buffer device, along with a brief explanation of
each option. The frame buffer device can be specified using the \fB-dev\fR
option.
.RE

.sp
.ne 2
.na
\fB\fB-prconf\fR\fR
.ad
.sp .6
.RS 4n
Display the current configuration for the frame buffer device and attached
display device(s). The frame buffer device can be specified using the
\fB-dev\fR option.
.sp
The \fB-prconf\fR output might resemble:
.sp
.in +2
.nf
Monitor/Resolution Information:
    Monitor manufacturer: SUN
    Product Code:  4
    Serial Number: 12212555
    Manufacture date: 2000, week 9
    EDID Version:  1.1
    Monitor dimensions: 36x29 cm
    Default Gamma: 2.62
    Monitor preferred resolution: SUNW_STD_1280x1024x60
    Monitor supported resolutions from EDID: SUNW_STD_1280x1024x60,
        SUNW_STD_1280x1024x76, 1152x900x66, VESA_STD_1280x1024x75,
        VESA_STD_1280x1024x60, SUNW_STD_1152x900x66,
        VESA_STD_720x400x70, VESA_STD_640x480x60,
        VESA_STD_640x480x67, VESA_STD_640x480x72,
        VESA_STD_640x480x75, VESA_STD_800x600x56,
        VESA_STD_800x600x60, VESA_STD_800x600x72,
        VESA_STD_800x600x75, VESA_STD_832x624x75,
        VESA_STD_1024x768x60, VESA_STD_1024x768x70, 1024x768x75
    Current resolution setting: FALLBACK_1152x900x66

Framelock Configuration:
    Slave Mode: Disabled
.fi
.in -2
.sp

.RE

.sp
.ne 2
.na
\fB\fB-predid\fR  [\fBraw\fR] [\fBparsed\fR]\fR
.ad
.sp .6
.RS 4n
Display the E-EDID (Enhanced Extended Display Identification Data) information
obtained from the display device(s), which must be online, connected to the
frame buffer. The frame buffer device can be specified using the \fB-dev\fR
option. The output will be raw hexadecimal and/or human-readable (parsed) text.
The default is parsed.
.sp
The \fB-predid\fR raw output might resemble:
.sp
.in +2
.nf
--- EDID Data for /dev/fbs/kfb0 ---

Block 0: EDID Base Block
        0x00:  00 FF FF FF FF FF FF 00 04 43 06 F2 01 00 00 00
        0x10:  01 11 01 04 0F 2B 20 78 2B 9C 68 A0 57 4A 9B 26
        0x20:  12 48 4C FF FF 80 A9 59 A9 4F A9 4A A9 45 81 99
        0x30:  81 80 61 59 45 59 48 3F 40 30 62 B0 32 40 40 C0
        0x40:  13 00 AB 40 11 00 00 1E 00 00 00 FD 00 32 5A 1E
        0x50:  6E 17 04 11 00 C8 90 00 50 3C 00 00 00 F7 00 0A
        0x60:  F7 0F 03 87 C0 00 00 00 00 00 00 00 00 00 00 FC
        0x70:  00 41 42 43 20 4C 43 44 32 31 0A 20 20 20 00 0B
.fi
.in -2
.sp

.RE

.sp
.ne 2
.na
\fB\fB-propt\fR\fR
.ad
.sp .6
.RS 4n
Display all option settings for the frame buffer device, either as they
currently are or as they will be represented in the \fBxorg.conf\fR
configuration file when \fBfbconf_xorg\fR completes. The device can be
specified using the \fB-dev\fR option, and the file using the \fB-file\fR
option.
.sp
The \fB-propt\fR output might resemble:
.sp
.in +2
.nf
           --- Graphics Configuration for /dev/fbs/kfb0 ---

           xorg.conf: machine -- /etc/X11/xorg.conf
               Screen section:  "kfb0"
               Device section:  "kfb0"
               Monitor section: "kfb0"

           Video Mode: SUNW_STD_1280x1024x76
               StereoEnable: False

           Multisample Information:
               Multisample Mode: Disable
               Samples Per Pixel: 4

           Screen Information:
               DoubleWide: Disabled
               DoubleHigh: Disabled
               Offset/Overlap: [0, 0]

           Visual Information:
               Default Visual: Non-Linear Normal Visual
               Gamma Correction Value: Using gamma value 2.22
.fi
.in -2
.sp

.RE

.sp
.ne 2
.na
\fB\fB-res\fR \fB?\fR\fR
.ad
.sp .6
.RS 4n
Display a list of video modes that can be used with the \fB-res\fR
\fIvideo-mode\fR option.
.sp
The \fB?\fR argument may need to be escaped or placed in quotes (\e?, "?",
or '?'), to protect it from misinterpretation by the shell.
.sp
The \fB-res\fR \fB?\fR output might resemble:
.sp
.in +2
.nf
           Video modes accepted by the -res option:
                AUTO                      [1][2]
                NONE                      [1][2]
                SUNW_STD_1920x1200x75
                SUNW_STD_1920x1200x70
                SUNW_DIG_1920x1200x60
                SUNW_STD_1920x1080x72
                SUNW_DIG_1920x1080x60
                  ...
                  ...
                VESA_STD_640x480x75       [1]
                VESA_STD_640x480x72       [1]
                VESA_STD_640x480x60       [1]

           [1] Resolution is supported by monitor
           [2] Preferred resolution for monitor
.fi
.in -2
.sp

Abbreviations such as "\fB1280x1024x75\fR" might also be used.
.RE

.sp
.ne 2
.na
\fB\fB-res\fR \fIvideo-mode\fR [\fBnocheck\fR | \fBnoconfirm\fR]\fR
.ad
.sp .6
.RS 4n
Set the video mode for the display device that is connected to the frame buffer
device.
.sp
A list of video modes can be displayed using the \fB-res\fR \fB?\fR option.
.sp
The basic format of a video-mode is \fIwidth\fRx\fIheight\fRx\fIrate\fR, where:
.RS +4
.TP
.ie t \(bu
.el o
\fIwidth\fR is the screen width in pixels.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fIheight\fR is the screen height in pixels.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fIrate\fR is the vertical frequency of the screen refresh.
.RE
A video-mode argument may have an \fB@\fR (at sign) instead of \fBx\fR
preceding the refresh rate. For instance, \fB1280x1024x76\fR and
\fB1280x1024@76\fR are equivalent.
.sp
A video-mode name may carry additional information, as with
\fBSUNW_STD_1280x1024x76\fR.
.sp
The \fB-res\fR argument, \fBauto\fR, represents the video mode that is
currently programmed into the device. The argument, \fBnone\fR, is a synonym
for \fBauto\fR.
.sp
Note that some video modes might be inappropriate for certain frame buffer
devices and/or display devices.
.sp
The \fB-res\fR option accepts suboption keywords following the video-mode
specification.
.sp
.ne 2
.na
\fB\fBnocheck\fR\fR
.ad
.sp .6
.RS 4n
The \fBnocheck\fR suboption causes the video-mode argument to be accepted,
regardless of whether it is supported by the currently attached monitor,
whether it is known within the current configuration, and so forth. Note that
using an unchecked, inappropriate video mode can leave the system without
usable video output. This suboption is useful if a different monitor is to be
connected to the frame buffer device. This suboption also implies
\fBnoconfirm\fR.
.RE

.sp
.ne 2
.na
\fB\fBnoconfirm\fR\fR
.ad
.sp .6
.RS 4n
If the video-mode argument is unable to be validated,  the default action is to
display a warning message and ask the user whether to continue. The
\fBnoconfirm\fR suboption suppresses this confirmation request. This suboption
is useful when \fBfbconf_xorg\fR is being run from a shell script.
.RE

.RE

.sp
.LP
The following device-specific options are supported for certain frame buffer
devices. Unless specified otherwise, these options do not take effect until the
user logs out and back in.
.sp
.ne 2
.na
\fB\fB-deflinear\fR \fBtrue\fR | \fBfalse\fR\fR
.ad
.sp .6
.RS 4n
This option selects the default X visual. Two types of visuals are supported,
linear and nonlinear. Linear visuals are gamma corrected. Nonlinear visuals are
not.
.sp
If the value of this option is \fBtrue\fR, the default visual is set to default
depth 24 and the default class is \fBTrueColor\fR with gamma correction
enabled. If \fBfalse\fR, a nonlinear visual that satisfies the other default
visual selection options, such as the default depth and default class, is
chosen as the default visual.
.sp
The \fB-deflinear\fR, \fB-defoverlay\fR, and \fB-deftransparent\fR options each
select the default X visual. Only one of these may be enabled at a time.
Enabling one causes the others to be disabled.
.RE

.sp
.ne 2
.na
\fB\fB-defoverlay\fR \fBtrue\fR | \fBfalse\fR\fR
.ad
.sp .6
.RS 4n
This option selects the default X visual. The \fBkfb\fR device provides an
8-bit PseudoColor visual whose pixels are disjoint from the rest of the
visuals. This is called the overlay visual. Windows created in this visual will
not damage windows created in other visuals. The converse, however, is not
true: Windows created in other visuals will damage overlay windows.
.sp
If the value of this option is \fBtrue\fR, the overlay visual is the default
visual. The default depth is 8-bit and the default class is PseudoColor. If
\fBfalse\fR, the non-overlay visual that satisfies the other default visual
selection options, such as the default depth and the default class, is chosen
as the default visual.
.sp
The \fB-deflinear\fR, \fB-defoverlay\fR, and \fB-deftransparent\fR options each
select the default X visual. Only one of these may be enabled at a time.
Enabling one causes the others to be disabled.
.RE

.sp
.ne 2
.na
\fB\fB-deftransparent\fR \fBtrue\fR | \fBfalse\fR\fR
.ad
.sp .6
.RS 4n
This option selects the default X visual. The \fBkfb\fR device provides an
8-bit PseudoColor visual whose pixels are disjoint from the rest of the
visuals. This is called the overlay visual. Windows created in this visual will
not damage windows created in other visuals.
.sp
If the value of this option is \fBtrue\fR, the overlay visual used as the
default is a transparent overlay visual. A visual with transparency supports a
colormap with 255 colors and one transparent pixel. The default depth is 8-bit
and the default class is PseudoColor. If \fBfalse\fR, the nonoverlay visual
that satisfies the other default visual selection options, such as the default
depth and the default class, is chosen as the default visual.
.sp
The \fB-deflinear\fR, \fB-defoverlay\fR, and \fB-deftransparent\fR options each
select the default X visual. Only one of these may be enabled at a time.
Enabling one causes the others to be disabled.
.RE

.sp
.ne 2
.na
\fB\fB-doublehigh\fR \fBenable\fR | \fBdisable\fR\fR
.ad
.sp .6
.RS 4n
Configures the two outputs of the frame buffer device into one vertical virtual
display. The default is \fBdisable\fR. The \fB-doublewide\fR and
\fB-doublehigh\fR options are mutually exclusive. Enabling one causes the other
to be disabled.
.RE

.sp
.ne 2
.na
\fB\fB-doublewide\fR \fBenable\fR | \fBdisable\fR\fR
.ad
.sp .6
.RS 4n
Configures the two outputs of the frame buffer device into one horizontal
virtual display. The default is \fBdisable\fR. The \fB-doublewide\fR and
\fB-doublehigh\fR options are mutually exclusive. Enabling one causes the other
to be disabled.
.RE

.sp
.ne 2
.na
\fB\fB-g\fR \fIgamma-correction-value\fR\fR
.ad
.sp .6
.RS 4n
Sets the gamma correction value. All linear visuals provide gamma correction.
The gamma correction value should be in the range, \fB0.1\fR to \fB10.0\fR. The
default is \fB2.22\fR. This option can be used while the window system is
running. Changing the gamma correction value affects all of the windows
displayed by linear visuals.
.RE

.sp
.ne 2
.na
\fB\fB-gfile\fR \fIgamma-correction-file\fR\fR
.ad
.sp .6
.RS 4n
Loads the gamma correction table from the file specified by
\fIgamma-correction-file\fR. This text file specifies the gamma correction
values for the R, G, and B channels. Three consecutive values form an RGB
triplet. For a \fBkfb\fR device, there must be exactly 256 RGB triplets. A
value may be represented in hexadecimal, decimal, or octal format (for example,
\fB0x3FF\fR, \fB1023\fR, or \fB01777\fR, respectively). Values are separated by
one or more whitespace or new line characters. Comments begin with a hash sign
character (\fB#\fR) and end at the end of the line.
.sp
You can load the gamma correction table with this option while the window
system is running. The new gamma correction affects all the windows being
displayed using the linear visuals. When gamma correction is done using a
user-specified table, the gamma correction value (\fB-g\fR) is undefined. By
default, the window system assumes a gamma correction value of \fB2.22\fR and
loads the gamma table it creates corresponding to this value.
.sp
The following is an example of a \fIgamma-correction-file\fR file:
.sp
.in +2
.nf
             # Gamma Correction Table
             0x00 0x00 0x00
             0x01 0x01 0x01
             0x02 0x02 0x02
              ...  ...  ...
              ...  ...  ...
             0xFF 0xFF 0xFF
.fi
.in -2
.sp

.RE

.sp
.ne 2
.na
\fB\fB-multisample\fR \fBavailable\fR | \fBdisable\fR | \fBforceon\fR\fR
.ad
.sp .6
.RS 4n
If set to disable, no multisample is possible. If set to available, multisample
is possible but is selected on a per-window basis using a library interface. If
set to \fBforceon\fR, all Sun OpenGL windows are rendered using multisampling.
To query the number of samples used, specify the \fB-propt\fR option or run the
\fBxglinfo\fR utility. The \fBxglinfo\fR utility can return the number of
multisamples if \fB-multisample\fR is set to available. The default is
\fBdisable\fR. \fBxglinfo\fR is described in the \fBxglinfo(1)\fR man page, in
the Sun OpenGL man page collection.
.RE

.sp
.ne 2
.na
\fB\fB-offset\fR \fIx-val\fR \fIy-val\fR\fR
.ad
.sp .6
.RS 4n
Adjusts the position of the specified stream by the value specified. This
option is only implemented in \fB-doublewide\fR and \fB-doublehigh\fR modes.
For \fB-doublewide\fR, use the \fIx-val\fR to position the rightmost stream.
Negative is left (overlaps with the left stream). For \fB-doublehigh\fR, use
the \fIy-val\fR to position the bottom stream. Negative is up (overlaps with
top stream). The default is \fB[0,0]\fR.
.RE

.sp
.ne 2
.na
\fB\fB-samples\fR \fB1\fR | \fB2\fR  | \fB4\fR | \fB8\fR | \fB16\fR\fR
.ad
.sp .6
.RS 4n
Requests the number of samples to compute per display pixel. The requested
number of samples per pixel is used if \fB-multisample\fR is not disabled and
resources exist for the request. To query the number of samples used, specify
the \fB-propt\fR option or run the \fBxglinfo\fR utility. The \fBxglinfo\fR
utility can return the number of  multisamples after you specify the option
\fB-multisample\fR available. The default is \fB4\fR.
.RE

.sp
.ne 2
.na
\fB\fB-slave\fR \fBdisable\fR | \fBmultiview\fR\fR
.ad
.sp .6
.RS 4n
If you set the \fBmultiview\fR argument for the \fB-slave\fR option, the device
synchronizes video with a master through the multiview genlock ribbon cable.
The system should be powered off whenever connecting or disconnecting this
cable. Both devices should be running the same resolution and the option should
be issued when the window system is running. The default is \fBdisable\fR.
.RE

.SH DEFAULTS
.LP
Certain options have implied default arguments. The default argument is used
when the option is not present on the \fBfbconf_xorg\fR command line. For
instance, a default argument for \fB-dev\fR is \fB/dev/fb\fR.
.sp
.LP
Options that set configuration state do not have implied defaults. The
\fB-res\fR option is one example. If a configuration option is omitted from the
\fBfbconf_xorg\fR command line, the corresponding \fBxorg.conf\fR configuration
setting will remain unchanged. The exception is that if configuration options
are mutually exclusive, setting one will automatically unset each of the
others. An example is \fB-deflinear\fR, \fB-defoverlay\fR, and
\fB-deftransparent\fR.
.sp
.LP
If a configuration setting is not present in the configura tion file when the
window system is run, a default value will be used. For instance, the default
state associated with \fB-res\fR is \fBauto\fR. A setting might not be present
in the file, or the file itself might not exist, until \fBfbconf_xorg\fR has
been invoked with the corresponding command line option.
.sp
.LP
The \fB-defaults\fR option sets the default values for most configuration
settings.
.sp
.LP
Options and their defaults are shown below.
.sp
.LP
Device-independent defaults:
.sp
.in +2
.nf
             Option            Default Argument
             -dev              /dev/fb
             -file             machine

             Option            Default State
             -res              auto
.fi
.in -2
.sp

.sp
.LP
\fBkfb\fR-specific defaults:
.sp
.in +2
.nf
             Option            Default State or -defaults Value
             -deflinear        false
             -defoverlay       false
             -deftransparent   false
             -doublehigh       disable
             -doublewide       disable
             -g                2.22
             -multisample      disable
             -offset           0 0
             -samples          4
             -slave            disable
             -stereo           false
.fi
.in -2
.sp

.SH EXAMPLES
.LP
\fBExample 1 \fRSwitching the Resolution of the Monitor Type
.sp
.LP
The following example sets the video mode for the monitor on the
\fB/dev/fbs/kfb0\fR device to 1280 x 1024 at 76 Hz:

.sp
.in +2
.nf
example% \fBfbconf_xorg -dev kfb0 -res 1280x1024x76\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
Execution completed successfully.
.RE

.sp
.ne 2
.na
\fB\fB1\fR\fR
.ad
.sp .6
.RS 4n
Invalid command line usage.
.RE

.sp
.ne 2
.na
\fB\fB2\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH FILES
.ne 2
.na
\fB\fB/dev/fb\fR\fR
.ad
.sp .6
.RS 4n
Symbolic link to the default frame buffer device.
.RE

.sp
.ne 2
.na
\fB\fB/dev/fbs/kfb\fIn\fR\fR\fR
.ad
.sp .6
.RS 4n
Device special file for a \fBkfb\fR frame buffer
.RE

.sp
.ne 2
.na
\fB\fB/usr/lib/fbconfig/SunModes_xorg.conf\fR\fR
.ad
.sp .6
.RS 4n
Video mode definitions included in new configuration files.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Uncommitted
.TE

.SH SEE ALSO
.LP
\fBfbconfig\fR(1M), \fBsvccfg\fR(1M), \fBattributes\fR(5), \fBkfb\fR(7D),
\fBfbio\fR(7I)
.sp
.LP
See the \fIXorg(1)\fR and \fIXserver(1)\fR man pages in the X Server man page
collection and the \fIxglinfo(1)\fR man page in the Sun OpenGL man page
collection.
