illumos/illumos-gate/usr/src/man/man1m/fdetach.1m
'\" te
.\"  Copyright 1989 AT&T Copyright (c) 1997 Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH fdetach 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
fdetach \- detach a name from a STREAMS-based file descriptor
.SH SYNOPSIS
.LP
.nf
\fBfdetach\fR \fIpath\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfdetach\fR command detaches a \fBSTREAMS-based\fR file descriptor from a
name in the file system. Use the \fIpath\fR operand to specify the path name of
the object in the file system name space, which was previously attached. See
\fBfattach\fR(3C).
.sp
.LP
The user must be the owner of the file or a user with the appropriate
privileges. All subsequent operations on \fIpath\fR will operate on the
underlying file system entry and not on the \fBSTREAMS\fR file. The permissions
and status of the entry are restored to the state they were in before the
\fBSTREAMS\fR file was attached to the entry.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIpath\fR\fR
.ad
.RS 8n
.rt  
Specifies the path name of the object in the file system name space, which was
previously attached.
.RE

.SH SEE ALSO
.sp
.LP
\fBfattach\fR(3C), \fBfdetach\fR(3C), \fBattributes\fR(5), \fBstreamio\fR(7I)
.sp
.LP
\fI\fR
