illumos/illumos-gate/usr/src/man/man1m/fssnap.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH fssnap 1M "11 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
fssnap \- create temporary snapshots of a file system
.SH SYNOPSIS
.LP
.nf
\fBfssnap\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] \fB-o\fR \fIspecial_options\fR \fI/mount/point\fR
.fi

.LP
.nf
\fBfssnap \fR \fB-d\fR [\fB-F\fR \fI FSType\fR] [\fB-V\fR] \fI/mount/point\fR | \fIdev\fR
.fi

.LP
.nf
\fBfssnap\fR \fB-i\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] [\fB-o\fR \fIspecial_options\fR] 
     [\fI/mount/point\fR | \fIdev\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfssnap\fR command creates a stable, read-only snapshot of a file system
when given either an active mount point or a special device containing a
mounted file system, as in the first form of the synopsis. A snapshot is a
temporary image of a file system intended for backup operations.
.sp
.LP
While the snapshot file system is stable and consistent, an application
updating files when the snapshot is created might leave these files in an
internally inconsistent, truncated, or otherwise unusable state. In such a
case, the snapshot will contain these partially written or corrupted files. It
is a good idea to ensure active applications are suspended or checkpointed and
their associated files are also consistent during snapshot creation.
.sp
.LP
File access times are not updated while the snapshot is being created.
.sp
.LP
A path to the virtual device that contains this snapshot is printed to standard
output when a snapshot is created.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 22n
.rt  
Deletes the snapshot associated with the given file system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fIFSType\fR\fR
.ad
.RS 22n
.rt  
Specifies the file system type to be used. The \fBFSType\fR should either be
specified here or be determined by matching the block special device with an
entry in the \fB/etc/vfstab\fR table, or by consulting \fB/etc/default/fs\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 22n
.rt  
Displays the state of any given \fBFSType\fR snapshot. If a mount-point or
device is not given, a list of all snapshots on the system is displayed. When a
mount-point or device is specified, detailed information is provided for the
specified file system snapshot by default. The format and meaning of this
information is file-system dependent. See the \fBFSType\fR-specific
\fBfssnap\fR man page for details.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIspecial_options\fR\fR
.ad
.RS 22n
.rt  
See the \fBFSType\fR-specific man page for \fBfssnap\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 22n
.rt  
Echoes the complete command line, but does not execute the command.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fI/mount/point\fR\fR
.ad
.RS 16n
.rt  
The directory where the file system resides.
.RE

.SH EXAMPLES
.sp
.LP
See \fBFSType\fR-specific man pages for examples.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/vfstab\fR\fR
.ad
.RS 19n
.rt  
Specifies file system type.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/default/fs\fR\fR
.ad
.RS 19n
.rt  
Specifies the default local file system type.
.RE

.SH SEE ALSO
.sp
.LP
\fBfssnap_ufs\fR(1M), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
This command might not be supported for all \fBFSTypes\fR.
