illumos/illumos-gate/usr/src/man/man1m/ftpaddhost.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ftpaddhost 1M "1 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ftpaddhost \- set up a virtual FTP host
.SH SYNOPSIS
.LP
.nf
\fBftpaddhost\fR \fB-c\fR | \fB-l\fR [\fB-b\fR] [\fB-x\fR \fIxferlog\fR] \fIhostname\fR \fIroot_dir\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBftpaddhost\fR script is executed by the super user to set up virtual FTP
hosts. The \fBftpaddhost\fR command configures the virtual host \fIhostname\fR
under directory \fIroot_dir\fR. The value of \fIhostname\fR can be an IP
address or the name of a host.
.SH OPTIONS
.sp
.LP
The \fBftpaddhost\fR script supports the following options:
.sp
.ne 2
.mk
.na
\fB\fB-b\fR\fR
.ad
.RS 14n
.rt  
Create a banner for the virtual host. This option is useful to confirm that the
virtual host is working.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 14n
.rt  
Configure complete virtual hosting. This option allows each virtual host to
have its own version of the \fBftpaccess\fR, \fBftpconversions\fR,
\fB\fR\fBftpgroups\fR, \fBftphosts\fR, and \fBftpusers\fR files. The master
version of each of these configuration files is copied from the \fB/etc/ftpd\fR
directory and placed in  the \fB/etc/ftpd/virtual-ftpd/\fIhostname\fR\fR
directory. If the \fB/etc/ftpusers\fR file exists it is appended to the virtual
\fBftpusers\fR file. If a virtual host lacks its own version of a configuration
file, the master version is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 14n
.rt  
Configure limited virtual hosting. This  option allows a small number of
parameters to be configured differently for a  virtual host. See the
\fBvirtual\fR keyword on the \fBftpaccess\fR(4) manual page.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fIxferlog\fR\fR
.ad
.RS 14n
.rt  
Create a logfile entry such that the transfer logs for the virtual host are
written to the specified file. An absolute path must be specified for the
\fIxferlog\fR file.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIhostname\fR\fR
.ad
.RS 12n
.rt  
The host name or IP address of the virtual server.
.RE

.sp
.ne 2
.mk
.na
\fB\fIroot_dir\fR\fR
.ad
.RS 12n
.rt  
The absolute pathname of the directory under which the virtual server is set
up.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 6n
.rt  
Improper usage of the command
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
Command failed
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/ftpd/virtual-ftpd/\fIhostname\fR\fR\fR
.ad
.sp .6
.RS 4n
The configuration files directory for the virtual host \fIhostname\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBftpconfig\fR(1M), \fBin.ftpd\fR(1M), \fBftpaccess\fR(4),
\fBftpconversions\fR(4), \fBftpgroups\fR(4), \fBftphosts\fR(4),
\fBftpusers\fR(4), \fBxferlog\fR(4), \fBattributes\fR(5)
