illumos/illumos-gate/usr/src/man/man1m/ftpconfig.1m
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ftpconfig 1M "1 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ftpconfig \- set up anonymous FTP
.SH SYNOPSIS
.LP
.nf
\fBftpconfig\fR [\fIftpdir\fR]
.fi

.LP
.nf
\fBftpconfig\fR \fB-d\fR \fIftpdir\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBftpconfig\fR script is executed by the super user to set up anonymous
FTP. Anonymous FTP allows users to remotely log on to the FTP server by
specifying the user name  \fBftp\fR or \fBanonymous\fR and the user's email
address as password. The anonymous users are logged on to the FTP Server and
given access to a restricted file area with its own file system root. See
\fBchroot\fR(2). The FTP area has  its own minimal system files.
.sp
.LP
This command will copy and set up all the components needed to operate an
anonymous FTP server, including creating the \fIftp\fR user account, creating
device nodes, copying \fB/usr/lib\fR files, and copying timezone data.  The
\fBpasswd\fR and \fBgroup\fR files set up have been stripped down to prevent
malicious users from finding login names on the server.  The anonymous file
area will be placed under \fBftpdir\fR. If the \fIftp\fR user account already
exists, then the current FTP area is used, and the system files in it are
updated. All other files are left untouched. This command should be run to
update the anonymous FTP area's configuration whenever a system patch is
installed, or the system is upgraded.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fR
.ad
.RS 7n
.rt  
Create a new or update an existing \fIftpdir\fR without creating or updating
the \fIftp\fR user account. Use this option when creating guest FTP user
accounts.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIftpdir\fR\fR
.ad
.RS 10n
.rt  
The absolute pathname of the directory under which the anonymous FTP area is
set up.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 6n
.rt  
Improper usage of the command
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
Command failed
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBftpaddhost\fR(1M), \fBin.ftpd\fR(1M), \fBuseradd\fR(1M), \fBchroot\fR(2),
\fBattributes\fR(5)
