illumos/illumos-gate/usr/src/man/man1m/ftprestart.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FTPRESTART 1M "May 1, 2003"
.SH NAME
ftprestart \- restart previously shutdown FTP Servers
.SH SYNOPSIS
.LP
.nf
\fBftprestart\fR [\fB-V\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Use the \fBftprestart\fR command to restart an FTP Server previously shut down
by means of \fBftpshut\fR(1M). The \fBftprestart\fR command reads the
\fBshutdown\fR capability from the \fBftpaccess\fR(4) file to determine the
path of the shutdown message files. It then reenables the FTP Server by
removing any shutdown message files in the anonymous and virtual FTP Server
area, as well as the system wide shutdown message file.
.SH OPTIONS
.sp
.LP
The \fBftprestart\fR command supports the following options:
.sp
.ne 2
.na
\fB\fB-V\fR\fR
.ad
.RS 6n
Display program copyright and version information, then terminate.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSample Output from \fBftprestart\fR
.sp
.LP
The following example shows sample output from the \fBftprestart\fR command:

.sp
.in +2
.nf
example% \fBftprestart\fR
ftprestart: /export/home/ftp/etc/ftpd/shutdown.msg removed.
ftprestart: /export/home/virtual1/etc/ftpd/shutdown.msg removed.
ftprestart: /etc/ftpd/shutdown.msg removed.
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR \fR
.ad
.RS 6n
Successful completion.
.RE

.sp
.ne 2
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/ftpd/ftpaccess\fR\fR
.ad
.RS 24n

.RE

.sp
.ne 2
.na
\fB\fB/etc/ftpd/ftpservers\fR\fR
.ad
.RS 24n

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	External
.TE

.SH SEE ALSO
.sp
.LP
\fBftpshut\fR(1M), \fBin.ftpd\fR(1M), \fBftpaccess\fR(4), \fBftpservers\fR(4),
\fBattributes\fR(5)
