illumos/illumos-gate/usr/src/man/man1m/hextoalabel.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH hextoalabel 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
hextoalabel \- convert an internal text label to its human readable equivalent
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/hextoalabel\fR [\fIinternal-text-sensitivity-label\fR]
.fi

.LP
.nf
\fB/usr/sbin/hextoalabel\fR \fB-c\fR [\fIinternal-text-clearance\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBhextoalabel\fR converts an internal text label into its human readable
equivalent and writes the result to the standard output file. This internal
form is often hexadecimal. If no option is supplied, the label is assumed to be
a sensitivity label.
.sp
.LP
If no internal text label is specified, the label is read from the standard
input file. The expected use of this command is emergency repair of labels that
are stored in internal databases.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
Identifies the internal text label as a clearance.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
On success.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
On failure, and writes diagnostics to the standard error file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilitySee below.
.TE

.sp
.LP
The command output is Committed for systems with the same \fBlabel_encodings\fR
file. The command invocation is Committed for systems that implement the DIA
MAC policy.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/tsol/label_encodings\fR\fR
.ad
.sp .6
.RS 4n
The label encodings file contains the classification names, words, constraints,
and values for the defined labels of this system.
.RE

.SH SEE ALSO
.sp
.LP
\fBatohexlabel\fR(1M), \fBlabel_to_str\fR(3TSOL), \fBstr_to_label\fR(3TSOL),
\fBlabel_encodings\fR(4), \fBattributes\fR(5)
.sp
.LP
\fIHow to Get a Readable Label From Its Hexadecimal Form\fR in \fISolaris
Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system
is configured with Trusted Extensions.
.sp
.LP
This file is part of the Defense Intelligence Agency (DIA) Mandatory Access
Control (MAC) policy. This file might not be applicable to other MAC policies
that might be developed for future releases of Solaris Trusted Extensions
software.
