illumos/illumos-gate/usr/src/man/man1m/htable.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH htable 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
htable \- convert DoD Internet format host table
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/htable\fR \fIfilename\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBhtable\fR converts a host table in the format specified by \fBRFC\fR 952 to
the format used by the network library routines.  Three files are created as a
result of running \fBhtable\fR: \fBhosts\fR, \fBnetworks\fR, and
\fBgateways\fR. The \fBhosts\fR file is used by the \fBgethostbyname\fR(3NSL)
routines in mapping host names to addresses.  The \fBnetworks\fR file is used
by the \fBgetnetbyname\fR(3SOCKET) routines in mapping network names to
numbers. The \fBgateways\fR file is used by the routing daemon to identify
"passive" Internet gateways.
.sp
.LP
If any of the files \fBlocalhosts\fR, \fBlocalnetworks\fR, or
\fBlocalgateways\fR are present in the current directory, the file's contents
is prepended to the output file without interpretation.  This allows sites to
maintain local aliases and entries which are not normally present in the master
database.
.sp
.LP
\fBhtable\fR is best used in conjunction with the \fBgettable\fR(1M) program
which retrieves the DoD Internet host table from a host.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fBlocalhosts\fR\fR
.ad
.RS 17n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fBlocalnetworks\fR\fR
.ad
.RS 17n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fBlocalgateways\fR\fR
.ad
.RS 17n
.rt  

.RE

.SH SEE ALSO
.sp
.LP
\fBgettable\fR(1M), \fBgethostbyname\fR(3NSL), \fBgetnetbyname\fR(3SOCKET),
\fBattributes\fR(5) Harrenstien, Ken, Mary Stahl, and Elizabeth Feinler, \fIDoD
Internet Host Table Specification\fR, \fBRFC\fR 952, Network Information
Center, \fBSRI\fR International, Menlo Park, California, October 1985.
.SH NOTES
.sp
.LP
\fBhtable\fR does not properly calculate the \fBgateways\fR file.
