illumos/illumos-gate/usr/src/man/man1m/in.daytimed.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH in.daytimed 1M "23 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.daytimed \- UDP or TCP daytime protocol service daemon
.SH SYNOPSIS
.LP
.nf
\fBin.daytimed\fR 
.fi

.LP
.nf
FMRI \fIsvc\fR:/internet/daytime:default
.fi

.SH DESCRIPTION
.sp
.LP
FMRI stands for Fault Management Resource Identifier. It is used to identify
resources managed by the Fault Manager. See \fBfmd\fR(1M) and \fBsmf\fR(5).
.sp
.LP
The \fBin.daytimed\fR service provides the server-side of the daytime protocol.
This protocol is used for debugging and bandwidth measurement and is available
on both TCP and UDP transports, through port 13.
.sp
.LP
The \fBin.daytimed\fR service is an \fBinetd\fR(1M) \fBsmf\fR(5) delegated
service. The \fBin.daytimed\fR detects which transport is requested by
examining the socket it is passed by the \fBinetd\fR daemon.
.sp
.ne 2
.mk
.na
\fBTCP-based service\fR
.ad
.RS 21n
.rt  
Once a connection is established, the \fBin.daytimed\fR generates the current
date and time in \fBctime\fR(3C) format as 7-bit ASCII and sends it through the
connection. The server then closes the connection. Any data received from the
client side of the connection is discarded.
.RE

.sp
.ne 2
.mk
.na
\fBUDP-based service\fR
.ad
.RS 21n
.rt  
The \fBin.daytimed\fR listens for UDP datagrams. When a datagram is received,
the server generates the current date and time in \fBctime\fR(3C) format as
7-bit ASCII and inserts it in a UDP datagram sent in response to the client's
request. Any received data is ignored.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBinetd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.sp
.LP
RFC 867
