illumos/illumos-gate/usr/src/man/man1m/in.lpd.1m
'\" te
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH IN.LPD 1M "Aug 1, 2006"
.SH NAME
in.lpd \- BSD print protocol adaptor
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/print/in.lpd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBin.lpd\fR implements the network listening service for the \fBBSD\fR print
protocol specified in \fBRFC\fR 1179. The \fBBSD\fR print protocol provides a
remote interface for systems to interact with a local spooling system. The
protocol defines five standard requests from the client to the server: starting
queue processing, transferring print jobs, retrieving terse status, retrieving
verbose status, and canceling print jobs.
.sp
.LP
The \fBin.lpd\fR service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/lp
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for
initiating and restarting this service is delegated to \fBinetd\fR(1M). Use
\fBinetadm\fR(1M) to make configuration changes and to view configuration
information for this service. The service's status can be queried using the
\fBsvcs\fR(1) command.
.sp
.LP
\fBin.lpd\fR uses the \fBconfig/log_from_remote\fR property to allow or
disallow remote access. The default value of this property, \fBlocalhost\fR,
disallows remote access.
.sp
.LP
\fBinetd\fR waits for connections on \fBTCP\fR port 515. Upon receipt of a
connect request, \fBin.lpd\fR is started to service the connection. Once the
request has been filled, \fBin.lpd\fR closes the connection and exits.
.SH EXAMPLES
.LP
\fBExample 1 \fRAllowing Remote Access
.sp
.LP
The following command allows remote access to \fBin.lpd\fR.

.sp
.in +2
.nf
# \fBinetadm -m svc:/application/print/rfc1179:default bind_addr=""\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 12n
Successful completion.
.RE

.sp
.ne 2
.na
\fBnon-zero\fR
.ad
.RS 12n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/printers.conf\fR\fR
.ad
.sp .6
.RS 4n
System printer configuration database.
.RE

.sp
.ne 2
.na
\fB\fBprinters.conf.byname\fR\fR
.ad
.sp .6
.RS 4n
\fBNIS\fR version of \fB/etc/printers.conf\fR.
.RE

.sp
.ne 2
.na
\fB\fBprinters.org_dir\fR\fR
.ad
.sp .6
.RS 4n
\fBNIS+\fR version of \fB/etc/printers.conf\fR.
.RE

.sp
.ne 2
.na
\fB\fB/usr/lib/print/bsd-adaptor/bsd_*.so*\fR\fR
.ad
.sp .6
.RS 4n
Spooler translation modules.
.RE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBinetadm\fR(1M), \fBinetd\fR(1M), \fBsvcadm\fR(1M),
\fBprinters.conf\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
