illumos/illumos-gate/usr/src/man/man1m/isnsadm.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ISNSADM 1M "Sep 25, 2008"
.SH NAME
isnsadm \- administer the internet Storage Name Server (iSNS) server
.SH SYNOPSIS
.LP
.nf
\fBisnsadm\fR \fIoptions\fR
.fi

.LP
.nf
\fBisnsadm\fR \fIsubcommand\fR [\fIsubcommand_options\fR] [\fIoperand\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBisnsadm\fR command is the command-line interface to the Internet Storage
Name Service (iSNS) server. \fBisnsadm\fR comprises a set of subcommands,
described in their own section, each of which accomplishes one of the iSNS
server management functions.
.sp
.LP
For any operations that will change the iSNS configurations the
\fBsolaris.isnsmgr.write\fR authorization is required. Refer to \fBisns\fR(1M).
For read operations, the command does not require special authorizations.
.sp
.LP
\fBisnsadm\fR has a set of general options and a set of subcommand-specific
options. The first category is described under OPTIONS; the second category is
described in the context of each subcommand description.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-?\fR, \fB--help\fR\fR
.ad
.sp .6
.RS 4n
Displays context help. Stops interpretation of any subsequent arguments.
.RE

.sp
.ne 2
.na
\fB\fB-V\fR, \fB--version\fR\fR
.ad
.sp .6
.RS 4n
Displays version information.  Stops interpretation of any subsequent
arguments.
.RE

.SH OPERANDS
.sp
.LP
The following operands are used by one or more \fBisnsadm\fR subcommands.
.sp
.ne 2
.na
\fB\fIiscsi-node-name\fR\fR
.ad
.sp .6
.RS 4n
iSCSI target or iSCSI initiator symbolic name. A string with a maximum length
of 223 characters.
.RE

.sp
.ne 2
.na
\fB\fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
Discovery domain symbolic name. A string with a maximum length of 256
characters.
.RE

.sp
.ne 2
.na
\fB\fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
Discovery domain set symbolic name. A string with a maximum length of 256
characters.
.RE

.SH SUBCOMMANDS
.sp
.LP
The \fBisnsadm\fR command supports the subcommands described below.
.SS "\fBadd-dd\fR"
.sp
.LP
The \fBadd-dd\fR subcommand adds a discovery domain to a discovery domain set.
.sp
.LP
The \fBadd-dd\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm add-dd \fIoption\fR \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBadd-dd\fR has the following option:
.sp
.ne 2
.na
\fB\fB-s\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
Specifies a discovery domain set.
.RE

.SS "\fBadd-node\fR"
.sp
.LP
The \fBadd-node\fR subcommand adds a node to a specified discovery-domain.
.sp
.LP
The \fBadd-node\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm add-node \fIoption\fR \fIiscsi-node-name\fR,...\fR
.fi
.in -2
.sp

.sp
.LP
\fBadd-node\fR has the following options:
.sp
.ne 2
.na
\fB\fB-d\fR,\fB--dd\fR \fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
Specifies a discovery domain.
.RE

.SS "\fBcreate-dd\fR"
.sp
.LP
The \fBcreate-dd\fR subcommand creates a discovery domain with the name you
specify.
.sp
.LP
The \fBcreate-dd\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm create-dd \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBcreate-dd\fR has no options.
.SS "\fBcreate-dd-set\fR"
.sp
.LP
The \fBcreate-dd-set\fR subcommand creates a discovery domain set with the name
you specify.
.sp
.LP
The \fBcreate-dd-set\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm create-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBcreate-dd-set\fR has no options.
.SS "\fBdelete-dd\fR"
.sp
.LP
The \fBdelete-dd\fR subcommand deletes a discovery domain of the name you
specify.
.sp
.LP
The \fBdelete-dd\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm delete-dd \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdelete-dd\fR has no options.
.SS "\fBdelete-dd-set\fR"
.sp
.LP
The \fBdelete-dd-set\fR subcommand deletes a discovery domain set of the name
you specify.
.sp
.LP
The \fBdelete-dd-set\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm delete-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdelete-dd-set\fR has no options.
.SS "\fBdisable-dd-set\fR"
.sp
.LP
The \fBdisable-dd-set\fR subcommand disables a discovery domain set.
.sp
.LP
The \fBdisable-dd-set\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm disable-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBdisable-dd-set\fR has no options.
.SS "\fBenable-dd-set\fR"
.sp
.LP
The \fBenable-dd-set\fR subcommand enables a discovery domain set.
.sp
.LP
The \fBenable-dd-set\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm enable-dd-set \fIdiscovery-domain-set-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBenable-dd-set\fR has no options.
.SS "\fBlist-dd\fR"
.sp
.LP
The \fBlist-dd\fR subcommand displays information about discovery domains. If
no operand is specified, it lists all discovery domains that currently exist on
the iSNS server.
.sp
.LP
The \fBlist-dd\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm list-dd [\fIoption\fR] [\fIdiscovery-domain-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-dd\fR supports the following option:
.sp
.ne 2
.na
\fB\fB-v\fR, \fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
Displays the member contents of the discovery domain(s).
.RE

.SS "\fBlist-dd-set\fR"
.sp
.LP
The \fBlist-dd-set\fR subcommand lists the discovery domain sets, both enabled
and disabled, that exist on the iSNS server. Note that there is no \fBdd-set\fR
registration. If no operand is specified, it lists all of the discovery domain
sets.
.sp
.LP
The \fBlist-dd-set\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm list-dd-set [\fIoption\fR] [\fIdiscovery-domain-set-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-dd-set\fR supports the following option:
.sp
.ne 2
.na
\fB\fB-v\fR, \fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
Shows all discovery domains within the discovery domain set.
.RE

.SS "\fBlist-node\fR"
.sp
.LP
The \fBlist-node\fR subcommand displays information about nodes that are
currently registered with the iSNS server or that are not registered and belong
to non-default discovery-domain(s). For the latter case, the node has its type
field shown as \fBunknown\fR. If no operand is specified, \fBlist-node\fR lists
all nodes known by the iSNS server.
.sp
.LP
The \fBlist-node\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm list-node [\fIoptions\fR] [\fIiscsi-node-name\fR, ...]\fR
.fi
.in -2
.sp

.sp
.LP
\fBlist-node\fR supports the following options:
.sp
.ne 2
.na
\fB\fB-t\fR, \fB--target\fR\fR
.ad
.sp .6
.RS 4n
Filters the list to display only iSCSI target nodes.
.RE

.sp
.ne 2
.na
\fB\fB-i\fR, \fB--initiator\fR\fR
.ad
.sp .6
.RS 4n
Filters the list to display only iSCSI initiator nodes.
.RE

.sp
.ne 2
.na
\fB\fB-v\fR, \fB--verbose\fR\fR
.ad
.sp .6
.RS 4n
Displays details about a node. Without this option, only the name, alias, and
type information are displayed.
.RE

.SS "\fBmodify-dd\fR"
.sp
.LP
The \fBmodify-dd\fR subcommand modifies an attribute of a specified discovery
domain.
.sp
.LP
The \fBmodify-dd\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm modify-dd \fIoption\fR \fIdiscovery-domain-name\fR\fR
.fi
.in -2
.sp

.sp
.LP
\fBmodify-dd\fR has the following option:
.sp
.ne 2
.na
\fB\fB-n\fR \fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
Specifies the new name of a discovery domain to be applied to an existing
discovery-domain.
.RE

.SS "\fBmodify-dd-set\fR"
.sp
.LP
The \fBmodify-dd-set\fR subcommand modifies a discovery domain set.
.sp
.LP
The \fBmodify-dd-set\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm modify-dd-set \fIoption\fR \fIdiscovery-domain-set-name\fR\fR
.fi
.in -2
.sp

.sp
.LP
\fBmodify-dd-set\fR has the following option:
.sp
.ne 2
.na
\fB\fB-n\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
Specifies the new name of a discovery domain set to be applied to an existing
discovery-domain-set.
.RE

.SS "\fBremove-dd\fR"
.sp
.LP
The \fBremove-dd\fR subcommand removes the association with a specified
discovery domain set.
.sp
.LP
The \fBremove-dd\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm remove-dd \fIoption\fR \fIdiscovery-domain-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBremove-dd\fR has the following option:
.sp
.ne 2
.na
\fB\fB-s\fR \fIdiscovery-domain-set-name\fR\fR
.ad
.sp .6
.RS 4n
Specifies the discovery domain set from which the discovery domain will be
removed.
.RE

.SS "\fBremove-node\fR"
.sp
.LP
The \fBremove-node\fR subcommand removes a node.
.sp
.LP
The \fBremove-node\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm remove-node \fIoption\fR \fIiscsi-node-name\fR, ...\fR
.fi
.in -2
.sp

.sp
.LP
\fBremove-node\fR has the following option:
.sp
.ne 2
.na
\fB\fB-d\fR \fIdiscovery-domain-name\fR\fR
.ad
.sp .6
.RS 4n
Specifies the discovery domain from which a node will be removed.
.RE

.SS "\fBshow-config\fR"
.sp
.LP
The \fBshow-config\fR subcommand displays the iSNS server administrative
settings. Note that the setting can be modified by means of the service
management facility (see \fBsmf\fR(5)).  Refer to \fBisns\fR(1M).
.sp
.LP
The \fBshow-config\fR subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm show-config\fR
.fi
.in -2
.sp

.sp
.LP
\fBshow-config\fR has no options.
.SH EXAMPLES
.LP
\fBExample 1 \fRDisplaying Clients
.sp
.LP
The following use of the \fBlist-node\fR subcommand displays clients.

.sp
.in +2
.nf
# \fBisnsadm list-node -v\fR
iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.45173FEA.engr
        Alias: STK5320_NAS
        Type: Target
        Network Entity: SE5310
        Portal: 172.20.57.95:3260
                Portal Group: 1
        Portal: 172.20.56.95:3260
                Portal Group: 1
        DD Name: Default
iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct
        Alias:
        Type: Target
        Network Entity: SE5310
        Portal: 172.20.57.95:3260
                Portal Group: 1
        Portal: 172.20.56.95:3260
                Portal Group: 1
        DD Name: Default
iSCSI Name: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
        Alias: host-x2100
        Type: Initiator
        Network Entity: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
        Portal: 172.20.236.123:58530
                Portal Group: 1
        DD Name: Default
.fi
.in -2
.sp

.LP
\fBExample 2 \fRDisplaying a Discovery Domain
.sp
.LP
The following use of the \fBlist-dd\fR subcommand displays discovery domains.

.sp
.in +2
.nf
# \fBisnsadm list-dd -v\fR
DD name: Default
        DD set(s): Default
	iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.45173FEA.engr
	iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct
        iSCSI name: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
DD name: acct-dd
DD name: engineering-dd
.fi
.in -2
.sp

.LP
\fBExample 3 \fRAdding a Node
.sp
.LP
The following use of the \fBadd-node\fR subcommand adds a node to a discovery
domain, creating a discovery domain membership.

.sp
.in +2
.nf
# \fBisnsadm add-node -d engineering-dd \e
iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.engr\fR
.fi
.in -2
.sp

.LP
\fBExample 4 \fRRemoving a Node
.sp
.LP
The following use of the \fBremove-node\fR subcommand removes a node from a
discovery domain, thereby removing a discovery domain membership.

.sp
.in +2
.nf
# \fBisnsadm remove-node -d acct-dd \e
iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct\fR
.fi
.in -2
.sp

.LP
\fBExample 5 \fRCreating a Discovery Domain Set
.sp
.LP
The following use of the \fBcreate-dd-set\fR subcommand creates a discovery
domain set.

.sp
.in +2
.nf
# \fBisnsadm create-dd-set operation-dd-set\fR
.fi
.in -2
.sp

.LP
\fBExample 6 \fRDisplaying a Discovery Domain Set
.sp
.LP
The following use of the \fBlist-dd-set\fR subcommand displays discovery domain
sets.

.sp
.in +2
.nf
# \fBisnsadm list-dd-set -v\fR
DD Set name: Default
        State: Disabled
        DD Name: Default
DD Set name: operation-dd-set
        State: Disabled
.fi
.in -2
.sp

.LP
\fBExample 7 \fRAdding a Discovery Domain
.sp
.LP
The following use of the \fBadd-dd\fR subcommand adds a discovery domain to a
discovery domain set.

.sp
.in +2
.nf
# \fBisnsadm add-dd -s operation-dd-set engineering-dd\fR
.fi
.in -2
.sp

.LP
\fBExample 8 \fRDisplaying a Discovery Domain Set
.sp
.LP
The following use of the \fBlist-dd-set\fR displays the attributes of a
discovery domain set.

.sp
.in +2
.nf
# \fBisnsadm list-dd-set\fR
DD Set name: Default
        State: Disabled
        DD Name: Default
DD Set name: operation-dd-set
        State: Disabled
        DD Name: engineering-dd
.fi
.in -2
.sp

.LP
\fBExample 9 \fREnabling a Discovery Domain Set
.sp
.LP
The following use of the \fBenable-dd-set\fR subcommand enables a discovery
domain set.

.sp
.in +2
.nf
# \fBisnsadm enable-dd-set Default\fR
.fi
.in -2
.sp

.LP
\fBExample 10 \fRDisabling a Discovery Domain Set
.sp
.LP
The following use of the \fBdisable-dd-set\fR subcommand disables a discovery
domain set.

.sp
.in +2
.nf
# \fBisnsadm disable-dd-set Default\fR
.fi
.in -2
.sp

.LP
\fBExample 11 \fRDisplaying Administrative Settings
.sp
.LP
The following use of the \fBshow-config\fR subcommand displays current
administrative settings.

.sp
.in +2
.nf
# \fBisnsadm show-config\fR
        Data Store Location: /etc/isns/isnsdata.xml
        Entity Status Inquiry Non-Response Threshold: 3
        Management SCN Enabled: yes
        Authorized Control Node Names: -
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Volatile
.TE

.SH SEE ALSO
.sp
.LP
\fBiscsiadm\fR(1M), \fBiscsitadm\fR(1M), \fBisns\fR(1M), \fBattributes\fR(5),
\fBsmf\fR(5)
.SH NOTES
.sp
.LP
When a subcommand is invoked with multiple operands and there are failures on
one or more, but not all, operands, \fBisnsadm\fR displays a generic message
indicating partial failure, with list of failed operands. An error on a
specific operand can be found by issuing the same subcommand on the failing
operand.
