illumos/illumos-gate/usr/src/man/man1m/isns.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ISNS 1M "Nov 8, 2007"
.SH NAME
isns \- Internet Storage Name Service
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/isns\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Internet Storage Name Service (iSNS) provides consolidated discovery
services for Internet SCSI (iSCSI) and Internet Fibre Channel Protocol (iFCP)
devices in an IP network.  iSNS uses a client/server mechanism: servers store
configuration  information for clients, and provide that information upon a
client's request. IETF RFC  4171 describes the protocols between the server and
client.
.sp
.LP
This man page provides a summary of the Solaris iSNS server implementation. The
current implementation does not support iFCP devices.
.sp
.LP
Solaris iSNS server is implemented as the daemon \fBisns\fR, which binds to the
well -known port 3205 to service client requests. The daemon is started by the
service management facility (\fBsmf\fR(5)), using the fault management resource
identifier (FMRI):
.sp
.in +2
.nf
svc:/network/isns_server
.fi
.in -2
.sp

.sp
.LP
Use \fBsvcadm\fR(1M) to enable \fBisns\fR. Enabling the service means that it
starts and runs automatically whenever the operating system is booted. The
state of service can be displayed with the \fBsvcs\fR(1) command.
.sp
.LP
The service properties listed below can be managed using \fBsvccfg\fR(1M). The
default value is assigned per RFC 4171 and implementation choice.
.sp
.ne 2
.na
\fB\fBdata_store_location\fR\fR
.ad
.sp .6
.RS 4n
Configuration data store location. The default location is
\fB/etc/isns/isnsdata.xml\fR.
.RE

.sp
.ne 2
.na
\fB\fBESI_retry_threshold_count\fR\fR
.ad
.sp .6
.RS 4n
Entity Status Inquiry retry threshold counter. The default count is \fB3\fR.
.RE

.sp
.ne 2
.na
\fB\fBManagement_SCNs_Enabled\fR\fR
.ad
.sp .6
.RS 4n
Boolean that determines whether Management State Change Notification is
enabled. The default is \fByes\fR.
.RE

.sp
.ne 2
.na
\fB\fBAuthorized_Control_Nodes\fR\fR
.ad
.sp .6
.RS 4n
Control node names.
.RE

.sp
.LP
After changing a property value, you must use \fBsvcadm\fR(1M) \fBrefresh\fR to
enable \fBisns\fR to recognize the new value. If you change the
\fBdata_store_location\fR property, you must enter a \fBsvcadm restart\fR
command for the change to take effect.
.sp
.LP
RFC 4171 defines the default discovery domain, the default domain set, and the
"Default DD/DDS" setting with the intent of managing clients that have not been
assigned to any user-defined discovery domain. The server adopts the following
behaviors with respect to the default discovery domain and domain set:
.RS +4
.TP
.ie t \(bu
.el o
An unassigned client is added to the default discovery domain. A newly
registered client or a client that was removed from its last discovery domain
membership is considered to be an unassigned client.
.RE
.RS +4
.TP
.ie t \(bu
.el o
When a client gets assigned to a user-defined discovery domain, the server will
remove the client from the default discovery domain.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The default discovery domain set is allowed to be administratively activated or
deactivated in order to let the administrator control discovery among clients
in the default discovery domain.
.RE
.RS +4
.TP
.ie t \(bu
.el o
It is not allowed to administratively add a client to the default discovery
domain, nor to administratively add a user-defined discovery domain to the
default discovery domain set.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The default state of the Default discovery domain set is inactive.
.RE
.sp
.LP
The \fBisns\fR server supports certain \fBrbac\fR(5) authorizations that allow
you to administer \fBisns\fR activity. These authorizations include the
following \fBauth_attr\fR(4) privileges:
.sp
.ne 2
.na
\fB\fBsolaris.isnsmgr.write\fR\fR
.ad
.sp .6
.RS 4n
Required to create a discovery domain or domain set, to enable/disable a
discovery domain set and to change grouping of iSNS  clients in a discovery
domain or grouping of discovery domains in a discovery domain set.
.RE

.sp
.ne 2
.na
\fB\fBsolaris.smf.manage.isns\fR\fR
.ad
.sp .6
.RS 4n
Required to manage the \fBisns\fR server through  the \fBsmf\fR(5).
.RE

.sp
.ne 2
.na
\fB\fBsolaris.smf.value.isns\fR\fR
.ad
.sp .6
.RS 4n
Required to change the SMF service properties associated with \fBisns\fR.
.RE

.sp
.LP
The iSNS Server Management profile (see \fBprof_attr\fR(4)) includes all of the
preceding authorizations. See \fBrbac\fR(5) for an overview of roles and
authorizations.
.SH OPTIONS
.sp
.LP
There are no options supported by the \fBisns\fR daemon.
.SH EXAMPLES
.LP
\fBExample 1 \fRStarting an \fBisns\fR Server
.sp
.LP
The following command starts the \fBisns\fR server.

.sp
.in +2
.nf
# \fBsvcadm enable svc:/network/isns_server\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRStopping an \fBisns\fR Server
.sp
.LP
The following command stops the \fBisns\fR server.

.sp
.in +2
.nf
# \fBsvcadm disable svc:/network/isns_server\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRChanging an \fBisns\fR Property
.sp
.LP
The following sequence of commands changes the value of the
\fBESI_retry_threshold_count\fR property.

.sp
.in +2
.nf
# \fBsvccfg -s svc:/network/isns_server setprop \e
config/ESI_retry_threshold_count = 6\fR
# \fBsvcadm refresh svc:/network/isns_server\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.na
\fB\fB/usr/sbin/isns\fR\fR
.ad
.sp .6
.RS 4n
iSNS daemon binary.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Standard
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBisnsadm\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M),
\fBauth_attr\fR(4), \fBprof_attr\fR(4), \fBattributes\fR(5), \fBrbac\fR(5),
\fBsmf\fR(5)
.SH NOTES
.sp
.LP
It is strongly recommended that you restart the server (\fBsvcadm restart\fR)
after a service property is changed. This allows the server to apply a uniform
setting for existing and new clients.
.sp
.LP
A control node, as described in RFC 4171, is not required to administer the
server. Control node operations can be achieved through the \fBisnsadm\fR(1M)
command interface on the local host. For example, \fBisnsadm\fR enables you to
create a discovery domain and a discovery domain set and to add a member to it,
in order to create discovery domain and discovery domain set associations.
