illumos/illumos-gate/usr/src/man/man1m/k5srvutil.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH K5SRVUTIL 1M "Jul 25, 2015"
.SH NAME
k5srvutil \- host key table (keytab) manipulation utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/k5srvutil\fR \fIoperation\fR [\fB-ik\fR] [\fB-f\fR \fIfilename\fR]
.fi

.SH DESCRIPTION
.LP
The \fBk5srvutil\fR command allows a system manager to list or change keys
currently in his keytab or to add new keys to the keytab.
.sp
.LP
The operand \fIoperation\fR must be one of the following:
.sp
.ne 2
.na
\fB\fBlist\fR\fR
.ad
.RS 10n
Lists the keys in a keytab, showing version number and principal name.
.RE

.sp
.ne 2
.na
\fB\fBchange\fR\fR
.ad
.RS 10n
Changes all the keys in the keytab to new randomly-generated keys, updating the
keys in the Kerberos server's database to match those by using the \fBkadmin\fR
protocol. If a key's version number does not match the version number stored in
the Kerberos server's database, the operation fails. The old keys are retained
so that existing tickets continue to work. If the \fB-i\fR flag is specified,
\fBk5srvutil\fR prompts for \fByes\fR or \fBno\fR before changing each key. If
the \fB-k\fR option is used, the old and new keys are displayed.
.RE

.sp
.ne 2
.na
\fB\fBdelold\fR\fR
.ad
.RS 10n
Deletes keys that are not the most recent version from the keytab. This
operation should be used at some point after a change operation to remove old
keys. If the \fB-i\fR flag is specified, \fBk5srvutil\fR asks the user whether
the old keys associated with each principal should be removed.
.RE

.sp
.ne 2
.na
\fB\fBdelete\fR\fR
.ad
.RS 10n
Deletes particular keys in the keytab, interactively prompting for each key.
.RE

.sp
.LP
In all cases, the default keytab file is \fB/etc/krb5/krb5.keytab\fR unless
overridden by the \fB-f\fR option.
.sp
.LP
\fBk5srvutil\fR uses the \fBkadmin\fR(1M) program to edit the keytab in place.
However, old keys are retained, so they are available in case of failure.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 15n
Specify a keytab file other than the default file, \fB/etc/krb5/krb5.keytab\fR.
.RE

.sp
.ne 2
.na
\fB\fB-i\fR\fR
.ad
.RS 15n
Prompts user before changing keys when using the \fBchange\fR or \fBdelold\fR
operands.
.RE

.sp
.ne 2
.na
\fB\fB-k\fR\fR
.ad
.RS 15n
Displays old and new keys when using the \fBchange\fR operand.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.LP
\fBktutil\fR(1), \fBkadmin\fR(1M), \fBattributes\fR(5)
