illumos/illumos-gate/usr/src/man/man1m/killall.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH killall 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
killall \- kill all active processes
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/killall\fR [\fIsignal\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBkillall\fR is used by \fBshutdown\fR(1M) to kill all active processes not
directly related to the shutdown procedure.
.sp
.LP
\fBkillall\fR terminates all processes with open files so that the mounted file
systems will be unbusied and can be unmounted.
.sp
.LP
\fBkillall\fR sends \fIsignal\fR (see \fBkill\fR(1)) to the active processes.
If no \fIsignal\fR is specified, a default of \fB15\fR is used.
.sp
.LP
The \fBkillall\fR command can be run only by the super-user.
.SH SEE ALSO
.sp
.LP
\fBkill\fR(1), \fBps\fR(1), \fBfuser\fR(1M), \fBshutdown\fR(1M),
\fBsignal\fR(3C), \fBattributes\fR(5)
