illumos/illumos-gate/usr/src/man/man1m/lms.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH LMS 1M "Mar 3, 2009"
.SH NAME
lms \- allow applications to access the Intel Active Management Technology
.SH SYNOPSIS
.LP
.nf
\fBlms\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Local Manageability Service, \fBlms\fR, allows applications to access the
Intel Active Management Technology (Intel AMT) ME (Management Engine) using the
local HECI interface. LMS is dependent on the HECI driver.
.sp
.LP
To use \fBlms\fR, ensure that the Intel AMT Manageability Interface driver is
installed and connected to the ME.
.sp
.LP
\fBlms\fR is intended to be run as a daemon. Messages from the service are sent
to the \fBsyslog\fR. LMS messages are marked with a source of \fB"LMS"\fR.
.sp
.LP
For an example of how to enable the LMS service using SMF, see \fBEXAMPLES\fR.
.SH EXAMPLES
.LP
\fBExample 1 \fREnabling the LMS service using SMF
.sp
.LP
The following example enables the LMS service using SMF:

.sp
.in +2
.nf
svcadm enable network/lms
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
_
Interface Stability	Volatile
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBsmf\fR(5)
