illumos/illumos-gate/usr/src/man/man1m/lpmove.1m
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH LPMOVE 1M "Feb 25, 2017"
.SH NAME
lpmove \- move print requests
.SH SYNOPSIS
.LP
.nf
\fBlpmove\fR [\fIrequest-ID\fR] \fIdestination\fR
.fi

.LP
.nf
\fBlpmove\fR \fIsource\fR \fIdestination\fR
.fi

.SH DESCRIPTION
.LP
The \fBlpmove\fR command moves print requests queued by \fBlp\fR(1) or
\fBlpr\fR(1B) between destinations.
.sp
.LP
The first form of \fBlpmove\fR moves specific print requests (\fIrequest-ID\fR)
to a specific \fIdestination\fR.
.sp
.LP
The second form of the \fBlpmove\fR command moves all print requests from one
destination (\fIdestination1\fR) to another (\fIdestination2\fR). This form of
\fBlpmove\fR also rejects new print requests for \fIdestination1\fR.
.sp
.LP
\fBlpmove\fR moves individual requests or entire queues only within an instance
of a print service, not between a local and a remote queues or local queues on
different instances of a print service. Requests can only be moved if the print
service or protocol supports it. The LP print server and IPP print protocol
both support moving requests between queues. The BSD print protocol does not.
.sp
.LP
When moving requests, \fBlpmove\fR does not check the acceptance status of the
destination to which the print requests are being moved (see \fBaccept\fR(1M)).
\fBlpmove\fR does not move requests that have options (for example, content
type or requiring a special form) that cannot be handled by the new
destination.
.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.na
\fB\fIrequest-ID\fR\fR
.ad
.RS 15n
The specific print request to be moved. Specify \fIrequest-ID\fR as the
identifier associated with a print request as reported by \fBlpstat\fR. See
\fBlpstat\fR(1).
.RE

.sp
.ne 2
.na
\fB\fIdestination\fR\fR
.ad
.RS 15n
The name of the printer or class of printers (see \fBlpadmin\fR(1M)) to which
\fBlpmove\fR moves a \fIspecified\fR print request. Specify \fIdestination\fR
using atomic, URI-style (\fIscheme\fR://\fIendpoint\fR), POSIX-style
(\fIserver\fR\fB:\fR\fIdestination\fR) syntax.
.RE

.sp
.ne 2
.na
\fB\fIsource\fR\fR
.ad
.RS 15n
The name of the destination from which \fBlpmove\fR moves \fIall\fR print
requests. Specify \fIdestination\fR using atomic, URI-style
(\fIscheme\fR\fB://\fR\fIendpoint\fR), POSIX-style
(\fIserver\fR\fB:\fR\fIdestination\fR) syntax.
.RE

.sp
.LP
See \fBprinters.conf\fR(4) for information regarding the naming conventions for
atomic names and \fBstandards\fR(5) for information regarding POSIX.
.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 12n
Successful completion.
.RE

.sp
.ne 2
.na
\fBnon-zero\fR
.ad
.RS 12n
An error occurred.
.RE

.SH FILES
.ne 2
.na
\fB\fB/etc/printers.conf\fR\fR
.ad
.RS 24n
System printer configuration database
.RE

.sp
.ne 2
.na
\fB\fB$HOME/.printers\fR\fR
.ad
.RS 24n
User-configurable printer database
.RE

.sp
.ne 2
.na
\fB\fBou=printers\fR\fR
.ad
.RS 24n
LDAP version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.na
\fB\fBprinters.conf.byname\fR\fR
.ad
.RS 24n
\fBNIS\fR version of \fB/etc/printers.conf\fR
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Obsolete
.TE

.SH SEE ALSO
.LP
\fBlp\fR(1), \fBlpr\fR(1B), \fBlpstat\fR(1), \fBaccept\fR(1M),
\fBlpadmin\fR(1M), \fBlpsched\fR(1M), \fBprinters.conf\fR(4),
\fBattributes\fR(5), \fBstandards\fR(5)
.sp
.LP
\fISystem Administration Guide: Solaris Printing\fR
.SH NOTES
.LP
When IPP is in use, the user is prompted for a passphrase if the remote print
service is configured to require authentication.
