illumos/illumos-gate/usr/src/man/man1m/lpusers.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH LPUSERS 1M "Aug 19, 1996"
.SH NAME
lpusers \- set printing queue priorities
.SH SYNOPSIS
.LP
.nf
\fBlpusers\fR \fB-d\fR \fIpriority-level\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-q\fR \fIpriority-level\fR \fB-u\fR \fIlogin-ID-list\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-u\fR \fIlogin-ID-list\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-q\fR \fIpriority-level\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-l\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBlpusers\fR command  sets limits to the queue priority level that can be
assigned to  jobs submitted by users of the LP print service.
.sp
.LP
The first form of the command (with \fB-d\fR) sets the system-wide priority
default to \fIpriority-level\fR, where \fIpriority-level\fR is a value of 0 to
39, with 0 being the highest priority. If a user does not specify a priority
level with a print request (see \fBlp\fR(1)), the default priority level is
used. Initially, the default priority level is 20.
.sp
.LP
The second form of the command (with \fB-q\fR and \fB-u\fR) sets the default
highest \fIpriority-level\fR (\|0-39\|) that the users in \fIlogin-ID-list\fR
can request when submitting a print request. The \fIlogin-ID-list\fR argument
may include  any or all of the following constructs:
.sp
.ne 2
.na
\fB\fIlogin-ID\fR\fR
.ad
.RS 24n
A user on any system
.RE

.sp
.ne 2
.na
\fB\fIsystem_name\fR\fB!\fR\fIlogin-ID\fR\fR
.ad
.RS 24n
A user on the system \fIsystem_name\fR
.RE

.sp
.ne 2
.na
\fB\fIsystem_name\fR\fB!all\fR\fR
.ad
.RS 24n
All users on system \fIsystem_name\fR
.RE

.sp
.ne 2
.na
\fB\fBall!\fR\fIlogin-ID\fR\fR
.ad
.RS 24n
A user on all systems
.RE

.sp
.ne 2
.na
\fB\fBall\fR\fR
.ad
.RS 24n
All users on all systems
.RE

.sp
.LP
Users that have been given a limit cannot submit a print request with a higher
priority level than the one assigned, nor can they change a request that has
already been submitted to have a higher priority. Any print requests submitted
with priority levels higher than allowed will be given the highest priority
allowed.
.sp
.LP
The third form of the command (with \fB-u\fR)  removes any explicit priority
level for the specified users.
.sp
.LP
The fourth form of the command (with \fB-q\fR) sets the default highest
priority level for all users not explicitly covered by the use of the second
form of this command.
.sp
.LP
The last form of the command (with \fB-l\fR)  lists the default priority level
and the priority limits assigned to users.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-d\fR\fI priority-level\fR\fR
.ad
.sp .6
.RS 4n
Set the system-wide priority default to \fIpriority-level\fR.
.RE

.sp
.ne 2
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
List the default priority level and the priority limits assigned to users.
.RE

.sp
.ne 2
.na
\fB\fB-q\fR\fI priority-level\fR\fR
.ad
.sp .6
.RS 4n
Set the default highest priority level for all users not explicitly covered.
.RE

.sp
.ne 2
.na
\fB\fB-q\fR\fI priority-level\fR \fB-u\fR\fI login-ID-list\fR\fR
.ad
.sp .6
.RS 4n
Set the default highest \fIpriority-level\fR that the users in
\fIlogin-ID-list\fR can request when submitting a print request.
.RE

.sp
.ne 2
.na
\fB\fB-u\fR\fI login-ID-list\fR\fR
.ad
.sp .6
.RS 4n
Remove any explicit priority level for the specified users.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 12n
Successful completion.
.RE

.sp
.ne 2
.na
\fBnon-zero\fR
.ad
.RS 12n
An error occurred.
.RE

.SH SEE ALSO
.sp
.LP
\fBlp\fR(1), \fBattributes\fR(5)
