illumos/illumos-gate/usr/src/man/man1m/mdnsd.1m
.\" -*- tab-width: 4 -*-
.\" 
.\" Copyright (c) 2003-2004 Apple Computer, Inc. All Rights Reserved.
.\" 
.\" Licensed under the Apache License, Version 2.0 (the "License");
.\" you may not use this file except in compliance with the License.
.\" You may obtain a copy of the License at
.\" 
.\"     http://www.apache.org/licenses/LICENSE-2.0
.\" 
.\" Unless required by applicable law or agreed to in writing, software
.\" distributed under the License is distributed on an "AS IS" BASIS,
.\" WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
.\" See the License for the specific language governing permissions and
.\" limitations under the License.
.\"
.\" Copyright 2016 Toomas Soome <tsoome@me.com>
.\"
.Dd Jan 28, 2016        \" Date
.Dt MDNSD 1M            \" Document Title
.Os illumos             \" Operating System
.\"
.Sh NAME
.Nm mdnsd
.Nd Multicast and Unicast DNS daemon    \" Name Description for whatis database
.\" 
.Sh SYNOPSIS
.Nm
.\"
.Sh DESCRIPTION
.Nm
(also known as
.Nm mDNSResponder
on some systems)
is a daemon invoked at boot time to implement Multicast DNS and DNS Service Discovery.
.Pp
.Nm
listens on UDP port 5353 for Multicast DNS Query packets.
When it receives a query for which it knows an answer,
.Nm
issues the appropriate Multicast DNS Reply packet.
.Pp
.Nm
also performs Unicast and Multicast DNS Queries on behalf of client processes, and
maintains a cache of the replies.
.Pp
.Nm
has no user-specifiable command-line argument, and users should not run
.Nm
manually.
.Sh LOGGING
There are several methods with which to examine
.Nm Ns 's internal state for debugging and diagnostic purposes. The syslog(3C)
logging levels map as follows:
.Pp
.Dl Error - Error messages
.Dl Warning - Client-initiated operations
.Dl Notice - Sleep proxy operations
.Dl Info - Informational messages
.Pp
By default, only log level Error is logged.
.Pp
A SIGUSR1 signal toggles additional logging, with Warning and Notice
enabled by default:
.Pp
.Dl % sudo pkill -USR1 mdnsd
.Pp
A SIGUSR2 signal toggles packet logging:
.Pp
.Dl % sudo pkill -USR2 mdnsd
.Pp
A SIGINFO signal will dump a snapshot summary of the internal state:
.Pp
.Dl % sudo pkill -INFO mdnsd
.Sh FILES
.Pa /usr/lib/inet/mdnsd \" Pathname
.\"
.Sh INFO
For information on Multicast DNS, see
.Pa http://www.multicastdns.org/
.Pp
For information on DNS Service Discovery, see
.Pa http://www.dns-sd.org/
.Pp
For information on how to use the Multicast DNS and the
DNS Service Discovery APIs on Mac OS X and other platforms, see
.Pa http://developer.apple.com/bonjour/
.Pp
For the source code to
.Nm , see
.Pa http://developer.apple.com/darwin/projects/bonjour/
.\"
.Sh INTERFACE STABILITY
.Sy Volatile .
.Sh SEE ALSO
.Xr dns-sd 1M
.\"
.Sh NOTES
The
.Nm
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.Dl svc:/network/dns/multicast:default
.sp
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(1M). The service's
status can be queried using the \fBsvcs\fR(1) command.
