illumos/illumos-gate/usr/src/man/man1m/metaroot.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH METAROOT 1M "Mar 26, 2006"
.SH NAME
metaroot \- setup system files for root (/) metadevice
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metaroot\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaroot\fR [\fB-n\fR] [\fB-k\fR \fIsystem-name\fR] [\fB-v\fR \fIvfstab-name\fR]
     [\fB-c\fR \fImddb.cf-name\fR] [\fB-m\fR \fImd.conf-name\fR] [\fB-R\fR \fIroot-path\fR] \fIdevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmetaroot\fR command edits the \fB/etc/vfstab\fR and \fB/etc/system\fR
files so that the system may be booted with the root file system (\fB/\fR) on
an appropriate metadevice. The only metadevices that support the root file
system are a stripe with only a single slice or a mirror on a single-slice
stripe.
.sp
.LP
If necessary, the \fBmetaroot\fR command can reset a system that has been
configured to boot the root file system (\fB/\fR) on a metadevice so that it
uses a physical slice.
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the following options except \fB-h\fR.
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-c\fR \fImddb.cf-name\fR\fR
.ad
.RS 19n
Use \fImddb.cf-name\fR instead of the default \fB/etc/lvm/mddb.cf\fR file as a
source of metadevice database locations.
.RE

.sp
.ne 2
.na
\fB\fB-h\fR\fR
.ad
.RS 19n
Display a usage message.
.RE

.sp
.ne 2
.na
\fB\fB-k\fR \fIsystem-name\fR\fR
.ad
.RS 19n
Edit a user-supplied \fIsystem-name\fR instead of the default \fB/etc/system\fR
system configuration information file.
.RE

.sp
.ne 2
.na
\fB\fB-m\fR \fImd.conf-name\fR\fR
.ad
.RS 19n
Edit the configuration file specified by \fImd.conf-name\fR rather than the
default, \fB/kernel/drv/md.conf\fR.
.RE

.sp
.ne 2
.na
\fB\fB-n\fR\fR
.ad
.RS 19n
Print what would be done without actually doing it.
.RE

.sp
.ne 2
.na
\fB\fB-R\fR \fIroot-path\fR\fR
.ad
.RS 19n
When metaroot modifies system files, it accesses them in their relative
location under \fIroot-path\fR.
.sp
The \fB-R\fR option cannot be used in combination with the \fB-c\fR,
\fB-k\fR,\fB-m\fR, or \fB-v\fR options.
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with the
\fB-R\fR option. Doing so might damage the global zone's file system, might
compromise the security of the global zone, and might damage the non-global
zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.na
\fB\fB-v\fR \fIvfstab-name\fR\fR
.ad
.RS 19n
Edit \fIvfstab-name\fR instead of the default \fB/etc/vfstab\fR table of file
system defaults.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.na
\fB\fIdevice\fR\fR
.ad
.RS 10n
Specifies either the metadevice or the conventional disk device (slice) used
for the root file system (\fB/\fR).
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSpecifying Root File System on Metadevice
.sp
.LP
The following command edits \fB/etc/system\fR and \fB/etc/vfstab\fR to specify
that the root file system is now on metadevice \fBd0\fR.

.sp
.in +2
.nf
# metaroot d0
.fi
.in -2
.sp

.sp
.LP
The following example shows the same command using a desriptive name for the
metadevice.

.sp
.in +2
.nf
# metaroot newrootfilesystem
.fi
.in -2
.sp

.LP
\fBExample 2 \fRSpecifying Root File System on SCSI Disk
.sp
.LP
The following command edits \fB/etc/system\fR and \fB/etc/vfstab\fR to specify
that the root file system is now on the SCSI disk device
\fB/dev/dsk/c0t3d0s0\fR.

.sp
.in +2
.nf
# metaroot /dev/dsk/c0t3d0s0
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/system\fR\fR
.ad
.RS 23n
System configuration information file. See \fBsystem\fR(4).
.RE

.sp
.ne 2
.na
\fB\fB/etc/vfstab\fR\fR
.ad
.RS 23n
File system defaults.
.RE

.sp
.ne 2
.na
\fB\fB/etc/lvm/mddb.cf\fR\fR
.ad
.RS 23n
Metadevice state database locations.
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/md.conf\fR\fR
.ad
.RS 23n
Configuration file for the metadevice driver, \fBmd\fR.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 6n
Successful completion.
.RE

.sp
.ne 2
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Stable
.TE

.SH SEE ALSO
.sp
.LP
\fBmdmonitord\fR(1M), \fBmetaclear\fR(1M), \fBmetadb\fR(1M),
\fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M),
\fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M),
\fBmetarecover\fR(1M), \fBmetarename\fR(1M), \fBmetareplace\fR(1M),
\fBmetaset\fR(1M), \fBmetassist\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M),
\fBmetattach\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4),
\fBmd.tab\fR(4), \fBattributes\fR(5), \fBmd\fR(7D)
.sp
.LP
\fI\fR
