illumos/illumos-gate/usr/src/man/man1m/ncaconfd.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc.
.\" All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ncaconfd 1M "12 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
ncaconfd \- Solaris Network Cache and Accelerator (NCA) configuration daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/ncaconfd\fR [\fB-al\fR ] \fIinterface1 \fR [\fIinterface2 ...\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Use the \fBncaconfd\fR utility to set up NCA on a system. At boot time, the
\fBncakmod\fR initialization script reads in \fBnca.if\fR(4) to determine on
which interface(s) NCA should run. \fBncaconfd\fR then sets up the interface.
.sp
.LP
\fBncaconfd\fR also operates as a daemon if the \fBnca_active\fR key is set to
enabled in \fBncakmod.conf\fR(4) file. In this case, \fBncaconfd\fR will
continue as a daemon after all the NCA interfaces have been set up, listening
for routing changes. The changes are then passed to NCA to control which
interface NCA should use to make active outgoing TCP connnections.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
Enable active connections.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
Enable logging.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nca/ncakmod.conf\fR\fR
.ad
.RS 25n
.rt  
 
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBnca\fR(1), \fBncakmod\fR(1), \fBnca.if\fR(4), \fBncakmod.conf\fR(4),
\fBattributes\fR(5)
