illumos/illumos-gate/usr/src/man/man1m/netstrategy.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NETSTRATEGY 1M "May 5, 2007"
.SH NAME
netstrategy \- return network configuration information
.SH SYNOPSIS
.LP
.nf
\fB/sbin/netstrategy\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnetstrategy\fR command determines the network configuration strategy in
use on a system and returns information in a form that is easily consumable by
a script. The command returns three tokens:
.sp
.in +2
.nf
\fI<root filesystem type>\fR \fI<primary interface>\fR \fI<network config strategy>\fR
.fi
.in -2
.sp

.sp
.LP
These tokens are described as follows:
.sp
.ne 2
.na
\fB\fI<root filesystem type>\fR\fR
.ad
.sp .6
.RS 4n
Type of filesystem that contains the bootable kernel, as would be specified in
the \fIfstype\fR column of the \fBmnttab\fR(4).
.RE

.sp
.ne 2
.na
\fB\fI<primary interface>\fR\fR
.ad
.sp .6
.RS 4n
Name of the primary network interface.  For a diskless machine, this is the
interface used to load the kernel.
.RE

.sp
.ne 2
.na
\fB\fI<network config strategy>\fR\fR
.ad
.sp .6
.RS 4n
The means by which a system obtains its IP address for booting. This can be one
of \fBrarp\fR, \fBdhcp\fR, or \fBnone\fR.
.RE

.sp
.LP
The \fBnetstrategy\fR command is not intended for use on a command line.
.SH OPTIONS
.sp
.LP
The \fBnetstrategy\fR command has no options.
.SH EXIT STATUS
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 7n
Success.
.RE

.sp
.ne 2
.na
\fB\fB!=0\fR\fR
.ad
.RS 7n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
\fBifconfig\fR(1M), \fBmnttab\fR(4), \fBattributes\fR(5)
