illumos/illumos-gate/usr/src/man/man1m/newaliases.1m
'\" te
.\"  Copyright (c) 2001 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH newaliases 1M "14 Sep 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
newaliases \- rebuild the data base for the mail aliases file
.SH SYNOPSIS
.LP
.nf
\fBnewaliases\fR 
.fi

.SH DESCRIPTION
.sp
.LP
\fBnewaliases\fR rebuilds the random access data base for the mail aliases file
\fB/etc/mail/aliases\fR.
.sp
.LP
\fBnewaliases\fR accepts all the flags that \fBsendmail\fR(1M) accepts.
However, most of these flags have no effect, except for the \fB-C\fR option and
three of the \fBProcessing\fR \fBOptions\fR that can be set from a
configuration file with the \fB-o\fR option:
.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fI /path/to/alt/config/file\fR\fR
.ad
.sp .6
.RS 4n
Use alternate configuration file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-oA\fR\fIfile\fR\fR
.ad
.sp .6
.RS 4n
Specify possible alias files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-oL\fR\fIn\fR\fR
.ad
.sp .6
.RS 4n
Set the default log level to \fIn\fR. Defaults to \fB9\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-on\fR\fR
.ad
.sp .6
.RS 4n
Validate the \fBRHS\fR of aliases when rebuilding the \fBaliases\fR(4)
database.
.RE

.sp
.LP
\fBnewaliases\fR runs in verbose mode (\fB-v\fR option) automatically.
.SH EXAMPLES
.LP
\fBExample 1 \fRRunning the \fBnewaliases\fR Command
.sp
.LP
The following command runs \fBnewaliases\fR on an alias file different from the
\fB/etc/mail/aliases\fR default in \fBsendmail\fR(1M):

.sp
.in +2
.nf
 example% \fBnewaliases \fR\fB-oA\fR\fB\fI/path/to/alternate/alias/file\fR\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
\fBnewaliases\fR returns an exit status describing what it did. The codes are
defined in \fB/usr/include/sysexits.h\fR.
.sp
.ne 2
.mk
.na
\fB\fBEX_OK\fR\fR
.ad
.RS 18n
.rt  
Successful completion on all addresses.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEX_NOUSER\fR\fR
.ad
.RS 18n
.rt  
User name not recognized.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEX_UNAVAILABLE\fR\fR
.ad
.RS 18n
.rt  
Catchall. Necessary resources were not available.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEX_SYNTAX\fR\fR
.ad
.RS 18n
.rt  
Syntax error in address.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEX_SOFTWARE\fR\fR
.ad
.RS 18n
.rt  
Internal software error, including bad arguments.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEX_OSERR\fR\fR
.ad
.RS 18n
.rt  
Temporary operating system error, such as "cannot fork".
.RE

.sp
.ne 2
.mk
.na
\fB\fBEX_NOHOST\fR\fR
.ad
.RS 18n
.rt  
Host name not recognized.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEX_TEMPFAIL\fR\fR
.ad
.RS 18n
.rt  
Message could not be sent immediately, but was queued.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/aliases\fR\fR
.ad
.RS 25n
.rt  
Symbolic link to \fB/etc/mail/aliases\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/aliases.pag\fR\fR
.ad
.RS 25n
.rt  
 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/aliases.dir\fR\fR
.ad
.RS 25n
.rt  
\fBndbm\fR files maintained by \fBnewaliases\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/aliases.db\fR\fR
.ad
.RS 25n
.rt  
Berkeley DataBase file maintained by newaliases
.RE

.SH SEE ALSO
.sp
.LP
\fBsendmail\fR(1M), \fBaliases\fR(4), \fBattributes\fR(5)
