illumos/illumos-gate/usr/src/man/man1m/rpcinfo.1m
'\" te
.\" Copyright 2015 Nexenta Systems, Inc.  All rights reserved.
.\" Copyright (c) 2001 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH RPCINFO 1M "Feb 20, 2015"
.SH NAME
rpcinfo \- report RPC information
.SH SYNOPSIS
.LP
.nf
\fBrpcinfo\fR [\fB-T\fR \fItransport\fR] [\fB-m\fR | \fB-s\fR] [\fIhost\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-p\fR [\fIhost\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-T\fR \fItransport\fR \fIhost\fR \fIprognum\fR [\fIversnum\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-l\fR [\fB-T\fR \fItransport\fR] \fIhost\fR \fIprognum\fR \fIversnum\fR
.fi

.LP
.nf
\fBrpcinfo\fR [\fB-n\fR \fIportnum\fR] \fB-u\fR \fIhost\fR \fIprognum\fR [\fIversnum\fR]
.fi

.LP
.nf
\fBrpcinfo\fR [\fB-n\fR \fIportnum\fR] \fB-t\fR \fIhost\fR \fIprognum\fR [\fIversnum\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-a\fR \fIserv_address\fR \fB-T\fR \fItransport\fR \fIprognum\fR [\fIversnum\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-b\fR [\fB-T\fR \fItransport\fR] \fIprognum\fR \fIversnum\fR
.fi

.LP
.nf
\fBrpcinfo\fR \fB-d\fR [\fB-T\fR \fItransport\fR] \fIprognum\fR \fIversnum\fR
.fi

.SH DESCRIPTION
.LP
\fBrpcinfo\fR makes an \fBRPC\fR call to an \fBRPC\fR server and reports what
it finds.
.sp
.LP
In the first synopsis, \fBrpcinfo\fR lists all the registered \fBRPC\fR
services with \fBrpcbind\fR on \fIhost\fR. If \fIhost\fR is not specified, the
local host is the default. If \fB-s\fR is used, the information is displayed in
a concise format.
.sp
.LP
In the second synopsis, \fBrpcinfo\fR lists all the \fBRPC\fR services
registered with \fBrpcbind\fR, version 2. Note that the format of the
information is different in the first and the second synopsis. This is because
the second synopsis is an older protocol used to collect the information
displayed (version 2 of the \fBrpcbind\fR protocol).
.sp
.LP
The third synopsis makes an \fBRPC\fR call to procedure 0 of \fIprognum\fR and
\fIversnum\fR on the specified \fIhost\fR and reports whether a response was
received. \fItransport\fR is the transport which has to be used for contacting
the given service. The remote address of the service is obtained by making a
call to the remote \fBrpcbind\fR.
.sp
.LP
The \fIprognum\fR argument is a number that represents an \fBRPC\fR program
number (see \fBrpc\fR(4)).
.sp
.LP
If a \fIversnum\fR is specified, \fBrpcinfo\fR attempts to call that version of
the specified \fIprognum\fR. Otherwise, \fBrpcinfo\fR attempts to find all the
registered version numbers for the specified \fIprognum\fR by calling version
0, which is presumed not to exist; if it does exist, \fBrpcinfo\fR attempts to
obtain this information by calling an extremely high version number instead,
and attempts to call each registered version. Note that the version number is
required for \fB-b\fR and \fB-d\fR options.
.sp
.LP
The \fBEXAMPLES\fR section describe other ways of using \fBrpcinfo\fR.
.SH OPTIONS
.ne 2
.na
\fB\fB-T\fR\fI transport\fR\fR
.ad
.RS 19n
Specify the transport on which the service is required. If this option is not
specified, \fBrpcinfo\fR uses the transport specified in the \fBNETPATH\fR
environment variable, or if that is unset or \fINULL,\fR the transport in the
\fBnetconfig\fR(4) database is used. This is a generic option, and can be used
in conjunction with other options as shown in the \fBSYNOPSIS\fR.
.RE

.sp
.ne 2
.na
\fB\fB-a\fR \fIserv_address\fR\fR
.ad
.RS 19n
Use \fIserv_address\fR as the (universal) address for the service on
\fItransport\fR to \fBping\fR procedure 0 of the specified \fIprognum\fR and
report whether a response was received. The \fB-T\fR option is required with
the \fB-a\fR option. If \fIversnum\fR is not specified, \fBrpcinfo\fR tries to
ping all available version numbers for that program number. This option avoids
calls to remote \fBrpcbind\fR to find the address of the service. The
\fIserv_address\fR is specified in universal address format of the given
transport.
.RE

.sp
.ne 2
.na
\fB\fB-b\fR\fR
.ad
.RS 19n
Make an \fBRPC\fR broadcast to procedure 0 of the specified \fIprognum\fR and
\fIversnum\fR and report all hosts that respond. If \fItransport\fR is
specified, it broadcasts its request only on the specified transport. If
broadcasting is not supported by any transport, an error message is printed.
Use of broadcasting should be limited because of the potential for adverse
effect on other systems.
.RE

.sp
.ne 2
.na
\fB\fB-d\fR\fR
.ad
.RS 19n
Delete registration for the \fBRPC\fR service of the specified \fIprognum\fR
and \fIversnum\fR. If \fItransport\fR is specified, unregister the service on
only that transport, otherwise unregister the service on all the transports on
which it was registered. Only the owner of a service can delete a registration,
except the superuser, who can delete any service.
.RE

.sp
.ne 2
.na
\fB\fB-l\fR\fR
.ad
.RS 19n
Display a list of entries with a given \fIprognum\fR and \fIversnum\fR on the
specified \fIhost\fR. Entries are returned for all transports in the same
protocol family as that used to contact the remote \fBrpcbind\fR.
.RE

.sp
.ne 2
.na
\fB\fB-m\fR\fR
.ad
.RS 19n
Display a table of statistics of \fBrpcbind\fR operations on the given
\fIhost\fR. The table shows statistics for each version of \fBrpcbind\fR
(versions 2, 3 and 4), giving the number of times each procedure was requested
and successfully serviced, the number and type of remote call requests that
were made, and information about \fBRPC\fR address lookups that were handled.
This is useful for monitoring \fBRPC\fR activities on \fIhost\fR.
.RE

.sp
.ne 2
.na
\fB\fB-n\fR\fI portnum\fR\fR
.ad
.RS 19n
Use \fIportnum\fR as the port number for the \fB-t\fR and \fB-u\fR options
instead of the port number given by \fBrpcbind\fR. Use of this option avoids a
call to the remote \fBrpcbind\fR to find out the address of the service. This
option is made obsolete by the \fB-a\fR option.
.RE

.sp
.ne 2
.na
\fB\fB-p\fR\fR
.ad
.RS 19n
Probe \fBrpcbind\fR on \fIhost\fR using version 2 of the \fBrpcbind\fR
protocol, and display a list of all registered \fBRPC\fR programs. If
\fIhost\fR is not specified, it defaults to the local host. This option is not
useful for IPv6; use \fB-s\fR (see below) instead. Note that version 2 of the
\fBrpcbind\fR protocol was previously known as the portmapper protocol.
.RE

.sp
.ne 2
.na
\fB\fB-s\fR\fR
.ad
.RS 19n
Display a concise list of all registered \fBRPC\fR programs on \fIhost\fR. If
\fIhost\fR is not specified, it defaults to the local host.
.RE

.sp
.ne 2
.na
\fB\fB-t\fR\fR
.ad
.RS 19n
Make an \fBRPC\fR call to procedure 0 of \fIprognum\fR on the specified
\fIhost\fR using \fBTCP,\fR and report whether a response was received. This
option is made obsolete by the \fB-T\fR option as shown in the third synopsis.
.RE

.sp
.ne 2
.na
\fB\fB-u\fR\fR
.ad
.RS 19n
Make an \fBRPC\fR call to procedure 0 of \fIprognum\fR on the specified
\fIhost\fR using \fBUDP,\fR and report whether a response was received. This
option is made obsolete by the \fB-T\fR option as shown in the third synopsis.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fR\fBRPC\fR services.
.sp
.LP
To show all of the \fBRPC\fR services registered on the local machine use:

.sp
.in +2
.nf
\fBexample%\fR \fBrpcinfo\fR
.fi
.in -2
.sp

.sp
.LP
To show all of the \fBRPC\fR services registered with \fBrpcbind\fR on the
machine named \fBklaxon\fR use:

.sp
.in +2
.nf
\fBexample%\fR \fBrpcinfo\fR \fBklaxon\fR
.fi
.in -2
.sp

.sp
.LP
The information displayed by the above commands can be quite lengthy. Use the
\fB-s\fR option to display a more concise list:

.sp
.in +2
.nf
\fBexample%\fR \fBrpcinfo\fR \fB-s\fR \fBklaxon\fR
.fi
.in -2
.sp

.sp

.sp
.TS
l l l l l
l l l l l .
\fBprogram\fR	\fBversion(s)\fR	\fBnetid(s)\fR	\fBservice\fR	\fBowner\fR
\fB100000\fR	\fB2,3,4\fR	\fBtcp,udp,ticlts,ticots,ticotsord\fR	\fBrpcbind\fR	\fBsuperuser\fR
\fB100008\fR	\fB1\fR	\fBticotsord,ticots,ticlts,udp,tcp\fR	\fBwalld\fR	\fBsuperuser\fR
\fB100002\fR	\fB2,1\fR	\fBticotsord,ticots,ticlts,udp,tcp\fR	\fBrusersd\fR	\fBsuperuser\fR
\fB100001\fR	\fB2,3,4\fR	\fBticotsord,ticots,tcp,ticlts,udp\fR	\fBrstatd\fR	\fBsuperuser\fR
\fB100012\fR	\fB1\fR	\fBticotsord,ticots,ticlts,udp,tcp\fR	\fBsprayd\fR	\fBsuperuser\fR
\fB100007\fR	\fB3\fR	\fBticotsord,ticots,ticlts,udp,tcp\fR	\fBypbind\fR	\fBsuperuser\fR
\fB100029\fR	\fB1\fR	\fBticotsord,ticots,ticlts\fR	\fBkeyserv\fR	\fBsuperuser\fR
\fB100078\fR	\fB4\fR	\fBticotsord,ticots,ticlts\fR	\fB-\fR	\fBsuperuser\fR
\fB100024\fR	\fB1\fR	\fBticotsord,ticots,ticlts,udp,tcp\fR	\fBstatus\fR	\fBsuperuser\fR
\fB100021\fR	\fB2,1\fR	\fBticotsord,ticots,ticlts,udp,tcp\fR	\fBnlockmgr\fR	\fBsuperuser\fR
\fB100020\fR	\fB1\fR	\fBticotsord,ticots,ticlts,udp,tcp\fR	\fBllockmgr\fR	\fBsuperuser\fR
.TE

.sp
.LP
To show whether the \fBRPC\fR service with program number \fIprognum\fR and
version \fIversnum\fR is registered on the machine named \fBklaxon\fR for the
transport \fBTCP\fR use:

.sp
.in +2
.nf
\fBexample% rpcinfo \fR\fB-T\fR\fB tcp klaxon \fR\fIprognum versnum\fR
.fi
.in -2
.sp

.sp
.LP
To show all \fBRPC\fR services registered with version 2 of the \fBrpcbind\fR
protocol on the local machine use:

.sp
.in +2
.nf
\fBexample%\fR \fBrpcinfo\fR \fB-p\fR
.fi
.in -2
.sp

.sp
.LP
To delete the registration for version 1 of the \fBwalld\fR (program number
\fB100008\fR) service for all transports use:

.sp
.in +2
.nf
\fBexample# rpcinfo \fR\fB-d\fR\fB 100008 1\fR
.fi
.in -2
.sp

.sp
.LP
or

.sp
.in +2
.nf
\fBexample# rpcinfo \fR\fB-d\fR\fB walld 1\fR
.fi
.in -2
.sp

.SH SEE ALSO
.LP
\fBrpcbind\fR(1M), \fBrpc\fR(3NSL), \fBnetconfig\fR(4), \fBrpc\fR(4),
\fBattributes\fR(5)
