illumos/illumos-gate/usr/src/man/man1m/setuname.1m
'\" te
.\"  Copyright 1989 AT&T Copyright (c) 1998 Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH setuname 1M "9 Jul 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
setuname \- change machine information
.SH SYNOPSIS
.LP
.nf
\fBsetuname\fR [\fB-t\fR] [\fB-n\fR \fInode\fR] [\fB-s\fR \fIname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsetuname\fR utility changes the parameter value for the system name and
node name. Each parameter can be changed using \fBsetuname\fR and the
appropriate option.
.sp
.LP
Either or both the \fB-s\fR and \fB-n\fR options must be given when invoking
\fBsetuname\fR.
.sp
.LP
The system architecture may place requirements on the size of the system and
network node name. The command will issue a fatal warning message and an error
message if the name entered is incompatible with the system requirements.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fI node\fR\fR
.ad
.RS 11n
.rt  
Changes the node name. \fInode\fR specifies the new network node name and can
consist of alphanumeric characters and the special characters dash, underbar,
and dollar sign.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fI name\fR\fR
.ad
.RS 11n
.rt  
Changes the system name. \fIname\fR specifies new system name and can consist
of alphanumeric characters and the special characters dash, underbar, and
dollar sign.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR\fR
.ad
.RS 11n
.rt  
Temporary change. No attempt will be made to create a permanent change.
.RE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
.SH NOTES
.sp
.LP
\fBsetuname\fR attempts to change the parameter values in two places: the
running kernel and, as necessary per implementation, to cross system reboots. A
temporary change changes only the running kernel.
