illumos/illumos-gate/usr/src/man/man1m/smbd.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SMBD 1M "Feb 5, 2008"
.SH NAME
smbd \- CIFS server daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/smbsrv/smbd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsmbd\fR daemon handles \fBCIFS\fR/\fBSMB\fR requests from \fBCIFS\fR
clients, such as Windows clients. Only processes with \fB{PRIV_SYS_SMB}\fR and
sufficient privileges to write the \fB/var/run\fR directory can run this
daemon.
.sp
.LP
The \fBsmbd\fR daemon is automatically invoked by using the \fBsharemgr\fR
command over all available transports. By default, \fBsmbd\fR starts over the
NetBIOS-Over-TCP (\fBNBT\fR) and \fBTCP\fR transports.
.sp
.LP
When \fBsmbd\fR is started over \fBNBT\fR, the following services are started:
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS name service is started on \fBUDP\fR port 137.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS datagram service is started on \fBUDP\fR port 138.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS session service is started on \fBTCP\fR port 139.
.RE
.sp
.LP
When the \fBsmbd\fR daemon is started over TCP, the CIFS service is started on
TCP port 445.
.sp
.LP
Only one instance of \fBsmbd\fR may be running at a time.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB0\fR
.ad
.RS 13n
Daemon exited cleanly.
.RE

.sp
.ne 2
.na
\fB95\fR
.ad
.RS 13n
Daemon exited with a fatal error.
.RE

.sp
.ne 2
.na
\fB96\fR
.ad
.RS 13n
Daemon exited with a configuration error.
.RE

.SH ATTRIBUTES
.sp
.LP
See the \fBattributes\fR(5) man page for descriptions of the following
attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Uncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBps\fR(1), \fBsvcs\fR(1), \fBsharectl\fR(1M), \fBsharemgr\fR(1M),
\fBsmbadm\fR(1M), \fBsmbstat\fR(1M), \fBsvcadm\fR(1M), \fBsmb\fR(4),
\fBsmbautohome\fR(4), \fBsystem\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.sp
.LP
Use the \fBsvcadm\fR command to perform administrative actions on the
\fBsmbd\fR service, such as enabling, disabling, or restarting the service. Use
the \fBsvcs\fR command to query the service status.
.sp
.LP
The \fBsmbd\fR service is managed by the service management facility under the
service identifier \fBsvc:/network/smb/server\fR.
.sp
.LP
If the \fBsmbd\fR service is disabled, it will be enabled by the
\fBsharemgr\fR(1M) command,  unless its \fBauto_enable\fR  property is set to
false.
