illumos/illumos-gate/usr/src/man/man1m/smbstat.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH smbstat 1M "4 Aug 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbstat \- show Solaris CIFS file server statistics
.SH SYNOPSIS
.LP
.nf
\fBsmbstat\fR [\fB-di\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsmbstat\fR command shows statistical information for the \fBsmbd\fR
server. When the \fB-i\fR option is specified, the \fBsmbstat\fR command shows
general information about the \fBCIFS\fR service. For instance, \fBsmbstat\fR
\fB-i\fR shows the number of sessions, connections, and open files. The
\fB-d\fR option shows dispatched \fBCIFS\fR request counters.
.sp
.LP
By default, the \fBsmbstat\fR command shows all statistics.
.SH OPTIONS
.sp
.LP
The \fBsmbstat\fR command includes the following options:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
Shows all the dispatched \fBCIFS\fR requests on the \fBCIFS\fR server. This
option shows count statistics based on request activity.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
Shows the following information for the \fBCIFS\fR server:
.sp
.ne 2
.mk
.na
\fB\fBconnections\fR\fR
.ad
.sp .6
.RS 4n
Number of \fBCIFS\fR connections.
.RE

.sp
.ne 2
.mk
.na
\fB\fBopen_files\fR\fR
.ad
.sp .6
.RS 4n
Number of files open on the \fBCIFS\fR server.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsessions\fR\fR
.ad
.sp .6
.RS 4n
Number of active \fBCIFS\fR sessions.
.RE

.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 13n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 13n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See the \fBattributes\fR(5) man page for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityUncommitted
_
Utility Output FormatNot-an-Interface
.TE

.SH SEE ALSO
.sp
.LP
\fBsharectl\fR(1M), \fBsharemgr\fR(1M), \fBsmbadm\fR(1M), \fBsmbstat\fR(1M),
\fBattributes\fR(5)
