illumos/illumos-gate/usr/src/man/man1m/sndrsyncd.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH sndrsyncd 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
sndrsyncd \- Availability Suite Remote Mirror update resynchronization daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/sndrsyncd\fR 
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsndrsyncd\fR daemon automates update resynchronization after a network
or machine failure and invokes Point-in-Time Copy copies when needed to protect
the data volumes being updated during a resynchronization.
.sp
.LP
The daemon is notified by the kernel when a network link being used by Remote
Mirror goes down and invokes the \fBsndradm\fR(1M) command with the \fB-u\fR
option to resynchronize all Remote Mirror sets which have autosync switched on
and are using the network link. See \fBsndradm\fR(1M) for details on how to
configure autosync for a Remote Mirror set.
.sp
.LP
The daemon is also notified when any Remote Mirror resynchronization starts or
completes. The daemon takes Point-in-Time Copy snapshots, if configured in the
Availability Suite configuration file. On a secondary server, the daemon checks
if a file system is currently mounted on the secondary volume and informs the
kernel not to allow the synchronization to start if the file system is
currently mounted.
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 13n
.rt  
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 13n
.rt  
Daemon failed to start.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdcsyncd\fR\fR
.ad
.sp .6
.RS 4n
Shell script for starting \fBsndrsyncd\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/lib/svc/method/svc-rdc\fR\fR
.ad
.sp .6
.RS 4n
Shell script for stopping \fBsndrsyncd\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBiiadm\fR(1M), \fBsndradm\fR(1M), \fBsndrd\fR(1M), \fBsvcadm\fR(1M),
\fBds.log\fR(4), \fBrdc.cf\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
Do not manually stop the sndrsyncd deamon. If you need to manually stop
sndrsyncd perform these steps. This stops both the \fBsndrd\fR and
\fBsndrsyncd\fR daemons.
.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
Do not manually start or restart the \fBsndrsyncd\fR deamon. If you need to
manually start \fBsndrsyncd\fR perform these steps. This starts both the
\fBsndrd\fR and \fBsndrsyncd\fR daemons.
.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
See \fBsvcadm\fR(1M) for additional information.
