illumos/illumos-gate/usr/src/man/man1m/soconfig.1m
'\" te
.\"  Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SOCONFIG 1M "Oct 29, 2008"
.SH NAME
soconfig \- configure transport providers for use by sockets
.SH SYNOPSIS
.LP
.nf
\fB/sbin/soconfig\fR \fB-f\fR \fIfile\fR
.fi

.LP
.nf
\fB/sbin/soconfig\fR \fIfamily\fR \fItype\fR \fIprotocol\fR [\fIpath\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsoconfig\fR utility configures the transport provider driver for use
with sockets. It specifies how the family, type, and protocol parameters in the
\fBsocket\fR(3SOCKET) call are mapped to the name of a transport provider such
as \fB/dev/tcp\fR. This utility can be used to add an additional mapping or
remove a previous mapping.
.sp
.LP
The \fBinit\fR(1M) utility uses \fBsoconfig\fR with the \fBsock2path\fR(4) file
during the booting sequence.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-f\fR \fIfile\fR\fR
.ad
.RS 11n
Set up the \fBsoconfig\fR configuration for each driver according to the
information stored in \fBfile\fR. A \fBsoconfig\fR file consists of lines of at
least the first three fields listed below, separated by spaces:
.sp
\fIfamily  type  protocol  path\fR
.sp
These fields are described in the \fBOPERANDS\fR section below.
.sp
An example of \fBfile\fR can be found in the \fBEXAMPLES\fR section below.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.na
\fB\fIfamily\fR\fR
.ad
.RS 17n
The protocol family as listed in the \fB/usr/include/sys/socket.h\fR file,
expressed as an integer.
.RE

.sp
.ne 2
.na
\fB\fItype\fR\fR
.ad
.RS 17n
The socket type as listed in the \fB/usr/include/sys/socket.h\fR file,
expressed as an integer.
.RE

.sp
.ne 2
.na
\fB\fIprotocol\fR\fR
.ad
.RS 17n
The protocol number as specified in the family-specific \fBinclude\fR file,
expressed as an integer. For example, for \fBAF_INET\fR this number is
specified in \fB/usr/include/netinet/in.h\fR. An unspecified protocol number is
denoted with the value zero.
.RE

.sp
.ne 2
.na
\fB\fImodule\fR | \fIpath\fR\fR
.ad
.RS 17n
The module name or path name of a device that corresponds to the transport
provider, such as \fBtcp\fR or \fB/dev/tcp\fR. Modules must reside in
\fBkernel/socketmod\fR. A device name must begin with \fB/dev\fR. If this
parameter is specified, the configuration will be added for the specified
family, type, and protocol. If this parameter is not specified, the
configuration will be removed.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBsoconfig\fR
.sp
.LP
The following example sets up a module for family \fBAF_INET\fR and type
\fBSOCK_STREAM\fR:

.sp
.in +2
.nf
example# \fBsoconfig 2 2 0 tcp\fR
.fi
.in -2
.sp

.sp
.LP
The following example sets up \fB/dev/tcp\fR for family \fBAF_INET\fR and type
\fBSOCK_STREAM\fR:

.sp
.in +2
.nf
example# \fBsoconfig 2 2 0 /dev/tcp\fR
.fi
.in -2
.sp

.sp
.LP
The following is a sample file used with the \fB-f\fR option. Comment lines
begin with a hash mark (\fB#\fR):

.sp
.in +2
.nf
#   Family  Type  Protocol   Module | Path
      2       2       0          tcp
      2       2       6          tcp

      2       1       0          udp
      2       1       17         udp

      1       2       0          /dev/ticotsord
      1       1       0          /dev/ticlts

      2       4       0          icmp
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/sock2path\fR\fR
.ad
.RS 18n
File containing mappings from sockets to transport providers.
.RE

.SH SEE ALSO
.sp
.LP
\fBinit\fR(1M), \fBsock2path\fR(4), \fBattributes\fR(5)
.sp
.LP
\fINetwork Interface Guide\fR
