illumos/illumos-gate/usr/src/man/man1m/syseventconfd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH syseventconfd 1M "6 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
syseventconfd \- kernel system event command invocation daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/sysevent/syseventconfd\fR [\fB-r\fR \fIrootdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBsyseventconfd\fR is the user-level daemon that invokes user-level commands
in response to kernel system events received from \fBsyseventd\fR(1M).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIrootdir\fR\fR
.ad
.RS 14n
.rt  
Cause \fBsyseventconfd\fR to use an alternate root path when creating its door.
The root path must match the root path used to invoke \fBsyseventd\fR.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/sysevent/syseventconfd_event_service\fR\fR
.ad
.sp .6
.RS 4n
\fBsyseventconfd\fR event service door file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/sysevent/modules/sysevent_conf_mod.so\fR\fR
.ad
.sp .6
.RS 4n
\fBsyseventd\fR loadable module (\fBSLM\fR) managing \fBsysevent.conf\fR files
.RE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsyseventd\fR(1M), \fBattributes\fR(5),
\fBsmf\fR(5)
.SH NOTES
.sp
.LP
The \fBsyseventconfd\fR service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/sysevent:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(1M). The service's
status can be queried using the \fBsvcs\fR(1) command.
