illumos/illumos-gate/usr/src/man/man1m/tnchkdb.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH TNCHKDB 1M "Jul 20, 2007"
.SH NAME
tnchkdb \- check file syntax of trusted network databases
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tnchkdb\fR  [\fB-h\fR \fIpath\fR] [\fB-t\fR \fIpath\fR] [\fB-z\fR \fIpath\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBtnchkdb\fR checks the syntax of the \fBtnrhtp\fR, \fBtnrhdb\fR, and
\fBtnzonecfg\fR databases. By default, the \fIpath\fR for each file is:
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/security/tsol/tnrhtp\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/security/tsol/tnrhdb\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/etc/security/tsol/tnzonecfg\fR
.RE
.sp
.LP
You can specify an alternate path for any or all of the files by specifying
that path on the command line by using the \fB-h\fR (\fBtnrhdb\fR), \fB-t\fR
(\fBtnrhtp\fR) and \fB-z\fR (\fBtnzonecfg\fR) options. The options are useful
when testing a set of modified files before installing the files as new system
databases.
.sp
.LP
All three database files are checked for integrity. \fBtnchkdb\fR returns an
exit status of \fB0\fR if all of the files are syntactically and, to the extent
possible, semantically correct. If one or more files have errors, then an exit
status of \fB1\fR is returned. If there are command line problems, such as an
unreadable file, an exit status of \fB2\fR is returned. Errors are written to
standard error.
.sp
.LP
To avoid cascading errors, when there are errors in \fBtnrhtp\fR, the template
names in \fBtnrhdb\fR are not validated.
.sp
.LP
\fBtnchkdb\fR can be run at any label, but the standard
\fB/etc/security/tsol\fR files are visible only in the global zone.
.SH OPTIONS
.sp
.ne 2
.na
\fB\fB-h\fR [ \fIpath\fR ]\fR
.ad
.RS 15n
Check \fIpath\fR for proper \fBtnrhdb\fR syntax. If \fIpath\fR is not
specified, then check \fB/etc/security/tsol/tnrhdb\fR.
.RE

.sp
.ne 2
.na
\fB\fB-t\fR [ \fIpath\fR ]\fR
.ad
.RS 15n
Check \fIpath\fR for proper \fBtnrhtp\fR syntax. If \fIpath\fR is not
specified, then check \fB/etc/security/tsol/tnrhtp\fR.
.RE

.sp
.ne 2
.na
\fB\fB-z\fR [ \fIpath\fR ]\fR
.ad
.RS 15n
Check \fIpath\fR for proper \fBtnzonecfg\fR syntax. If \fIpath\fR is not
specified, then check \fB/etc/security/tsol/tnzonecfg\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSample Error Message
.sp
.LP
The \fBtnchkdb\fR command checks for CIPSO errors. In this example, the
\fBadmin_low\fR template has an incorrect value of \fBADMIN_HIGH\fR for its
default label.

.sp
.in +2
.nf
# \fBtnchkdb\fR
checking /etc/security/tsol/tnrhtp ...
tnchkdb: def_label classification 7fff is invalid for cipso labels:
line 14 entry admin_low
tnchkdb: def_label compartments 241-256 must be zero for cipso labels:
line 14 entry admin_low
checking /etc/security/tsol/tnrhdb ...
checking /etc/security/tsol/tnzonecfg ...
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/security/tsol/tnrhdb\fR\fR
.ad
.sp .6
.RS 4n
Trusted network remote-host database
.RE

.sp
.ne 2
.na
\fB\fB/etc/security/tsol/tnrhtp\fR\fR
.ad
.sp .6
.RS 4n
Trusted network remote-host templates
.RE

.sp
.ne 2
.na
\fB\fB/etc/security/tsol/tnzonecfg\fR\fR
.ad
.sp .6
.RS 4n
Trusted zone configuration database
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	See below.
.TE

.sp
.LP
The command line is Committed. The output is Uncommitted.
.SH SEE ALSO
.sp
.LP
\fBtnd\fR(1M), \fBtnctl\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fIHow to Check the Syntax of Trusted Network Databases\fR in \fISolaris
Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system
is configured with Trusted Extensions.
.sp
.LP
It is possible to have inconsistent but valid configurations of \fBtnrhtp\fR
and \fBtnrhdb\fR when \fBLDAP\fR is used to supply missing templates.
