illumos/illumos-gate/usr/src/man/man1m/txzonemgr.1m
'\" te
.\"  Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH TXZONEMGR 1M "Dec 17, 2007"
.SH NAME
txzonemgr \- Trusted Extensions Zone Manager Configuration Utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/txzonemgr\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBtxzonemgr\fR shell script provides a simple, menu-based \fBGUI\fR wizard
for creating, installing, initializing, and booting labeled zones on a system
on which Trusted Extensions is enabled. The script also provides menu items for
networking options, name services options, and making the global zone a client
of an existing  LDAP server. By default, all zones are configured to use the
same name service and IP address as the global zone.
.sp
.LP
\fBtxzonemgr\fR is run by roles granted in the Zone Management Rights Profile,
or by root in the global zone. It takes no options and returns no values.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Command Interface Stability 	Committed
_
Interactive Dialogue	Not an Interface
.TE

.SH SEE ALSO
.sp
.LP
\fBzenity\fR(1), \fBifconfig\fR(1M), \fBzoneadm\fR(1M), \fBzonecfg\fR(1M),
\fBattributes\fR(5), \fBrbac\fR(5), \fBzones\fR(5)
.sp
.LP
\fISolaris Trusted Extensions Administrator's Procedures\fR
.SH NOTES
.sp
.LP
If administering zones from \fBJDS\fR, use \fBtxzonemgr\fR rather than
\fBCDE\fR actions.
.sp
.LP
\fBtxzonemgr\fR uses the \fBzenity\fR command. For details, see the
\fBzenity\fR(1) man page.
