illumos/illumos-gate/usr/src/man/man1m/updatehome.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH UPDATEHOME 1M "Jul 20, 2007"
.SH NAME
updatehome \- update the home directory copy and link files for the current
label
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/updatehome\fR  [\fB-cirs\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBupdatehome\fR reads the user's minimum-label copy and link-control files
(\fB\&.copy_files\fR and \fB\&.link_files\fR). These files contain a list of
files to be copied and symbolically linked from the user's minimum-label home
directory to the user's home directory at the current label.
.sp
.LP
The Solaris Trusted Extensions \fBdtsession\fR program performs an
\fBupdatehome\fR whenever a newly labeled workspace is created so that the
user's favorite files are available for use. For example, the user probably
wants a symbolic link to such files as \fB\&.profile\fR, \fB\&.login\fR,
\fB\&.cshrc\fR, \fB\&.exrc\fR, \fB\&.mailrc\fR, and \fB~/bin\fR. The
\fBupdatehome\fR command provides a convenient mechanism for accomplishing this
symlink. The user can add files to those to be copied (\fB\&.copy_files\fR) and
to those to be symbolically linked (\fB\&.link_files\fR).
.SH OPTIONS
.sp
.ne 2
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
Replace existing home-directory copies at the current label. The default is to
skip over existing copies.
.RE

.sp
.ne 2
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
Ignore errors encountered. The default aborts on error.
.RE

.sp
.ne 2
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
Replace existing home-directory copies or symbolic links at the current label.
This option implies options \fB-c\fR and \fB-s\fR. The default is to skip over
existing copies or symbolic links.
.RE

.sp
.ne 2
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
Replace existing home-directory symbolic links at the current label. The
default is to skip over existing symbolic links.
.RE

.SH EXIT STATUS
.sp
.LP
Upon success, \fBupdatehome\fR returns \fB0\fR. Upon failure, \fBupdatehome\fR
returns \fB1\fR and writes diagnostic messages to standard error.
.SH EXAMPLES
.LP
\fBExample 1 \fRA Sample \fB\&.copy_files\fR File
.sp
.LP
The files that are listed in \fB\&.copy_files\fR can be modified at every
user's label.

.sp
.in +2
.nf
\&.cshrc
\&.mailrc
\&.mozilla/bookmarks.html
.fi
.in -2
.sp

.LP
\fBExample 2 \fRA Sample \fB\&.link_files\fR File
.sp
.LP
The files that are listed in \fB\&.link_files\fR can be modified at the lowest
label. The changes propagate to the other labels that are available to the
user.

.sp
.in +2
.nf
~/bin
\&.mozilla/preferences
\&.xrc
\&.rhosts
.fi
.in -2
.sp

.LP
\fBExample 3 \fRUpdating the Linked and Copied Files
.sp
.LP
The \fB\&.copy_files\fR and \fB\&.link_files\fR were updated by the user at the
minimum label. At a higher label, the user refreshes the copies and the links.
No privileges are required to run the command.

.sp
.in +2
.nf
% \fBupdatehome -r\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.na
\fB\fB$HOME/.copy_files\fR\fR
.ad
.RS 21n
List of files to be copied
.RE

.sp
.ne 2
.na
\fB\fB$HOME/.link_files\fR\fR
.ad
.RS 21n
List of files to be symbolically linked
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
.sp
.LP
\fI\&.copy_files and .link_files Files\fR in \fISolaris Trusted Extensions
Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system
is configured with Trusted Extensions.
