illumos/illumos-gate/usr/src/man/man1m/uucico.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH UUCICO 1M "May 19, 1993"
.SH NAME
uucico \- file transport program for the uucp system
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/uucp/uucico\fR [\fB-f\fR] [\fB-c\fR \fItype\fR] [\fB-d\fR \fIspool-directory\fR]
     [\fB-i\fR \fIinterface\fR] [\fB-r\fR \fIrole-number\fR] [\fB-s\fR \fIsystem-name\fR]
     [\fB-x\fR \fIdebug-level\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBuucico\fR is the file transport program for \fBuucp\fR work file transfers.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-f\fR\fR
.ad
.RS 22n
This option is used to "force execution" of \fBuucico\fR by ignoring the limit
on the maximum number of uucicos defined in the \fB/etc/uucp/Limits\fR file.
.RE

.sp
.ne 2
.na
\fB\fB-c\fR\fI type\fR\fR
.ad
.RS 22n
The first field in the \fBDevices\fR file is the "Type" field.  The \fB-c\fR
option forces \fBuucico\fR to only use entries in the "Type" field that match
the user specified \fBtype\fR. The specified \fBtype\fR is usually the name of
a local area network.
.RE

.sp
.ne 2
.na
\fB\fB-d\fR\fI spool-directory\fR\fR
.ad
.RS 22n
This option specifies the directory \fIspool-directory\fR that contains the
\fBuucp\fR work files to be transferred.  The default spool directory is
\fB/var/spool/uucp\fR.
.RE

.sp
.ne 2
.na
\fB\fB-i\fR\fI interface\fR\fR
.ad
.RS 22n
This option defines the \fIinterface\fR used with \fBuucico\fR. The interface
only affects slave mode.  Known interfaces are UNIX (default), TLI (basic
Transport Layer Interface), and TLIS (Transport Layer Interface with Streams
modules, read/write).
.RE

.sp
.ne 2
.na
\fB\fB-r\fR\fI role-number\fR\fR
.ad
.RS 22n
The \fIrole-number\fR \fB1\fR is used for master mode. \fIrole-number\fR
\fB0\fR is used for slave mode (default).  When \fBuucico\fR is started by a
program or \fBcron\fR, \fIrole-number\fR \fB1\fR should be used for master
mode.
.RE

.sp
.ne 2
.na
\fB\fB-s\fR\fI system-name\fR\fR
.ad
.RS 22n
The \fB-s\fR option defines the remote system (\fIsystem-name\fR) that
\fBuucico\fR will try to contact.  It is required when the role is master;
\fIsystem-name\fR must be defined in the \fBSystems\fR file.
.RE

.sp
.ne 2
.na
\fB\fB-x\fR\fI debug-level\fR\fR
.ad
.RS 22n
Both \fBuux\fR and \fBuucp\fR queue jobs that will be transferred by
\fBuucico\fR. These jobs are normally started by the \fBuusched\fR scheduler,
for debugging purposes, and can be started manually. For example, the shell
\fBUutry\fR starts \fBuucico\fR with debugging turned on. The \fIdebug-level\fR
is a number between \fB0\fR and \fB9\fR.  Higher numbers give more  detailed
debugging information.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/uucp/Devconfig\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Devices\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Limits\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Permissions\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Sysfiles\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Systems\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/locks/*\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/uucp/*\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/uucppublic/*\fR\fR
.ad
.RS 27n

.RE

.SH SEE ALSO
.sp
.LP
\fBuucp\fR(1C), \fBuustat\fR(1C), \fBuux\fR(1C), \fBUutry\fR(1M),
\fBcron\fR(1M), \fBuusched\fR(1M), \fBattributes\fR(5)
