illumos/illumos-gate/usr/src/man/man1m/Uutry.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH UUTRY 1M "May 18, 1993"
.SH NAME
Uutry, uutry \- attempt to contact remote system with debugging on
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/uucp/Uutry\fR [\fB-r\fR] [\fB-c\fR \fItype\fR] [\fB-x\fR \fIdebug-level\fR] \fIsystem-name\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBUutry\fR is a shell script that is used to invoke \fBuucico\fR(1M) to call a
remote site. Debugging is initially turned on and is set to the default value
of \fB5\fR. The debugging output is put in file \fB/tmp/\fR\fIsystem-name.\fR
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-r\fR \fR
.ad
.RS 19n
This option overrides the retry time that is set in file
\fB/var/uucp/.Status/\fR\fIsystem-name.\fR
.RE

.sp
.ne 2
.na
\fB\fB-c\fR\fI type\fR \fR
.ad
.RS 19n
The first field in the \fBDevices\fR file is the "Type" field.  The \fB-c\fR
option forces \fBuucico\fR to use only entries in the "Type" field that  match
the user-specified \fBtype\fR. The specified \fBtype\fR is usually the name of
a local area network.
.RE

.sp
.ne 2
.na
\fB\fB-x\fR\fI debug-level\fR \fR
.ad
.RS 19n
\fIdebug-level\fR is a number from \fB0\fR to \fB9\fR.  Higher numbers give
more detailed debugging information.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/uucp/Devices\fR \fR
.ad
.RS 28n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Limits\fR \fR
.ad
.RS 28n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Permissions\fR \fR
.ad
.RS 28n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Systems\fR \fR
.ad
.RS 28n

.RE

.sp
.ne 2
.na
\fB\fB/tmp/\fR\fIsystem-name\fR \fR
.ad
.RS 28n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/locks/*\fR \fR
.ad
.RS 28n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/uucp/*\fR \fR
.ad
.RS 28n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/uucppublic/*\fR \fR
.ad
.RS 28n

.RE

.SH SEE ALSO
.sp
.LP
\fBuucp\fR(1C), \fBuux\fR(1C), \fBuucico\fR(1M), \fBattributes\fR(5)
