illumos/illumos-gate/usr/src/man/man1m/vndstat.1m
'\" te
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\"
.\" Copyright (c) 2014, Joyent, Inc.  All rights reserved.
.\"
.TH VNDSTAT 1M "Mar 06, 2014"
.SH NAME
vndstat \- report vnd activity

.SH SYNOPSIS

vndstat [interval [count]]

.SH DESCRIPTION
.sp
.LP
The vndstat command reports a summary of per-device vnd
activity. Once per interval it prints a table of statistics per
device. In the global zone, vndstat reports on all devices in the
system. From the non-global zone, it only reports on devices that are
present in that zone. vndstat reports on all vnd devices
that exist, including anonymous devices which are not linked into the
file system.
.sp
.LP
The vndstat command's output includes the following information:
.sp
.ne 2
.na
.B name
.ad
.RS 14n
The name of the device, if bound. If a given vnd device is not
bound into the file system, hence considered anonymous, then there will
be no name for the device.
.RE

.sp
.ne 2
.na
.B rx B/s
.ad
.RS 14n
The number of bytes received by the device during interval.
.RE

.sp
.ne 2
.na
.B tx B/s
.ad
.RS 14n
The number of bytes transmitted by the device during interval.
.RE

.sp
.ne 2
.na
.B drops
.ad
.RS 14n
The number of packets and messages which have been dropped. This
includes all drops due to insufficient buffer space, IP hooks, and
unknown or malformed DLPI messages.
.RE

.sp
.ne 2
.na
.B txfc
.ad
.RS 14n
The number of flow control events that have occurred. A flow control
event occurs when the layers below vnd request that all transmits
be paused until a future call resumes the flow. This statistic is
incremented when the flow is resumed. It is not incremented when it is
first paused.
.RE

.sp
.ne 2
.na
.B zone
.ad
.RS 14n
The name of the zone the device is located in.
.RE

.SH OPTIONS

.sp
.ne 2
.na
interval
.ad
.RS 13n
Report once each interval seconds. interval may not be
fractional.
.RE

.sp
.ne 2
.na
count
.ad
.RS 13n
Only print count reports, then exit.
.RE
.sp
.LP
When no arguments are given to vndstat, it will always print at an
interval of one second. Reports will continue until vndstat
is terminated.

.SH EXAMPLES
.LP
Example 1 Print five seconds of data

.sp
.in +2
.nf
example% vndstat 1 5
  name |   rx B/s |   tx B/s | drops txfc | zone
  net0 | 1.45MB/s | 14.1KB/s |     0    0 | 1b7155a4-aef9-e7f0-d33c-9705e4b8b525
  net0 | 3.50MB/s | 19.5KB/s |     0    0 | 1b7155a4-aef9-e7f0-d33c-9705e4b8b525
  net0 | 2.83MB/s | 30.8KB/s |     0    0 | 1b7155a4-aef9-e7f0-d33c-9705e4b8b525
  net0 | 3.08MB/s | 30.6KB/s |     0    0 | 1b7155a4-aef9-e7f0-d33c-9705e4b8b525
  net0 | 3.21MB/s | 30.6KB/s |     0    0 | 1b7155a4-aef9-e7f0-d33c-9705e4b8b525
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See attributes(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	See below.
.TE

.sp
.LP
Invocation is evolving. Human readable output is unstable.
.SH SEE ALSO

dlstat(1M), nicstat(1M), vndadm(1M), vnd(7M)
