illumos/illumos-gate/usr/src/man/man1m/wanboot_p12split.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing. See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH WANBOOT_P12SPLIT 1M "Apr 18, 2003"
.SH NAME
wanboot_p12split \- split a PKCS #12 file into separate certificate and key
files
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/wanboot/p12split\fR \fB-i\fR \fIp12file\fR \fB-c\fR \fIout_cert\fR \fB-k\fR \fIout_key\fR
     [\fB-t\fR \fIout_trust\fR \fB-l\fR \fIid\fR \fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBp12split\fR utility extracts a certificate and private key from the
repository specified by \fIp12file\fR, depositing the certificate in
\fIout_cert\fR and the key in \fIout_key\fR. If supplied, the \fB-l\fR option
specifies the value for the \fBLocalKeyId\fR that will be used in the new
certificate and key files. \fBp12split\fR can optionally extract a trust
certificate into the \fIout_trust\fR file if the \fB-t\fR option is specified.
Use the \fB-v\fR option to get a verbose description of the split displayed to
standard output.
.SH OPTIONS
.sp
.LP
The following arguments and options are supported:
.sp
.ne 2
.na
\fB\fB-c\fR \fIout_cert\fR\fR
.ad
.RS 16n
Specifies a repository that receives a extracted certificate.
.RE

.sp
.ne 2
.na
\fB\fB-i\fR \fIp12file\fR\fR
.ad
.RS 16n
Specifies a repository from which a certificate and private key is extracted.
.RE

.sp
.ne 2
.na
\fB\fB-k\fR \fIout_key\fR\fR
.ad
.RS 16n
Specifies a repository that receives a extracted private key.
.RE

.sp
.ne 2
.na
\fB\fB-l\fR \fIid\fR\fR
.ad
.RS 16n
Specifies the value for the \fBLocalKeyId\fR that will be used in the new
certificate and key files.
.RE

.sp
.ne 2
.na
\fB\fB-t\fR \fIout_trust\fR\fR
.ad
.RS 16n
Specifies a file for receiving an extracted trust certificate.
.RE

.sp
.ne 2
.na
\fB\fB-v\fR\fR
.ad
.RS 16n
Displays a verbose description of the split to stdout.
.RE

.SH EXIT STATUS
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 6n
Successful operation.
.RE

.sp
.ne 2
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Unstable
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
