illumos/illumos-gate/usr/src/man/man1m/yppoll.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1988 Sun Microsystems, Inc. - All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH YPPOLL 1M "Sep 14, 1992"
.SH NAME
yppoll \- return current version of a NIS map at a NIS server host
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/yppoll\fR [\fB-d\fR \fIypdomain\fR] [\fB-h\fR \fIhost\fR] \fImapname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fByppoll\fR command asks a \fBypserv\fR(\|) process what the order number
is, and which host is the master NIS server for the named map.
.SH OPTIONS
.sp
.ne 2
.na
\fB\fB\fR\fB-d\fR\fB \fR\fIypdomain\fR\fR
.ad
.RS 15n
Use \fIypdomain\fR instead of the default domain.
.RE

.sp
.ne 2
.na
\fB\fB\fR\fB-h\fR\fB \fR\fIhost\fR\fR
.ad
.RS 15n
Ask the \fBypserv\fR process at \fIhost\fR about the map parameters. If
\fIhost\fR is not specified, the NIS server for the local host is used. That
is, the default host is the one returned by \fBypwhich\fR(1).
.RE

.SH SEE ALSO
.sp
.LP
\fBypwhich\fR(1), \fBypfiles\fR(4), \fBattributes\fR(5)
