illumos/illumos-gate/usr/src/man/man1m/yppush.1m
'\" te
.\"  Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH YPPUSH 1M "Aug 26, 1999"
.SH NAME
yppush \- force propagation of changed NIS map
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/yppush\fR [\fB-v\fR] [\fB-h\fR \fIhost\fR] [\fB-d\fR \fIdomain\fR]
     [\fB-p\fR \fI#parallel-xfrs\fR] \fImapname\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fByppush\fR copies a new version of a  Network Information Service (\fBNIS\fR)
map from the master \fBNIS\fR server to the slave \fBNIS\fR servers. It is
normally run only on the master \fBNIS\fR server by the \fBMakefile\fR in
\fB/var/yp\fR after the master databases are changed. It first constructs a
list of \fBNIS\fR server hosts by reading the \fBNIS\fR \fBypservers\fR map
within the \fIdomain\fR. Keys within the \fBypservers\fR map are the
\fBASCII\fR names of the machines on which the \fBNIS\fR servers run.
.sp
.LP
A "transfer map" request is sent to the \fBNIS\fR server at each host, along
with the information needed by the transfer agent (the program that actually
moves the map) to call back the \fByppush\fR. When the attempt has completed
(successfully or not), and the transfer agent has sent \fByppush\fR a status
message, the results can be printed to \fBstdout\fR. Messages are also printed
when a transfer is not possible, for instance, when the request message is
undeliverable, or when the timeout period on responses has expired.
.sp
.LP
Refer to \fBypfiles\fR(4) and \fBypserv\fR(1M) for an overview of the \fBNIS\fR
service.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-d\fR \fIdomain\fR\fR
.ad
.RS 21n
Specifies a \fIdomain\fR.
.RE

.sp
.ne 2
.na
\fB\fB-h\fR \fIhost\fR\fR
.ad
.RS 21n
Propagates only to the named \fIhost\fR.
.RE

.sp
.ne 2
.na
\fB\fB-p\fR \fI#parallel-xfrs\fR\fR
.ad
.RS 21n
Allows the specified number of map transfers to occur in parallel.
.RE

.sp
.ne 2
.na
\fB\fB-v\fR\fR
.ad
.RS 21n
Verbose.  This prints messages when each server is called, and for each
response. If this flag is omitted, only error messages are printed.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/var/yp\fR\fR
.ad
.sp .6
.RS 4n
Directory where \fBNIS\fR configuration files reside.
.RE

.sp
.ne 2
.na
\fB\fB/var/yp/\fIdomain\fR/ypservers.\|{\fIdir\fR,\fI pag\|\fR}\fR\fR
.ad
.sp .6
.RS 4n
Map containing list of  \fBNIS\fR servers to bind to when running in server
mode.
.RE

.SH SEE ALSO
.sp
.LP
\fBypserv\fR(1M), \fBypxfr\fR(1M), \fBypfiles\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun Yellow
Pages (\fBYP\fR). The functionality of the two remains the same; only the name
has changed. The name Yellow Pages is a registered trademark in the United
Kingdom of British Telecommunications PLC, and must not be used without
permission.
.SH BUGS
.sp
.LP
In the current implementation (version 2 \fBNIS\fR protocol), the transfer
agent is \fBypxfr\fR(1M), which is started by the \fBypserv\fR program. If
\fByppush\fR detects that it is speaking to a version 1 \fBNIS\fR protocol
server, it uses the older protocol, sending a version 1 \fBYPPROC_GET\fR
request and issues a message to that effect. Unfortunately, there is no way of
knowing if or when the map transfer is performed for version 1 servers.
\fByppush\fR prints a message saying that an "old-style" message has been sent.
The system administrator should later check to see that the transfer has
actually taken place.
