illumos/illumos-gate/usr/src/man/man1m/ypstart.1m
'\" te
.\"  Copyright (c) 2000, Sun Microsystems, Inc.
.\"  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH YPSTART 1M "Oct 24, 1996"
.SH NAME
ypstart, ypstop \- Start and stop NIS services
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/ypstart\fR
.fi

.LP
.nf
\fB/usr/lib/netsvc/yp/ypstop\fR
.fi

.SH DESCRIPTION
.sp
.LP
The  \fBypstart\fR command is used to start the Network Information Service
(NIS). After the host has been configured using the \fBypinit\fR(1M) command,
\fBypstart\fR automatically determines the \fBNIS\fR status of the machine and
starts the appropriate daemons.
.sp
.LP
The \fBypstop\fR command is used to stop the  Network Information Service
(NIS).
.SH SEE ALSO
.sp
.LP
\fBypinit\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fI\fR
.SH NOTES
.sp
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun Yellow
Pages (\fBYP\fR).  The functionality of the two services remains the same; only
the name has changed. The name Yellow Pages is a registered trademark in the
United Kingdom of British Telecommunications \fBPLC\fR, and must not be used
without permission.
