illumos/illumos-gate/usr/src/man/man1m/zschedstat.1m
'\" te
.\" Copyright (c) 2012, Joyent, Inc.  All Rights reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with
.\" the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ZSCHEDSTAT 1M "Jan 16, 2012"
.SH NAME
zschedstat \- report per-zone CPU scheduling statistics
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/zschedstat\fR [\fB-r] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBzschedstat\fR utility iteratively reports per-zone CPU-scheduling
activity. The first iteration of output is for all time since boot; each
subsequent iteration is for the prior interval only.
.sp
.LP
The output of the \fBzschedstat\fR utility shows the following information.
.sp
.ne 2
.na
\fB\fBzid\fR\fR
.ad
.RS 10n
zone ID
.RE

.sp
.ne 2
.na
\fB\fBrq\fR\fR
.ad
.RS 10n
The number of threads FSS saw in the run queue in the last second.
.RE

.sp
.ne 2
.na
\fB\fBrsec\fR\fR
.ad
.RS 10n
The total number of seconds that FSS counted processes running for this
zone during the sampling interval.
.RE

.sp
.ne 2
.na
\fB\fBsh%\fR\fR
.ad
.RS 10n
The percent of the active shares FSS calculated for this zone.  This column
may not sum exactly to 100% due to rounding.
.RE

.sp
.ne 2
.na
\fB\fBph\fR\fR
.ad
.RS 10n
The highest priorty FSS calculated for a process during the last second
(range 0-59).  This will be 0 if FSS saw no runnable processes for the zone
in the last second.
.RE

.sp
.ne 2
.na
\fB\fBpa\fR\fR
.ad
.RS 10n
The average priorty FSS calculated for all runnable processes during the last
second that there were runnable processes for this zone (range 0-59).
This data might be several seconds old if there were no runnable processes
in the interval.
.RE

.sp
.ne 2
.na
\fB\fBcap\fR\fR
.ad
.RS 10n
The current cpu-cap for the zone (in percent of a CPU).
.RE

.sp
.ne 2
.na
\fB\fBusage\fR\fR
.ad
.RS 10n
The cpu-cap calculated usage for the zone in the interval (in percent of a CPU).
The usage will be 0 if there is no cpu-cap.
.RE

.sp
.ne 2
.na
\fB\fBbs\fR\fR
.ad
.RS 10n
The number of seconds during the interval that the zone was bursting.
This will be 0 if there is no cpu-cap.
.RE

.sp
.ne 2
.na
\fB\fB1mla\fR\fR
.ad
.RS 10n
The one minute load average for the zone.
.RE

.sp
.ne 2
.na
\fB\fBdcnt\fR\fR
.ad
.RS 10n
The number of times that the ZFS I/O throttle delayed a process in the zone.
.RE

.sp
.ne 2
.na
\fB\fBdms\fR\fR
.ad
.RS 10n
The total time, in milli-seconds, of ZFS I/O throttle delay for processes in the
zone.
.RE

.sp
.ne 2
.na
\fB\fBuser\fR\fR
.ad
.RS 10n
The total number of seconds processes were running in user-level code.
.RE

.sp
.ne 2
.na
\fB\fBsys\fR\fR
.ad
.RS 10n
The total number of seconds processes were running in the kernel.
.RE

.sp
.ne 2
.na
\fB\fBwtrq\fR\fR
.ad
.RS 10n
The total number of seconds processes were waiting in the run queue to run.
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-r\fR\fR
.ad
.RS 12n
Display data in a comma-separated format.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.na
\fB\fIcount\fR\fR
.ad
.RS 12n
Display only \fIcount\fR reports.
.RE

.sp
.ne 2
.na
\fB\fIinterval\fR\fR
.ad
.RS 12n
Report once each \fIinterval\fR seconds.
.RE
