illumos/illumos-gate/usr/src/man/man1/du.1
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online at
.\" http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open
.\" Group, have given us permission to reprint portions of their
.\" documentation.
.\"
.\" In the following statement, the phrase ``this text'' refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form
.\" in the SunOS Reference Manual, from IEEE Std 1003.1, 2004 Edition,
.\" Standard for Information Technology -- Portable Operating System
.\" Interface (POSIX), The Open Group Base Specifications Issue 6,
.\" Copyright (C) 2001-2004 by the Institute of Electrical and Electronics
.\" Engineers, Inc and The Open Group.  In the event of any discrepancy
.\" between these versions and the original IEEE and The Open Group
.\" Standard, the original IEEE and The Open Group Standard is the referee
.\" document.  The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright (c) 1992, X/Open Company Limited. All Rights Reserved.
.\" Portions Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 2017 OmniTI Computer Consulting, Inc. All rights reserved.
.\" Copyright 2026 Oxide Computer Company
.\"
.Dd March 18, 2026
.Dt DU 1
.Os
.Sh NAME
.Nm du
.Nd summarize disk usage
.Sh SYNOPSIS
.Nm
.Op Fl Adorx
.Op Fl a | s
.Op Fl b | h | k | m
.Op Fl H | L
.Op Ar file No \&...
.Nm /usr/xpg4/bin/du
.Op Fl Adorx
.Op Fl a | s
.Op Fl b | h | k | m
.Op Fl H | L
.Op Ar file No \&...
.Sh DESCRIPTION
The
.Nm
utility writes to standard output the size of the file space allocated to, and
the size of the file space allocated to each subdirectory of, the file
hierarchy rooted in each of the specified files.
The size of the file space allocated to a file of type directory is defined as
the sum total of space allocated to all files in the file hierarchy rooted in
the directory plus the space allocated to the directory itself.
This sum will include the space allocated to any extended attributes
encountered.
Files with multiple links will be counted and written for only one entry.
The directory entry that is selected in the report is unspecified.
By default, file sizes are written in 512-byte units, rounded up to the next
512-byte unit.
.Ss /usr/xpg4/bin/du
When
.Nm
cannot obtain file attributes or read directories
.Po
see
.Xr stat 2
.Pc ,
it will report an error condition and the final exit status will be affected.
.Sh OPTIONS
The following options are supported for
.Nm /usr/bin/du
and
.Nm /usr/xpg4/bin/du :
.Bl -tag -width Ds
.It Fl a
In addition to the default output, report the size of each file not of type
directory in the file hierarchy rooted in the specified file.
Regardless of the presence of the
.Fl a
option, non-directories given as
.Ar file
operands will always be listed.
.It Fl A
Tally file size using the apparent size of the file instead of the disk blocks
it occupies.
This option is useful when operating on file systems which employ compression
or in the presence of sparse files.
.It Fl b
Report sizes in bytes.
Use of this option also implies
.Fl A
since reporting in bytes requires the apparent file size rather than the
allocated block count.
.It Fl d
Do not cross filesystem boundaries.
For example, the command,
.Sq Nm du Fl d Pa /
reports usage only on the root partition.
.It Fl h
All sizes are scaled to a human readable format, for example,
.Sy 14K ,
.Sy 234M ,
.Sy 2.7G ,
or
.Sy 3.0T .
Scaling is done by repeatedly dividing by
.Sy 1024 .
.It Fl H
If a symbolic link to a directory is specified on the command line, process the
symbolic link by using the directory which the symbolic link references, rather
than the link itself.
.It Fl k
Write the files sizes in units of 1024 bytes, rather than the default 512-byte
units.
.It Fl L
Process symbolic links by using the file or directory which the symbolic link
references, rather than the link itself.
.It Fl m
Write the files sizes in units of megabytes, rather than the default 512-byte
units.
.It Fl o
Do not add child directories' usage to a parent's total.
Without this option, the usage listed for a particular directory is the space
taken by the files in that directory, as well as the files in all directories
beneath it.
This option does nothing if
.Fl s
is used.
.It Fl r
Generate diagnostic messages about unreadable directories and files whose
status cannot be obtained.
.Nm /usr/bin/du
is silent if these conditions arise and
.Fl r
is not specified.
.Nm /usr/xpg4/bin/du
acts as though
.Fl r
is always specified.
.It Fl s
Instead of the default output, report only the total sum for each of the
specified files.
.It Fl x
When evaluating file sizes, evaluate only those files that have the same device
as the file specified by the file operand.
.El
.Pp
Specifying more than one of the options in the mutually exclusive pair,
.Fl H
and
.Fl L ,
is not considered an error.
The last option specified determines the output format.
.Pp
Specifying more than one of the options in the mutually exclusive set of options
.Fl h ,
.Fl k ,
and
.Fl m
is not considered an error.
The last option specified determines the output format.
.Pp
Specifying
.Fl b
along with one of
.Fl h ,
.Fl k ,
or
.Fl m
is considered an error.
.Sh OPERANDS
The following operand is supported:
.Bl -tag -width Ds
.It Ar file
The path name of a file whose size is to be written.
If no
.Ar file
is specified, the current directory is used.
.El
.Sh OUTPUT
The output from
.Nm
consists of the amount of the space allocated to a file and the name of the
file.
.Nm /usr/bin/du
uses a TAB character to separate the fields, whereas
.Nm /usr/xpg4/bin/du
uses a SPACE.
.Sh USAGE
See
.Xr largefile 7
for the description of the behavior of
.Nm
when encountering files greater than or equal to 2 Gbyte
.Pq  2^31 bytes .
.Sh ENVIRONMENT
See
.Xr environ 7
for descriptions of the following environment variables that affect the
execution of
.Nm :
.Ev LANG ,
.Ev LC_ALL ,
.Ev LC_CTYPE ,
.Ev LC_MESSAGES ,
and
.Ev NLSPATH .
.Sh EXIT STATUS
The following exit values are returned:
.Bl -tag -width Ds
.It Sy 0
Successful completion.
.It >0
An error occurred.
.El
.Sh INTERFACE STABILITY
The command line interface of
.Nm
is
.Sy Committed .
The output of
.Nm
is
.Sy Committed .
.Sh SEE ALSO
.Xr ls 1 ,
.Xr stat 2 ,
.Xr attributes 7 ,
.Xr environ 7 ,
.Xr fsattr 7 ,
.Xr largefile 7 ,
.Xr standards 7
.Sh NOTES
A file with two or more links is counted only once.
If, however, there are links between files in different directories where the
directories are on separate branches of the file system hierarchy,
.Nm
will count the excess files more than once.
Files containing holes will result in an incorrect block count.
In this case, one may use the
.Fl A
option to report file sizes by their apparent size instead.
