illumos/illumos-gate/usr/src/man/man1/mv.1
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online at
.\" http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open
.\" Group, have given us permission to reprint portions of their
.\" documentation.
.\"
.\" In the following statement, the phrase ``this text'' refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form
.\" in the SunOS Reference Manual, from IEEE Std 1003.1, 2004 Edition,
.\" Standard for Information Technology -- Portable Operating System
.\" Interface (POSIX), The Open Group Base Specifications Issue 6,
.\" Copyright (C) 2001-2004 by the Institute of Electrical and Electronics
.\" Engineers, Inc and The Open Group.  In the event of any discrepancy
.\" between these versions and the original IEEE and The Open Group
.\" Standard, the original IEEE and The Open Group Standard is the referee
.\" document.  The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\" Portions Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright 2026 Oxide Computer Company
.\"
.Dd "March 22, 2026"
.Dt MV 1
.Os
.Sh NAME
.Nm mv
.Nd move files
.Sh SYNOPSIS
.Nm /usr/bin/mv
.Op Fl fin
.Ar source
.Ar target_file
.Nm /usr/bin/mv
.Op Fl fin
.Ar source Ns ...
.Ar target_dir
.Pp
.Nm /usr/xpg4/bin/mv
.Op Fl fin
.Ar source
.Ar target_file
.Nm /usr/xpg4/bin/mv
.Op Fl fin
.Ar source Ns ...
.Ar target_dir
.Sh DESCRIPTION
In the first synopsis form, the
.Nm
utility moves the file named by the
.Ar source
operand to the destination specified by the
.Ar target_file .
.Ar source
and
.Ar target_file
can not have the same name.
If
.Ar target_file
does not exist,
.Nm
creates a file named
.Ar target_file .
If
.Ar target_file
exists, its contents are overwritten.
This first synopsis form is assumed when the final operand does not name an
existing directory.
.Pp
In the second synopsis form,
.Nm
moves each file named by a
.Ar source
operand to a destination file in the existing directory named by the
.Ar target_dir
operand.
The destination path for each
.Ar source
is the concatenation of the target directory, a single slash character
.Pq Sq /
and the last path name component of the
.Ar source .
This second form is assumed when the final operand names an existing directory.
.Pp
If
.Nm
determines that the mode of
.Ar target_file
forbids writing, it prints the mode
.Po
see
.Xr chmod 2
.Pc ,
asks for a response, and reads the standard input for one line.
If the response is affirmative, the
.Nm
occurs, if permissible; otherwise, the command exits.
Notice that the mode displayed can not fully represent the access permission if
.Ar target
is associated with an ACL.
When the parent directory of
.Ar source
is writable and has the sticky bit set, one or more of the following conditions
must be true:
.Bl -bullet -offset indent
.It
the user must own the file
.It
the user must own the directory
.It
the file must be writable by the user
.It
the user must be a privileged user
.El
.Pp
If
.Ar source
is a file and
.Ar target_file
is a link to another file with links, the other links remain and
.Ar target_file
becomes a new file.
.Pp
If
.Ar source
and
.Ar target_file Ns / Ns Ar target_dir
are on different file systems,
.Nm
copies the source and deletes the original.
Any hard links to other files are lost.
.Nm
attempts to duplicate the source file characteristics to the target, that is,
the owner and group id, permission modes, modification and access times, ACLs,
and extended attributes, if applicable.
For symbolic links,
.Nm
preserves only the owner and group of the link itself.
.Pp
If unable to preserve owner and group id,
.Nm
clears
.Dv S_ISUID
and
.Dv S_ISGID
bits in the target.
.Nm
prints a diagnostic message to stderr if unable to clear these bits, though the
exit code is not affected.
.Nm
might be unable to preserve extended attributes if the target file system does
not have extended attribute support.
.Pa /usr/xpg4/bin/mv
prints a diagnostic message to stderr for all other failed attempts to duplicate
file characteristics.
The exit code is not affected.
.Pp
In order to preserve the source file characteristics, users must have the
appropriate file access permissions.
This includes being super-user or having the same owner id as the destination
file.
.Sh OPTIONS
.Bl -tag -width Ds
.It Fl f
.Nm
moves the file(s) without prompting even if it is writing over an existing
.Ar target .
Note that this is the default if the standard input is not a terminal.
This overrides any
.Fl i
and
.Fl n
options already specified on the command line.
.It Fl i
.Nm
prompts for confirmation whenever the move would overwrite an existing
.Ar target .
An affirmative answer means that the move should proceed.
Any other answer prevents
.Nm
from overwriting the
.Ar target .
This overrides any
.Fl n
options already specified on the command line.
See the discussion of binary-specific behavior below for how
.Fl i
and
.Fl f
interact.
.It Fl n
.Nm
will not overwrite
.Ar target
if it already exists, proceeding on to other sources.
This does not generate an error.
This overrides any
.Fl i
or
.Fl f
options already specified on the command line.
.El
.Ss "/usr/bin/mv"
Specifying the
.Fl f ,
the
.Fl i ,
and the
.Fl n
options is not considered an error.
The last option specified determines the behavior of
.Nm
with one exception: the
.Fl f
option overrides all
.Fl i
options, regardless of where they appear in the command line.
.Ss "/usr/xpg4/bin/mv"
Specifying the
.Fl f ,
the
.Fl i ,
and the
.Fl n
options is not considered an error.
The last option specified determines the behavior of
.Nm .
.Sh OPERANDS
The following operands are supported:
.Bl -tag -width Ar
.It Ar source
A path name of a file or directory to be moved.
.It Ar target_file
A new path name for the file or directory being moved.
.It Ar target_dir
A path name of an existing directory into which to move the input files.
.El
.Sh USAGE
See
.Xr largefile 7
for the description of the behavior of
.Nm
when encountering files greater than or equal to 2 Gbyte
.Pq 2^31 bytes .
.Sh ENVIRONMENT VARIABLES
See
.Xr environ 7
for descriptions of the following environment variables that affect the
execution of
.Nm :
.Ev LANG ,
.Ev LC_ALL ,
.Ev LC_COLLATE ,
.Ev LC_CTYPE ,
.Ev LC_MESSAGES ,
and
.Ev NLSPATH .
.Pp
Affirmative responses are processed using the extended regular expression
defined for the
.Sy yesexpr
keyword in the
.Ev LC_MESSAGES
category of the user's locale.
The locale specified in the
.Ev LC_COLLATE
category defines the behavior of ranges, equivalence classes, and
multi-character collating elements used in the expression defined for
.Sy yesexpr .
The locale specified in
.Ev LC_CTYPE
determines the locale for interpretation of sequences of bytes of text data a
characters, the behavior of character classes used in the expression defined for
the
.Sy yesexpr .
See
.Xr locale 7 .
.Sh EXIT STATUS
The following exit values are returned:
.Bl -tag -width Ds
.It Sy 0
All input files were moved successfully.
.It Sy >0
An error occurred.
.El
.Sh INTERFACE STABILITY
.Sy Committed
.Sh CODE SET INDEPENDENCE
.Sy Enabled
.Sh SEE ALSO
.Xr cp 1 ,
.Xr cpio 1 ,
.Xr ln 1 ,
.Xr rm 1 ,
.Xr setfacl 1 ,
.Xr chmod 2 ,
.Xr attributes 7 ,
.Xr environ 7 ,
.Xr fsattr 7 ,
.Xr largefile 7 ,
.Xr standards 7
.Sh NOTES
A
.Fl Fl
permits the user to mark explicitly the end of any command line options,
allowing
.Nm
to recognize filename arguments that begin with a
.Fl .
As an aid to BSD migration,
.Nm
accepts
.Fl
as a synonym for
.Fl Fl .
This migration aid might disappear in a future release.
