/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 * Copyright (c) 2008, 2010, Oracle and/or its affiliates. All rights reserved.
 */

#ifndef	_SYS_IB_ADAPTERS_HERMON_HW_H
#define	_SYS_IB_ADAPTERS_HERMON_HW_H

/*
 * hermon_hw.h
 *    Contains all the structure definitions and #defines for all Hermon
 *    hardware resources and registers (as defined by the Hermon register
 *    specification).  Wherever possible, the names in the Hermon spec
 *    have been preserved in the structure and field names below.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

#ifdef __cplusplus
extern "C" {
#endif


/*
 * PCI IDs for supported chipsets
 */
#define	PCI_VENID_MLX		0x15b3
#define	PCI_DEVID_HERMON_SDR	0x6340	/* Mellanox MT25208-SDR PCIe Gen1 */
#define	PCI_DEVID_HERMON_DDR	0x634A	/* Mellanox MT25208-DDR PCIe Gen1 */
#define	PCI_DEVID_HERMON_DDRG2	0x6732	/* Mellanox MT25208-DDR PCIe Gen2 */
#define	PCI_DEVID_HERMON_QDRG2	0x673C	/* Mellanox MT25208-QDR PCIe Gen2 */
#define	PCI_DEVID_HERMON_QDRG2V	0x6746	/* Mellanox MT25208-QDR PCIe Gen2 */
#define	PCI_DEVID_HERMON_MAINT	0x0191  /* Maintenance/Mem Controller Mode */

/*
 * Native page size of the adapter
 */
#define	HERMON_PAGESIZE		0x1000	/* 4Kb */
#define	HERMON_PAGEOFFSET	(HERMON_PAGESIZE - 1)
#define	HERMON_PAGEMASK		(~HERMON_PAGEOFFSET)
#define	HERMON_PAGESHIFT	0xC		/* 12  */

/*
 * Offsets into the CMD BAR (BAR 0) for many of the more interesting hardware
 * registers.  These registers include the HCR (more below), and the software
 * reset register (SW_RESET).
 */
#define	HERMON_CMD_HCR_OFFSET		0x80680 /* PRM */
#define	HERMON_CMD_SW_RESET_OFFSET	0xF0010 /* PRM */
#define	HERMON_CMD_SW_SEMAPHORE_OFFSET	0xF03FC /* PRM */
#define	HERMON_CMD_OFFSET_MASK		0xFFFFF /* per MLX instruction */


/*
 * Ownership flags used to define hardware or software ownership for
 * various Hermon resources
 */
#define	HERMON_HW_OWNER			0x1
#define	HERMON_SW_OWNER			0x0

/*
 * Determines whether or not virtual-to-physical address translation is
 * required.  Several of the Hermon hardware structures can be optionally
 * accessed by Hermon without going through the TPT address translation
 * tables.
 */
#define	HERMON_VA2PA_XLAT_ENABLED	0x1
#define	HERMON_VA2PA_XLAT_DISABLED	0x0

/*
 * HCA Command Register (HCR)
 *    The HCR command interface provides privileged access to the HCA in
 *    order to query, configure and modify HCA execution.  It is the
 *    primary mechanism through which mailboxes may be posted to Hermon
 *    firmware.  To use this interface software fills the HCR with pointers
 *    to input and output mailboxes.  Some commands support immediate
 *    parameters, however, and for these commands the HCR will contain the
 *    input or output parameters. Command execution completion can be
 *    detected either by the software polling the HCR or by waiting for a
 *    command completion event.
 */
struct hermon_hw_hcr_s {
	uint32_t	in_param0;
	uint32_t	in_param1;
	uint32_t	input_modifier;
	uint32_t	out_param0;
	uint32_t	out_param1;
	uint32_t	token;
	uint32_t	cmd;
};
#define	HERMON_HCR_TOKEN_MASK		0xFFFF0000
#define	HERMON_HCR_TOKEN_SHIFT		16

#define	HERMON_HCR_CMD_STATUS_MASK	0xFF000000
#define	HERMON_HCR_CMD_GO_MASK		0x00800000
#define	HERMON_HCR_CMD_E_MASK		0x00400000
#define	HERMON_HCR_CMD_T_MASK		0x00200000
#define	HERMON_HCR_CMD_OPMOD_MASK	0x0000F000
#define	HERMON_HCR_CMD_OPCODE_MASK	0x00000FFF
#define	HERMON_HCR_CMD_STATUS_SHFT	24
#define	HERMON_HCR_CMD_GO_SHFT		23
#define	HERMON_HCR_CMD_E_SHFT		22
#define	HERMON_HCR_CMD_T_SHFT		21
#define	HERMON_HCR_CMD_OPMOD_SHFT	12

/*
 * Arbel/tavor "QUERY_DEV_LIM" == Hermon "QUERY_DEV_CAP" - Same hex code
 *    same function as tavor/arbel QUERY_DEV_LIM, just renamed (whatever).
 *    The QUERY_DEV_LIM command returns the device limits and capabilities
 *    supported by the Hermon device.  This command must be run before
 *    running the INIT_HCA command (below) in order to determine the maximum
 *    capabilities of the device and which optional features are supported.
 */
#ifdef  _LITTLE_ENDIAN
struct hermon_hw_querydevlim_s {
	uint32_t	rsrv0[4];

	uint32_t	log_max_scqs 	:4;
	uint32_t			:4;
	uint32_t	num_rsvd_scqs 	:6;
	uint32_t			:2;
	uint32_t	log_max_srq	:5;
	uint32_t			:7;
	uint32_t	log_rsvd_srq	:4;

	uint32_t	log_max_qp	:5;
	uint32_t			:3;
	uint32_t	log_rsvd_qp	:4;
	uint32_t			:4;
	uint32_t	log_max_qp_sz	:8;
	uint32_t	log_max_srq_sz	:8;

	uint32_t	log_max_eq	:4;
	uint32_t			:4;
	uint32_t	num_rsvd_eq	:4;
	uint32_t			:4;
	uint32_t	log_max_dmpt	:6;
	uint32_t			:2;
	uint32_t	log_max_eq_sz	:8;

	uint32_t	log_max_cq	:5;
	uint32_t			:3;
	uint32_t	log_rsvd_cq	:4;
	uint32_t			:4;
	uint32_t	log_max_cq_sz	:8;
	uint32_t			:8;


	uint32_t			:32;

	uint32_t	log_max_mtt	:6;
	uint32_t			:2;
	uint32_t	log_rsvd_dmpt	:4;
	uint32_t			:4;
	uint32_t	log_max_mrw_sz	:7;
	uint32_t			:5;
	uint32_t	log_rsvd_mtt	:4;

	uint32_t	log_max_ra_glob	:6;
	uint32_t			:2;
	uint32_t	log_max_rss_tbl_sz :4;
	uint32_t	rss_toep	:1;	/* rss toeplitz hashing */
	uint32_t	rss_xor		:1;	/* rss xor hashing */
	uint32_t			:2;
	uint32_t	log_max_gso_sz	:5;	/* Lge Send Offload */
	uint32_t			:11;	/* new w/ 0.35, RSS info */

	uint32_t	log_max_ra_res_qp	:6;
	uint32_t			:10;
	uint32_t	log_max_ra_req_qp	:6;
	uint32_t			:10;

	uint32_t	num_ports	:4;
	uint32_t			:12;
	uint32_t	ca_ack_delay	:5;
	uint32_t	cqmep		:3;	/* cq moderation policies */
	uint32_t			:4;
	uint32_t			:1;
	uint32_t			:3;

	uint32_t	mod_wr_srq	:1;	/* resize SRQ supported */
	uint32_t			:31;

	uint32_t			:16;
	uint32_t	stat_rate_sup	:16;

	uint32_t			:8;
	uint32_t			:4;
	uint32_t			:4;
	uint32_t			:8;
	uint32_t	log_max_msg	:5;
	uint32_t			:3;

	uint32_t	rc		:1;	/* 0x44 */
	uint32_t	uc		:1;
	uint32_t	ud		:1;
	uint32_t	xrc		:1;
	uint32_t	rcm		:1;
	uint32_t	fcoib		:1;
	uint32_t	srq		:1;
	uint32_t	ipoib_cksm	:1;
	uint32_t	pkey_v		:1;
	uint32_t	qkey_v		:1;
	uint32_t	vmm		:1;
	uint32_t	fcoe		:1;
	uint32_t	dpdp		:1;	/* dual port diff protocol */
	uint32_t	raw_etype	:1;
	uint32_t	raw_ipv4	:1;
	uint32_t	blh		:1;	/* big LSO header, bit in WQE */
	uint32_t	mem_win		:1;
	uint32_t	apm		:1;
	uint32_t	atomic		:1;
	uint32_t	raw_multi	:1;
	uint32_t	avp		:1;
	uint32_t	ud_multi	:1;
	uint32_t	udm_ipv4	:1;
	uint32_t	dif		:1;	/* DIF supported */
	uint32_t	pg_on_demand	:1;
	uint32_t	router		:1;
	uint32_t	l2mc		:1;	/* lev 2 enet multicast */
	uint32_t			:1;
	uint32_t	ud_swp		:1;	/* sw parse for UD xport */
	uint32_t	ipv6_ex		:1;	/* offload w/ IPV6 ext hdrs */
	uint32_t	lle		:1;	/* low latency enet */
	uint32_t	fcoe_t11	:1;	/* fcoenet T11 frame support */

						/* 0x40 */
	uint32_t	eth_uc_lb	:1;	/* enet unicast loopback */
	uint32_t			:3;
	uint32_t	hdr_split	:1;
	uint32_t	hdr_lookahead	:1;
	uint32_t			:2;
	uint32_t	rss_udp		:1;
	uint32_t			:7;
	uint32_t			:16;

	uint32_t	log_max_bf_page	:6;	/* 0x4c */
	uint32_t			:2;
	uint32_t	log_max_bf_req_ppg :6;
	uint32_t			:2;
	uint32_t	log_bf_reg_sz	:5;
	uint32_t			:10;
	uint32_t	blu_flm		:1;

	uint32_t	log_pg_sz	:8;	/* 0x48 */
	uint32_t			:8;
	uint32_t	log_max_uar_sz	:6;
	uint32_t			:6;
	uint32_t	num_rsvd_uar	:4;

	uint32_t	max_desc_sz_rq	:16;	/* 0x54 */
	uint32_t	max_sg_rq	:8;
	uint32_t			:8;

	uint32_t	max_desc_sz_sq	:16;	/* 0x50 */
	uint32_t	max_sg_sq	:8;
	uint32_t			:8;


	uint32_t	rsvd_fcoib;		/* 0x5C */

	uint32_t			:1;	/* 0x58 */
	uint32_t	fexch_base_mpt	:7;	/* FC exch base mpt num */
	uint32_t	fcp_ud_base_qp	:16;	/* RC UD base qp num */
	uint32_t	fexch_base_qp	:8;	/* FC exch base qp num */


	uint32_t	log_max_xrcd	:5;	/* 0x64 */
	uint32_t			:7;
	uint32_t	num_rsvd_xrcds	:4;
	uint32_t	log_max_pd	:5;
	uint32_t			:7;
	uint32_t	num_rsvd_pd	:4;

	uint32_t	log_max_mcg	:8;	/* 0x60 */
	uint32_t	num_rsvd_mcg	:4;
	uint32_t			:4;
	uint32_t	log_max_qp_mcg	:8;
	uint32_t			:8;

	uint32_t	rsrv2[6];

	uint32_t	altc_entry_sz	:16;	/* 0x84 */
	uint32_t	aux_entry_sz	:16;

	uint32_t	qpc_entry_sz	:16;	/* 0x80 */
	uint32_t	rdmardc_entry_sz :16;

	uint32_t	cmpt_entry_sz	:16;	/* 0x8C */
	uint32_t	srq_entry_sz	:16;

	uint32_t	cqc_entry_sz	:16;	/* 0x88 */
	uint32_t	eqc_entry_sz	:16;

	uint32_t	bmme		:1;	/* 0x94 */
	uint32_t	win_type	:1;
	uint32_t	mps		:1;
	uint32_t	bl		:1;
	uint32_t	zb		:1;
	uint32_t	lif		:1;
	uint32_t	local_inv	:1;
	uint32_t	remote_inv	:1;
	uint32_t			:1;
	uint32_t	win_type2	:1;
	uint32_t	reserved_lkey	:1;
	uint32_t	fast_reg_wr	:1;
	uint32_t			:20;

	uint32_t	dmpt_entry_sz	:16;	/* 0x90 */
	uint32_t	mtt_entry_sz	:16;

	uint32_t			:32;

	uint32_t	rsv_lkey;
						/* 0xA0 */
	uint64_t	max_icm_size;

	uint32_t	rsrv3[22];
};

#else		/* BIG ENDIAN */

struct hermon_hw_querydevlim_s {
	uint32_t	rsrv0[4];

	uint32_t	log_max_srq_sz	:8;
	uint32_t	log_max_qp_sz	:8;
	uint32_t			:4;
	uint32_t	log_rsvd_qp	:4;
	uint32_t			:3;
	uint32_t	log_max_qp	:5;

	uint32_t	log_rsvd_srq	:4;
	uint32_t			:7;
	uint32_t	log_max_srq	:5;
	uint32_t			:2;
	uint32_t	num_rsvd_scqs 	:6;
	uint32_t			:4;
	uint32_t	log_max_scqs 	:4;

	uint32_t			:8;
	uint32_t	log_max_cq_sz	:8;
	uint32_t			:4;
	uint32_t	log_rsvd_cq	:4;
	uint32_t			:3;
	uint32_t	log_max_cq	:5;

	uint32_t	log_max_eq_sz	:8;
	uint32_t			:2;
	uint32_t	log_max_dmpt	:6;
	uint32_t			:4;
	uint32_t	num_rsvd_eq	:4;
	uint32_t			:4;
	uint32_t	log_max_eq	:4;

	uint32_t	log_rsvd_mtt	:4;
	uint32_t			:5;
	uint32_t	log_max_mrw_sz	:7;
	uint32_t			:4;
	uint32_t	log_rsvd_dmpt	:4;
	uint32_t			:2;
	uint32_t	log_max_mtt	:6;

	uint32_t			:32;

	uint32_t			:10;
	uint32_t	log_max_ra_req_qp	:6;
	uint32_t			:10;
	uint32_t	log_max_ra_res_qp	:6;

	uint32_t			:11;	/* new w/ 0.35, RSS info */
	uint32_t	log_max_gso_sz	:5;	/* Lge Send Offload */
	uint32_t			:2;
	uint32_t	rss_xor		:1;	/* rss xor hashing */
	uint32_t	rss_toep	:1;	/* rss toeplitz hashing */
	uint32_t	log_max_rss_tbl_sz :4;
	uint32_t			:2;
	uint32_t	log_max_ra_glob	:6;

	uint32_t			:31;
	uint32_t	mod_wr_srq	:1;	/* resize SRQ supported */

	uint32_t			:3;
	uint32_t			:1;
	uint32_t			:4;
	uint32_t	cqmep		:3;	/* cq moderation policies */
	uint32_t	ca_ack_delay	:5;
	uint32_t			:12;
	uint32_t	num_ports	:4;

	uint32_t			:3;
	uint32_t	log_max_msg	:5;
	uint32_t			:8;
	uint32_t			:4;
	uint32_t			:4;
	uint32_t			:8;

	uint32_t	stat_rate_sup	:16;
	uint32_t			:16;

	uint32_t			:16;	/* 0x40 */
	uint32_t			:7;
	uint32_t	rss_udp		:1;
	uint32_t			:2;
	uint32_t	hdr_lookahead	:1;
	uint32_t	hdr_split	:1;
	uint32_t			:3;
	uint32_t	eth_uc_lb	:1;	/* enet unicast loopback */
						/* 0x44 */
	uint32_t	fcoe_t11	:1;	/* fcoenet T11 frame support */
	uint32_t	lle		:1;	/* low latency enet */
	uint32_t	ipv6_ex		:1;	/* offload w/ IPV6 ext hdrs */
	uint32_t	ud_swp		:1;	/* sw parse for UD xport */
	uint32_t			:1;
	uint32_t	l2mc		:1;	/* lev 2 enet multicast */
	uint32_t	router		:1;
	uint32_t	pg_on_demand	:1;
	uint32_t	dif		:1;	/* DIF supported */
	uint32_t	udm_ipv4	:1;
	uint32_t	ud_multi	:1;
	uint32_t	avp		:1;
	uint32_t	raw_multi	:1;
	uint32_t	atomic		:1;
	uint32_t	apm		:1;
	uint32_t	mem_win		:1;
	uint32_t	blh		:1;	/* big LSO header, bit in WQE */
	uint32_t	raw_ipv4	:1;
	uint32_t	raw_etype	:1;
	uint32_t	dpdp		:1;	/* dual port diff protocol */
	uint32_t	fcoe		:1;
	uint32_t	vmm		:1;
	uint32_t	qkey_v		:1;
	uint32_t	pkey_v		:1;
	uint32_t	ipoib_cksm	:1;
	uint32_t	srq		:1;
	uint32_t	fcoib		:1;
	uint32_t	rcm		:1;
	uint32_t	xrc		:1;
	uint32_t	ud		:1;
	uint32_t	uc		:1;
	uint32_t	rc		:1;

	uint32_t	num_rsvd_uar	:4;	/* 0x48 */
	uint32_t			:6;
	uint32_t	log_max_uar_sz	:6;
	uint32_t			:8;
	uint32_t	log_pg_sz	:8;

	uint32_t	blu_flm		:1;	/* 0x4c */
	uint32_t			:10;
	uint32_t	log_bf_reg_sz	:5;
	uint32_t			:2;
	uint32_t	log_max_bf_req_ppg :6;
	uint32_t			:2;
	uint32_t	log_max_bf_page	:6;

	uint32_t			:8;	/* 0x50 */
	uint32_t	max_sg_sq	:8;
	uint32_t	max_desc_sz_sq	:16;

	uint32_t			:8;	/* 0x54 */
	uint32_t	max_sg_rq	:8;
	uint32_t	max_desc_sz_rq	:16;

						/* 0x58 */
	uint32_t	fexch_base_qp	:8;	/* FC exch base qp num */
	uint32_t	fcp_ud_base_qp	:16;	/* RC UD base qp num */
	uint32_t	fexch_base_mpt	:7;	/* FC exch base mpt num */
	uint32_t			:1;

	uint32_t	rsvd_fcoib;		/* 0x5C */

	uint32_t			:8;	/* 0x60 */
	uint32_t	log_max_qp_mcg	:8;
	uint32_t			:4;
	uint32_t	num_rsvd_mcg	:4;
	uint32_t	log_max_mcg	:8;

	uint32_t	num_rsvd_pd	:4;	/* 0x64 */
	uint32_t			:7;
	uint32_t	log_max_pd	:5;
	uint32_t	num_rsvd_xrcds	:4;
	uint32_t			:7;
	uint32_t	log_max_xrcd	:5;

	uint32_t	rsrv2[6];

	uint32_t	rdmardc_entry_sz :16;	/* 0x80 */
	uint32_t	qpc_entry_sz	:16;

	uint32_t	aux_entry_sz	:16;	/* 0x84 */
	uint32_t	altc_entry_sz	:16;

	uint32_t	eqc_entry_sz	:16;	/* 0x88 */
	uint32_t	cqc_entry_sz	:16;

	uint32_t	srq_entry_sz	:16;	/* 0x8C */
	uint32_t	cmpt_entry_sz	:16;

	uint32_t	mtt_entry_sz	:16;	/* 0x90 */
	uint32_t	dmpt_entry_sz	:16;

	uint32_t			:20;	/* 0x94 */
	uint32_t	fast_reg_wr	:1;
	uint32_t	reserved_lkey	:1;
	uint32_t	win_type2	:1;
	uint32_t			:1;
	uint32_t	remote_inv	:1;
	uint32_t	local_inv	:1;
	uint32_t	lif		:1;
	uint32_t	zb		:1;
	uint32_t	bl		:1;
	uint32_t	mps		:1;
	uint32_t	win_type	:1;
	uint32_t	bmme		:1;

	uint32_t	rsv_lkey;

	uint32_t			:32;

	uint64_t	max_icm_size;
						/* 0xA0 */
	uint32_t	rsrv3[22];
};
#endif



/*
 * Hermon "QUERY_FW" command
 *    The QUERY_FW command retrieves the firmware revision and the Command
 *    Interface revision.  The command also returns the HCA attached local
 *    memory area (DDR) which is used by the firmware.  Below we also
 *    include some defines which are used to enforce a minimum firmware
 *    version check (see hermon_fw_version_check() for more details).
 */

#ifdef	_LITTLE_ENDIAN
struct hermon_hw_queryfw_s {
	uint32_t	fw_rev_minor	:16;
	uint32_t	fw_rev_subminor	:16;

	uint32_t	fw_rev_major	:16;
	uint32_t	fw_pages	:16;

	uint32_t	log_max_cmd	:8;
	uint32_t			:23;
	uint32_t	dbg_trace	:1;

	uint32_t	cmd_intf_rev	:16;
	uint32_t			:16;

	uint32_t	fw_day		:8;
	uint32_t	fw_month	:8;
	uint32_t	fw_year		:16;

	uint32_t			:1;
	uint32_t	ccq		:1;	/* currently not def'd */
	uint32_t			:6;
	uint32_t	fw_sec		:8;
	uint32_t	fw_min		:8;
	uint32_t	fw_hour		:8;

	uint32_t	rsrv0[2];

	uint64_t	clr_intr_offs;

	uint32_t			:32;

	uint32_t			:30;
	uint32_t	clr_int_bar	:2;

	uint64_t	error_buf_addr;

	uint32_t			:30;
	uint32_t	err_buf_bar	:2;

	uint32_t	error_buf_sz;

	uint64_t	vf_com_ch_addr;

	uint32_t			:32;

	uint32_t			:30;
	uint32_t	vf_com_ch_bar	:2;

	uint32_t	rsrv2[44];
};
#else	/* BIG ENDIAN */
struct hermon_hw_queryfw_s {
	uint32_t	fw_pages	:16;
	uint32_t	fw_rev_major	:16;

	uint32_t	fw_rev_subminor	:16;
	uint32_t	fw_rev_minor	:16;

	uint32_t			:16;
	uint32_t	cmd_intf_rev	:16;

	uint32_t	dbg_trace	:1;
	uint32_t			:23;
	uint32_t	log_max_cmd	:8;

	uint32_t	fw_hour		:8;
	uint32_t	fw_min		:8;
	uint32_t	fw_sec		:8;
	uint32_t			:6;
	uint32_t	ccq		:1;	/* currently not def'd */
	uint32_t			:1;

	uint32_t	fw_year		:16;
	uint32_t	fw_month	:8;
	uint32_t	fw_day		:8;

	uint32_t	rsrv1[2];

	uint64_t	clr_intr_offs;

	uint32_t	clr_int_bar	:2;
	uint32_t			:30;

	uint32_t			:32;

	uint64_t	error_buf_addr;

	uint32_t	error_buf_sz;

	uint32_t	err_buf_bar	:2;
	uint32_t			:30;

	uint64_t	vf_com_ch_addr;

	uint32_t	vf_com_ch_bar	:2;
	uint32_t			:30;

	uint32_t			:32;

	uint32_t	rsrv2[44];
};
#endif

/*
 * 2.6.000 is critical for some performance features, e.g., Reserved_Lkey,
 * and 2.7.000 is needed for FRWR and FCoIB.  Requiring 2.6.000 now so that
 * existing customers get the performance, but are not required to upgrade
 * to the latest.  Less than 2.6.000 will cause the driver to attach in
 * maintenance mode, and throw an FMA event about upgrading the firmware.
 */

#define	HERMON_FW_VER_MAJOR		0x0002
#define	HERMON_FW_VER_MINOR		0x0006
#define	HERMON_FW_VER_SUBMINOR		0x0000

/*
 * Hermon "QUERY_ADAPTER" command
 *    The QUERY_ADAPTER command retrieves adapter specific parameters. The
 *    command also retrieves the PCI(X) interrupt pin routing for each of
 *    the INTx# pins supported by the device.  This information is used by
 *    the driver during interrupt processing in order to clear the appropriate
 *    interrupt bit.
 */
#ifdef	_LITTLE_ENDIAN
struct hermon_hw_queryadapter_s {
	uint32_t	rsrv0[4];

	uint32_t			:32;

	uint32_t			:24;
	uint32_t	inta_pin	:8;

	uint32_t	vsd_vend_id	:16;		/* added v35 hermon */
	uint32_t			:16;

	uint32_t			:32;

	uint32_t	vsd[52];
	uint32_t	psid[4];
};
#else
struct hermon_hw_queryadapter_s {
	uint32_t	rsrv0[4];

	uint32_t	inta_pin	:8;
	uint32_t			:24;

	uint32_t			:32;

	uint32_t			:32;

	uint32_t			:16;
	uint32_t	vsd_vend_id	:16;		/* added v35 hermon */

	uint32_t	vsd[52];
	uint32_t	psid[4];
};
#endif
#define	HERMON_REV_A0	0xA0
#define	HERMON_REV_A1	0xA1

/*
 * Virtual physical mapping structure for: MAP_FA, MAP_ICM_AUX, and
 * MAP_ICM commands.
 */

#ifdef	_LITTLE_ENDIAN
struct hermon_hw_vpm_s {
	uint32_t			:12;
	uint32_t	vaddr_l		:20;

	uint32_t	vaddr_h;

	uint32_t	log2sz		:5;	/* in 4KB pages */
	uint32_t			:7;
	uint32_t	paddr_l		:20;

	uint32_t	paddr_h;
};
#else
struct hermon_hw_vpm_s {
	uint32_t	vaddr_h;

	uint32_t	vaddr_l		:20;
	uint32_t			:12;

	uint32_t	paddr_h;

	uint32_t	paddr_l		:20;
	uint32_t			:7;
	uint32_t	log2sz		:5;	/* in 4KB pages */
};
#endif




/*
 * Hermon "INIT_HCA" and "QUERY_HCA" commands
 *    The INIT_HCA command configures all HCA resources in HCA attached local
 *    memory and some system relevant information.  The same mailbox output
 *    format is used by the QUERY_HCA command.  All parameters, which are
 *    specifically the output of the QUERY_HCA command are marked as
 *    "QUERY_HCA only".  These parameters are not configurable through the
 *    INIT_HCA command, but can be retrieved as read-only through the
 *    QUERY_HCA command.
 *
 *    Below we first define several structures which help make up the whole
 *    of the INIT_HCA/QUERY_HCA command.  These are:
 *    hermon_hw_qp_ee_cq_eq_rdb_t for "QPC/EEC/CQC/EQC/RDB Parameters",
 *    hermon_udav_mem_param_t for "Memory Access Parameters for UDAV Table",
 *    hermon_multicast_param_t for "Multicast Support Parameters",
 *    hermon_tpt_param_t for "Translation and Protection Table Parameters",
 *    and hermon_uar_param_t for Hermon "UAR Parameters".
 */

/*
 *  need to consider removing any ref to "ee", hermon doesn't support
 *       ee/rd stuff, and they've taken away the pretense
 */


#ifdef	_LITTLE_ENDIAN
typedef struct hermon_hw_qp_ee_cq_eq_rdb_s {
	uint32_t	rsrv0[4];

	uint32_t	log_num_qp	:5;
	uint32_t	qpc_baseaddr_l	:27;
	uint32_t	qpc_baseaddr_h;

	uint32_t	rsrv1[4];

	uint32_t	log_num_srq	:5;
	uint32_t	srqc_baseaddr_l	:27;
	uint32_t	srqc_baseaddr_h;

	uint32_t	log_num_cq	:5;
	uint32_t	cqc_baseaddr_l	:27;
	uint32_t	cqc_baseaddr_h;

	uint32_t	rsrv2[2];

	uint64_t	altc_baseaddr;

	uint32_t	rsrv3[2];

	uint64_t	auxc_baseaddr;

	uint32_t	rsrv4[2];

	uint32_t	log_num_eq	:5;
	uint32_t	eqc_baseaddr_l	:27;
	uint32_t	eqc_baseaddr_h;

	uint32_t	rsv5[2];

	uint32_t	log_num_rdmardc	:3;
	uint32_t			:2;
	uint32_t	rdmardc_baseaddr_l :27;
	uint32_t	rdmardc_baseaddr_h;

	uint32_t	rsrv6[2];
} hermon_hw_qp_ee_cq_eq_rdb_t;
#else	/* BIG ENDIAN */
typedef struct hermon_hw_qp_ee_cq_eq_rdb_s {
	uint32_t	rsrv0[4];

	uint32_t	qpc_baseaddr_h;
	uint32_t	qpc_baseaddr_l	:27;
	uint32_t	log_num_qp	:5;

	uint32_t	rsrv1[4];

	uint32_t	srqc_baseaddr_h;
	uint32_t	srqc_baseaddr_l	:27;
	uint32_t	log_num_srq	:5;

	uint32_t	cqc_baseaddr_h;
	uint32_t	cqc_baseaddr_l	:27;
	uint32_t	log_num_cq	:5;

	uint32_t	rsrv2[2];

	uint64_t	altc_baseaddr;

	uint32_t	rsrv3[2];

	uint64_t	auxc_baseaddr;

	uint32_t	rsrv4[2];

	uint32_t	eqc_baseaddr_h;
	uint32_t	eqc_baseaddr_l	:27;
	uint32_t	log_num_eq	:5;

	uint32_t	rsv5[2];

	uint32_t	rdmardc_baseaddr_h;
	uint32_t	rdmardc_baseaddr_l :27;
	uint32_t			:2;
	uint32_t	log_num_rdmardc	:3;

	uint32_t	rsrv6[2];
} hermon_hw_qp_ee_cq_eq_rdb_t;
#endif




#ifdef	_LITTLE_ENDIAN
typedef struct hermon_multicast_param_s {
	uint64_t	mc_baseaddr;

	uint32_t	rsrv0[2];

	uint32_t	log_mc_tbl_hash_sz :5;
	uint32_t			:27;

	uint32_t	log_mc_tbl_ent	:5;
	uint32_t			:27;

	uint32_t			:32;

	uint32_t	log_mc_tbl_sz	:5;
	uint32_t			:19;
	uint32_t	mc_hash_fn	:3;
	uint32_t			:5;
} hermon_multicast_param_t;
#else	/* BIG ENDIAN */
typedef struct hermon_multicast_param_s {
	uint64_t	mc_baseaddr;

	uint32_t	rsrv0[2];

	uint32_t			:27;
	uint32_t	log_mc_tbl_ent	:5;

	uint32_t			:27;
	uint32_t	log_mc_tbl_hash_sz :5;

	uint32_t			:5;
	uint32_t	mc_hash_fn	:3;
	uint32_t			:19;
	uint32_t	log_mc_tbl_sz	:5;

	uint32_t			:32;
} hermon_multicast_param_t;
#endif

#define	HERMON_MCG_DEFAULT_HASH_FN	0x0

#ifdef	_LITTLE_ENDIAN
typedef struct hermon_tpt_param_s {
	uint64_t	dmpt_baseaddr;

	uint32_t			:32;

	uint32_t	log_dmpt_sz	:6;
	uint32_t			:2;
	uint32_t	pgfault_rnr_to	:5;
	uint32_t			:19;

	uint64_t	mtt_baseaddr;

	uint64_t	cmpt_baseaddr;
} hermon_tpt_param_t;
#else	/* BIG ENDIAN */
typedef struct hermon_tpt_param_s {
	uint64_t	dmpt_baseaddr;

	uint32_t			:19;
	uint32_t	pgfault_rnr_to	:5;
	uint32_t			:2;
	uint32_t	log_dmpt_sz	:6;

	uint32_t			:32;

	uint64_t	mtt_baseaddr;

	uint64_t	cmpt_baseaddr;
} hermon_tpt_param_t;
#endif


#ifdef	_LITTLE_ENDIAN
typedef struct hermon_uar_param_s {
	uint32_t	rsvd0[2];

	uint32_t			:32;

	uint32_t	uar_pg_sz	:8;
	uint32_t	log_max_uars	:4;
	uint32_t			:20;

	uint32_t	resvd1[4];
} hermon_uar_param_t;
#else
typedef struct hermon_uar_param_s {
	uint32_t	rsvd0[2];

	uint32_t			:20;
	uint32_t	log_max_uars	:4;
	uint32_t	uar_pg_sz	:8;

	uint32_t			:32;

	uint32_t	resvd1[4];
} hermon_uar_param_t;
#endif

/*
 * NEW for Hermon
 *   QP Allocation Params
 *	NOTE:  	as of PRM v0.50 no longer needed (ccq not supported
 *		leave structure here, just in case ccq comes back )
 *		but adjust the overall structure
 *		not to use it
 *
 */

#ifdef _LITTLE_ENDIAN
typedef struct hermon_qp_alloc_param_s {
	uint32_t			:32;

	uint32_t	ccq_base	:24;
	uint32_t	log2ccqs	:5;
	uint32_t			:2;
	uint32_t	ccq_en	:1;

	uint32_t	rsvd[6];	/* but 0x14 def'd for fibre channel */
} hermon_qp_alloc_param_t;
#else /* BIG ENDIAN */
typedef struct hermon_qp_alloc_param_s {
	uint32_t	ccq_en		:1;
	uint32_t			:2;
	uint32_t	log2ccqs	:5;
	uint32_t	ccq_base	:24;

	uint32_t			:32;

	uint32_t	rsvd[6];	/* but 0x14 def'd for fibre channel */
} hermon_qp_alloc_param_t;
#endif


#ifdef	_LITTLE_ENDIAN
struct hermon_hw_initqueryhca_s {
	uint32_t			:32;

	uint32_t			:24;
	uint32_t	version		:8;

	uint32_t			:13;
	uint32_t	log2_cacheline  :3;
	uint32_t	hca_core_clock	:16;	/* QUERY_HCA only */

	uint32_t			:32;

	uint32_t	udav_port_chk	:1;
	uint32_t	big_endian	:1;
	uint32_t	qos		:1;
	uint32_t	chsum_en	:1;
	uint32_t			:12;
	uint32_t	cqpm_short_pkt_lim :14; /* short pkt limit for qpm */
	uint32_t	cqmp		:2;	/* cq moderation policy */

	uint32_t	router_qp	:24;
	uint32_t			:5;
	uint32_t	ipr2		:1;
	uint32_t	ipr1		:1;
	uint32_t	router_en	:1;

	uint32_t	rsrv1[2];

	hermon_hw_qp_ee_cq_eq_rdb_t	context;

	uint32_t	rsrv2[8];

	hermon_multicast_param_t	multi;

	uint32_t	rsrv3[4];

	hermon_tpt_param_t		tpt;

	uint32_t	rsrv4[4];

	hermon_uar_param_t		uar;

	uint32_t	rsrv5[36];

	hermon_multicast_param_t	enet_multi;

	uint32_t	rsrv6[24];		/* to 0x24C */

	uint32_t			:32;

	uint32_t	fcoe_t11	:1;	/* fcoe t11 frame enable */
	uint32_t			:31;

	uint32_t	rsrv7[42];		/* 0x254 - 0x2FC */
};
#else	/* BIG ENDIAN */
struct hermon_hw_initqueryhca_s {
	uint32_t	version		:8;
	uint32_t			:24;

	uint32_t			:32;

	uint32_t			:32;

	uint32_t	hca_core_clock	:16;	/* QUERY_HCA only */
	uint32_t	log2_cacheline	:3;
	uint32_t			:13;

	uint32_t	router_en	:1;
	uint32_t	ipr1		:1;
	uint32_t	ipr2		:1;
	uint32_t			:5;
	uint32_t	router_qp	:24;

	uint32_t	cqmp		:2;	/* cq moderation policy */
	uint32_t	cqpm_short_pkt_lim :14; /* short pkt limit for qpm */
	uint32_t			:12;
	uint32_t	chsum_en	:1;
	uint32_t	qos		:1;
	uint32_t	big_endian	:1;
	uint32_t	udav_port_chk	:1;

	uint32_t	rsrv1[2];

	hermon_hw_qp_ee_cq_eq_rdb_t	context;

	uint32_t	rsrv2[8];

	hermon_multicast_param_t	multi;

	uint32_t	rsrv3[4];

	hermon_tpt_param_t		tpt;

	uint32_t	rsrv4[4];

	hermon_uar_param_t		uar;

	uint32_t	rsrv5[36];

	hermon_multicast_param_t	enet_multi;

	uint32_t	rsrv6[24];		/* to 0x24C */

	uint32_t			:31;
	uint32_t	fcoe_t11	:1;	/* fcoe t11 frame enable */

	uint32_t			:32;

	uint32_t	rsrv7[42];		/* 0x254 - 0x2FC */
};
#endif
#define	HERMON_UDAV_PROTECT_DISABLED	0x0
#define	HERMON_UDAV_PROTECT_ENABLED	0x1
#define	HERMON_UDAV_PORTCHK_DISABLED	0x0
#define	HERMON_UDAV_PORTCHK_ENABLED	0x1


/*
 * Hermon "INIT_IB"/"INIT_PORT" command
 *    The INIT_IB/INIT_PORT command enables the physical layer of an IB port.
 *    It provides control over the IB port attributes.  The capabilities
 *    requested here should not exceed the device limits, as retrieved by
 *    the QUERY_DEV_LIM/CAP command (above).  To query information about the IB
 *    port or node, the driver may submit GetPortInfo or GetNodeInfo MADs
 *    through the Hermon MAD_IFC command.
 *
 *	Changed name to initport, but operates similar to initib - but as of
 *	PRM v0.35c the initport just does that, and the params set previously
 *	by initib are now set in SET_PORT
 */




/*
 * HERMON query_port and set_port commands.  QUERY_PORT is new for hermon,
 *	doing some of what used to be done in the QUERY_DEV_CAP command.  It is
 *	introduced in PRM v0.35 and will need to be added to the list of
 *	supported HCA commands
 *
 *	SET_PORT is similar to the SET_IB command from tavor and arbel.  Here,
 *	tho, it's more extensive and will be easier to deal with I suspect by
 * 	making it a structure and filling it in and then doing the copy to the
 *	mailbox (instead of just writing the minimal information to the mailbox
 *	directly as was done for the previous HCAs).
 */

/*
 * 	PRM 0.4X and 0.50 changed the query_port to integrate the ethernet
 *	stuff as well, so this is a signficant change to the structure
 */

#ifdef _LITTLE_ENDIAN
struct hermon_hw_query_port_s {
						/* 0x04 */
	uint32_t	log_max_pkey 	:4;	/* pkey table size */
	uint32_t	log_max_gid	:4;	/* max gids / port */
	uint32_t	ib_port_wid	:8;
	/*
	 * Enet link speed - 0x0 10Gb XAUI, 0x01 10Gb XFI,
	 *	0x02 1Gb, 0xF other
	 */
	uint32_t	eth_link_spd	:4;
	uint32_t			:4;
	/*
	 * IB Link speed - bit 0 SDR, bit1 DDR, Bit 2 QDR
	 */
	uint32_t	ib_link_spd	:8;

						/* 0x00 */
	uint32_t	eth_mtu		:16;	/* in bytes */
	/*
	 * IB MTU - 0x0 rsvd, 0x1=256, 0x2=512, 0x3=1024, 0x4=2048, 0x5=4096
	 */
	uint32_t	ib_mtu		:4;
	uint32_t			:4;
	/*
	 * for next two if link down
	 * -> what port supports, if up
	 * -> what port is running
	 */

	uint32_t	ib_link		:1;
	uint32_t	eth_link	:1;
	uint32_t			:1;
	uint32_t	vpi		:1;
	uint32_t			:3;
	uint32_t	link_up		:1;


	uint32_t			:32;	/* 0x0C */

	/* max vl's supported (not incl vl_15) */
	uint32_t	max_vl		:4;	/* 0x08 */
	uint32_t			:4;
	uint32_t	log_max_mac	:4;
	uint32_t	log_max_vlan	:4;
	uint32_t			:16;

	uint32_t	mac_lo;

	uint32_t	mac_hi		:16;
	uint32_t			:16;

	uint32_t	rsvd1[2];
};

#else /* BIG ENDIAN */
struct hermon_hw_query_port_s {
						/* 0x00 */
	uint32_t	link_up		:1;
	uint32_t			:3;
	uint32_t	vpi		:1;
	uint32_t			:1;
	/*
	 * for next two if link down
	 * -> what port supports, if up
	 * -> what port is running
	 */
	uint32_t	eth_link	:1;
	uint32_t	ib_link		:1;
	uint32_t			:4;
	/*
	 * IB MTU - 0x0 rsvd, 0x1=256, 0x2=512, 0x3=1024, 0x4=2048, 0x5=4096
	 */
	uint32_t	ib_mtu		:4;
	uint32_t	eth_mtu		:16;	/* in bytes */

						/* 0x04 */
	/*
	 * IB Link speed - bit 0 SDR, bit1 DDR, Bit 2 QDR
	 */
	uint32_t	ib_link_spd	:8;
	uint32_t			:4;
	/*
	 * Enet link speed - 0x0 10Gb XAUI, 0x01 10Gb XFI,
	 *	0x02 1Gb, 0xF other
	 */
	uint32_t	eth_link_spd	:4;
	uint32_t	ib_port_wid	:8;
	uint32_t	log_max_gid	:4;	/* max gids / port */
	uint32_t	log_max_pkey 	:4;	/* pkey table size */

	uint32_t			:16;	/* 0x08 */
	uint32_t	log_max_vlan	:4;
	uint32_t	log_max_mac	:4;
	uint32_t			:4;
	/* max vl's supported (not incl vl_15) */
	uint32_t	max_vl		:4;

	uint32_t			:32;	/* 0x0C */

	uint32_t			:16;
	uint32_t	mac_hi		:16;

	uint32_t	mac_lo;

	uint32_t	rsvd1[2];

};
#endif

/*
 * the following structure is used for IB set port
 *	others following are for ethernet set port
 */

#define	HERMON_HW_OPMOD_SETPORT_IB	0x0
#define	HERMON_HW_OPMOD_SETPORT_EN	0x1
#define	HERMON_HW_OPMOD_SETPORT_EXT	0x2


#ifdef _LITTLE_ENDIAN
struct hermon_hw_set_port_s {
	uint32_t	cap_mask;

	uint32_t	rqk		:1;	/* reset qkey violation cntr */
	uint32_t	rcm		:1;	/* reset capability mask */
	uint32_t			:2;
	uint32_t	vl_cap		:4;
	uint32_t			:4;
	uint32_t	mtu_cap		:4;
	uint32_t	g0		:1;	/* set port GUID0 */
	uint32_t	ng		:1;	/* set node GUID (all ports) */
	uint32_t	sig		:1;	/* set sys image */
	uint32_t	mg		:1;	/* change GID table */
	uint32_t	mp		:1;	/* change pkey table size */
	uint32_t	mvc		:1;	/* change vl_cap */
	uint32_t	mmc		:1;	/* change mtu_cap */
	uint32_t			:9;

	uint64_t	sys_img_guid;

	uint64_t	guid0;

	uint64_t	node_guid;

