illumos/illumos-gate/usr/src/man/man7/ad.7
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH AD 7 "May 23, 2021"
.SH NAME
ad \- Active Directory as a naming repository
.SH DESCRIPTION
Solaris clients can obtain naming information from Active Directory (AD)
servers.
.sp
.LP
The Solaris system must first join an AD domain and then add the \fBad\fR
keyword to the appropriate entries in the \fBnsswitch.conf\fR(5) file. The
Solaris system joins the AD domain by using the  \fBkclient\fR(8) utility. The
AD name service only supports the naming databases for \fBpasswd\fR and
\fBgroup\fR.
.sp
.LP
Windows users are not able to log in. The \fBuser_attr\fR(5) database has no
entries for Windows users, and the \fBpasswd\fR(1) command does not support the
synchronization of user passwords with AD.
.sp
.LP
The Solaris AD client uses auto-discovery techniques to find AD directory
servers, such as domain controllers and global catalog servers. The client also
uses the LDAP v3 protocol to access naming information from AD servers. The AD
server schema requires no modification because the AD client works with native
AD schema. The Solaris AD client uses the \fBidmap\fR(8) service to map
between Windows security identifiers (SIDs) and Solaris user identifiers (UIDs)
and group identifiers (GIDs). User names and group names are taken from the
\fBsAMAccountName\fR attribute of the AD user and group objects and then tagged
with the domain where the objects reside. The domain name is separated from the
user name or group name by the \fB@\fR character.
.sp
.LP
The client uses the SASL/GSSAPI/KRB5 security model. The \fBkclient\fR utility
is used to join the client to AD. During the join operation, \fBkclient\fR
configures Kerberos v5 on the client. See \fBkclient\fR(8).
.SH FILES
.ne 2
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 24n
Configuration file for the name-service switch.
.RE

.sp
.ne 2
.na
\fB\fB/etc/nsswitch.ad\fR\fR
.ad
.RS 24n
Sample configuration file for the name-service switch configured with ad, dns
and files.
.RE

.sp
.ne 2
.na
\fB\fB/usr/lib/nss_ad.so.1\fR\fR
.ad
.RS 24n
Name service switch module for AD.
.RE

.SH SEE ALSO
.BR passwd (1),
.BR svcs (1),
.BR nsswitch.conf (5),
.BR user_attr (5),
.BR smf (7),
.BR idmap (8),
.BR idmapd (8),
.BR kclient (8),
.BR svcadm (8),
.BR svccfg (8)
