illumos/illumos-gate/usr/src/man/man7/brands.7
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing. See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH BRANDS 7 "May 23, 2021"
.SH NAME
brands \- alternate operating environments for non-global zones
.SH DESCRIPTION
The branded zone (BrandZ) framework extends the Solaris Zones infrastructure
described in \fBzones\fR(7) to include the creation of brands, which provide
non-global zones that contain non-native operating environments.
.sp
.LP
The term "brand" can refer to a wide range of operating environments. All brand
management is performed as extensions to the current zones structure.
.sp
.LP
Every zone is configured with an associated brand. The brand type is used to
determine which scripts are executed when a zone is installed and booted. In
addition, a zone's brand is used to properly identify the correct application
type at application launch time.  The default brand is determined by the
installed distribution in the global zone.
.sp
.LP
A branded zone will support exactly one brand of non-native binary, which means
that a branded zone provides a single operating environment. Once a zone has
been assigned a brand, that brand cannot be changed or removed.
.sp
.LP
BrandZ extends the zones tools in the following ways:
.RS +4
.TP
.ie t \(bu
.el o
A brand is an attribute of a zone, set at zone create time.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The zonecfg tool (see \fBzonecfg\fR(8)) is used to set a zone's brand type and
configure the zone.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The zoneadm tool (see \fBzoneadm\fR(8)) is used to report a zone's brand type
and administer the zone.
.RE
.SS "Device Support"
The devices supported by each zone are documented in the man pages and other
documentation for that brand. The zones infrastructure detects any attempt to
add an unsupported device and issues a warning to the administrator. If the
administrator chooses to add an unsupported device despite that warning, that
device might or might not work as expected. The configuration will be untested
and unsupported.
.SH ATTRIBUTES
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.BR attributes (7),
.BR zones (7),
.BR zoneadm (8),
.BR zonecfg (8)
