illumos/illumos-gate/usr/src/man/man7/dhcp.7
'\" te
.\" Copyright 2014 Garrett D'Amore <garrett@damore.org>
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DHCP 7 "Feb 13, 2020"
.SH NAME
dhcp \- Dynamic Host Configuration Protocol
.SH DESCRIPTION
Dynamic Host Configuration Protocol (\fBDHCP\fR) enables host systems in a
\fBTCP/IP\fR network to be configured automatically for the network as they
boot. \fBDHCP\fR uses a client/server mechanism: servers store configuration
information for clients, and provide that information upon a client's request.
The information can include the client's \fBIP\fR address and information about
network services available to the client.
.LP
This manual page provides a brief summary of the \fBDHCP\fR
implementation.
.SS "DHCP Client"
The DHCP client is implemented as background daemon,
\fBdhcpagent\fR(8).
.LP
For IPv4, this daemon is started automatically during bootup if there exists at
least one \fBdhcp.\fR\fIinterface\fR file in \fB/etc\fR. Only interfaces with a
corresponding \fB\fR\fB/etc/dhcp.\fR\fB\fIinterface\fR\fR file are
automatically configured during boot.
.LP
For IPv6, this daemon is started automatically when commanded by \fBin.ndpd\fR
(based on IPv6 Routing Advertisement messages). No
\fB/etc/dhcp\fR.\fIinterface\fR file is necessary, but such a file can be used
to specify an interface as "primary," provided that IPv4 DHCP is also in use.
.LP
Network parameters needed for system configuration during bootup are extracted
from the information received by the daemon through the use of the
\fBdhcpinfo\fR(1) command. The daemon's default behavior can be altered by
changing the tunables in the \fB/etc/default/dhcpagent\fR file. The daemon is
controlled by the \fBifconfig\fR(8) utility. Check the status of the daemon
using the \fBnetstat\fR(8) and \fBifconfig\fR(8) commands.
.SH SEE ALSO
.BR dhcpinfo (1),
.BR syslog (3C),
.BR dhcp_inittab (5),
.BR ndpd.conf (5),
.BR dhcpagent (8),
.BR ifconfig (8),
.BR in.ndpd (8),
.BR netstat (8)
.LP
Alexander, S., and R. Droms. \fIRFC 2132, DHCP Options and BOOTP Vendor
Extensions\fR. Silicon Graphics, Inc. Bucknell University. March 1997.
.LP
Droms, R. \fIRFC 1534, Interoperation Between DHCP and BOOTP\fR. Bucknell
University. October 1993.
.LP
Droms, R. \fIRFC 2131, Dynamic Host Configuration Protocol\fR. Bucknell
University. March 1997.
.LP
Wimer, W. \fIRFC 1542, Clarifications and Extensions for the Bootstrap
Protocol\fR. Carnegie Mellon University. October 1993.
.LP
Lemon, T. and B. Sommerfeld. \fIRFC 4361, Node-specific Client Identifiers for
Dynamic Host Configuration Protocol Version Four (DHCPv4)\fR. Nominum and Sun
Microsystems. February 2006.
.LP
Droms, R. \fIRFC 3315, Dynamic Host Configuration Protocol for IPv6
(DHCPv6)\fR. Cisco Systems. July 2003.
