illumos/illumos-gate/usr/src/man/man7/eqnchar.7
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc.
.\" All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH EQNCHAR 7 "Jul 12, 2002"
.SH NAME
eqnchar \- special character definitions for eqn
.SH SYNOPSIS
.LP
.nf
eqn  /usr/share/lib/pub/eqnchar \fIfilename\fR |  troff \fIoptions\fR
.fi

.LP
.nf
neqn  /usr/share/lib/pub/eqnchar \fIfilename\fR |  troff \fIoptions\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBeqnchar\fR command contains \fBnroff\fR(1) and \fBtroff\fR(1) character
definitions for constructing characters that are not available on the Graphic
Systems typesetter. These definitions are primarily intended for use with
\fBeqn\fR(1) and \fBneqn\fR(1). It contains definitions for the characters
listed in the following table.
.sp
To view the special characters, see the online man page on docs.sun.com or a
print copy.
.SH FILES
.sp
.LP
\fB/usr/share/lib/pub/eqnchar\fR
.SH SEE ALSO
.sp
.LP
.BR eqn (1),
.BR nroff (1),
.BR troff (1),
.BR attributes (7)
