illumos/illumos-gate/usr/src/man/man7/gss_auth_rules.7
'\" te
.\"  Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH GSS_AUTH_RULES 7 "Apr 13, 2004"
.SH NAME
gss_auth_rules \- overview of GSS authorization
.SH DESCRIPTION
.sp
.LP
The establishment of the veracity of a user's credentials requires both
authentication (Is this an authentic user?) and authorization (Is this
authentic user, in fact, authorized?).
.sp
.LP
When a user makes use of Generic Security Services (GSS) versions of the
\fBftp\fR or \fBssh\fR clients to connect to a server, the user is not
necessarily authorized, even if his claimed GSS identity is authenticated,
Authentication merely establishes that the user is who he says he is to the GSS
mechanism's authentication system. Authorization is then required: it
determines whether the GSS identity is permitted to access the specified
Solaris user account.
.sp
.LP
The GSS authorization rules are as follows:
.RS +4
.TP
.ie t \(bu
.el o
If the mechanism of the connection has a set of authorization rules, then use
those rules. For example, if the mechanism is Kerberos, then use the
\fBkrb5_auth_rules\fR(7), so that authorization is consistent between raw
Kerberos applications and GSS/Kerberos applications.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If the mechanism of the connection does not have a set of authorization rules,
then authorization is successful if the remote user's \fBgssname\fR matches the
local user's \fBgssname\fR exactly, as compared by
\fBgss_compare_name\fR(3GSS).
.RE
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
System account file. This information may also be in a directory service. See
\fBpasswd\fR(5).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ftp (1),
.BR ssh (1),
.BR gss_compare_name (3GSS),
.BR passwd (5),
.BR attributes (7),
.BR krb5_auth_rules (7),
.BR gsscred (8)
