illumos/illumos-gate/usr/src/man/man7/ibmf.7
.\"  Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright 2020 Joyent, Inc.
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.Dd January 12, 2020
.Dt IBMF 7
.Os
.Sh NAME
.Nm ibmf
.Nd InfiniBand Management Transport Framework
.Sh DESCRIPTION
The InfiniBand (IB) Management Transport Framework provides the mechanisms for
IB management modules to communicate with other InfiniBand management modules
such as the Subnet Administration process.
It also provides helper functions
such as Subnet Administration Access (SAA) for commonly performed operations.
.Sh FILES
.Bl -tag -width Pa
.It Pa /kernel/misc/amd64/ibmf
Device driver (x86).
.It Pa /kernel/misc/sparcv9/ibmf
Device driver (SPARC)
.El
.Sh ARCHITECTURE
PCI-based systems
.Sh INTERFACE STABILITY
Private
.Sh SEE ALSO
.Xr ibtl 7D
.Pp
.%T InfiniBand Architecture Specification, Version 1\&.1
.Pp
.%U www.infinibandta.org
