illumos/illumos-gate/usr/src/man/man7/ibmf.7
'\" te
.\"  Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ibmf 7 "9 Sep 2004" "SunOS 5.11" "Device and Network Interfaces"
.SH NAME
ibmf \- InfiniBand Management Transport Framework
.SH DESCRIPTION
.sp
.LP
The InfiniBand (IB) Management Transport Framework provides the mechanisms for
IB management modules to communicate with other InfiniBand management modules
such as the Subnet Administration process.  It also provides helper functions
such as Subnet Administration Access (SAA) for commonly performed operations.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/misc/ibmf\fR
.ad
.RS 29n
.rt  
32-bit ELF kernel misc module (x86 platform only).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/misc/amd64/ibmf\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel misc module (x86 platform only).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/misc/sparcv9/ibmf\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel misc module (SPARC platform only).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityConsolidation Private
.TE

.SH SEE ALSO
.sp
.LP
\fBibtl\fR(7D)
.sp
.LP
\fIInfiniBand Architecture Specification, Version 1.1\fR
.sp
.LP
\fIwww.infinibandta.org\fR
