illumos/illumos-gate/usr/src/man/man7/pam_authtok_store.7
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc.
.\" All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH PAM_AUTHTOK_STORE 7 "Jan 26, 2004"
.SH NAME
pam_authtok_store \- password management module
.SH SYNOPSIS
.LP
.nf
\fBpam_authtok_store.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBpam_authtok_store\fR provides functionality to the PAM password management
stack. It provides one function: \fBpam_sm_chauthtok()\fR.
.sp
.LP
When invoked with flags set to \fBPAM_UPDATE_AUTHTOK\fR, this module updates
the authentication token for the user specified by \fBPAM_USER\fR.
.sp
.LP
The authentication token \fBPAM_OLDAUTHTOK\fR can be used to authenticate the
user against repositories that need updating (\fBNIS\fR, \fBLDAP\fR). After
successful updates, the new authentication token stored in \fBPAM_AUTHTOK\fR is
the user's valid password.
.sp
.LP
This module honors the \fBPAM_REPOSITORY\fR item, which, if set, specifies
which repository is to be updated. If \fBPAM_REPOSITORY\fR is unset, it follows
the \fBnsswitch.conf\fR(5).
.sp
.LP
The following option can be passed to the module:
.sp
.ne 2
.na
\fB\fBdebug\fR\fR
.ad
.RS 17n
\fBsyslog\fR(3C) debugging information at the \fBLOG_DEBUG\fR level
.RE

.sp
.ne 2
.na
\fB\fBserver_policy\fR\fR
.ad
.RS 17n
If the account authority for the user, as specified by \fBPAM_USER\fR, is a
server, do not encrypt the authentication token before updating.
.RE

.SH ERRORS
.sp
.ne 2
.na
\fB\fBPAM_SUCCESS\fR\fR
.ad
.RS 18n
Successfully obtains authentication token
.RE

.sp
.ne 2
.na
\fB\fBPAM_SYSTEM_ERR\fR\fR
.ad
.RS 18n
Fails to get username, service name, old password or new password, user name
null or empty, or password null.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
_
MT Level	MT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR pam_chauthtok (3PAM),
.BR pam.conf (5),
.BR attributes (7),
.BR pam_authtok_check (7),
.BR pam_authtok_get (7),
.BR pam_dhkeys (7),
.BR pam_passwd_auth (7),
.BR pam_unix_account (7),
.BR pam_unix_auth (7),
.BR pam_unix_session (7)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within the
multi-threaded application uses its own \fBPAM\fR handle.
.sp
.LP
The \fBpam_unix\fR(7) module is no longer supported. Similar functionality is
provided by \fBpam_authtok_check\fR(7), \fBpam_authtok_get\fR(7),
\fBpam_authtok_store\fR(7), \fBpam_dhkeys\fR(7), \fBpam_passwd_auth\fR(7),
\fBpam_unix_account\fR(7), \fBpam_unix_auth\fR(7), and
\fBpam_unix_session\fR(7).
.sp
.LP
If the \fBPAM_REPOSITORY\fR \fIitem_type\fR is set and a service module does
not recognize the type, the service module does not process any information,
and returns \fBPAM_IGNORE\fR. If the \fBPAM_REPOSITORY\fR \fIitem_type\fR is
not set, a service module performs its default action.
