illumos/illumos-gate/usr/src/man/man7/pam_tsol_account.7
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH PAM_TSOL_ACCOUNT 7 "August 19, 2023"
.SH NAME
pam_tsol_account \- PAM account management module for Trusted Extensions
.SH SYNOPSIS
.nf
\fBpam_tsol_account.so.1\fR
.fi

.SH DESCRIPTION
The Trusted Extensions service module for \fBPAM\fR,
\fBpam_tsol_account.so.1\fR, checks account limitations that
are related to labels.
.sp
.LP
\fBpam_tsol_account.so.1\fR contains a function to perform account management,
\fBpam_sm_acct_mgmt\fR(3PAM).
The function checks for the allowed label range for
the user.  The allowable label range is set by the defaults in the
\fBlabel_encodings\fR(5) file. These defaults can be overridden by entries in
the \fBuser_attr\fR(5) database.
.sp
.LP
By default, this module requires that remote hosts connecting to the  global
zone must have a CIPSO host type. To disable this policy, add the
\fBallow_unlabeled\fR keyword as an option to the entry in \fBpam.conf\fR(5),
as in:
.sp
.in +2
.nf
other  account required    pam_tsol_account allow_unlabeled
.fi
.in -2
.sp

.SH OPTIONS
The following options can be passed to the module:
.sp
.ne 2
.na
\fB\fBallow_unlabeled\fR\fR
.ad
.RS 19n
Allows remote connections from hosts with unlabeled template types.
.RE

.sp
.ne 2
.na
\fB\fBdebug\fR\fR
.ad
.RS 19n
Provides debugging information at the \fBLOG_DEBUG\fR level. See
\fBsyslog\fR(3C).
.RE

.SH RETURN VALUES
The following values are returned:
.sp
.ne 2
.na
\fB\fBPAM_SUCCESS\fR\fR
.ad
.RS 19n
The account is valid for use at this time and label.
.RE

.sp
.ne 2
.na
\fB\fBPAM_PERM_DENIED\fR\fR
.ad
.RS 19n
The current process label is outside the user's label range, or the label
information for the process is unavailable, or the remote host type is not
valid.
.RE

.sp
.ne 2
.na
\fBOther values\fR
.ad
.RS 19n
Returns an error code that is consistent with typical PAM operations. For
information on error-related return values, see the \fBpam\fR(3PAM) man page.
.RE

.SH ATTRIBUTES
See \fBattributes\fR(7) for description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
_
MT Level	MT-Safe with exceptions
.TE

.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within the
multi-threaded application uses its own PAM handle.
.SH SEE ALSO
.BR keylogin (1),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_sm_acct_mgmt (3PAM),
.BR pam_start (3PAM),
.BR label_encodings (5),
.BR pam.conf (5),
.BR user_attr (5),
.BR attributes (7)
.SH NOTES
The functionality described on this manual page is available only if the system
is configured with Trusted Extensions.
