illumos/illumos-gate/usr/src/man/man5/autofs.5
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\"
.\" Copyright (c) 2002 Sun Microsystems, Inc. All rights reserved.
.\" Copyright 2016 Nexenta Systems, Inc.
.\"
.Dd March 1, 2016
.Dt AUTOFS 5
.Os
.Sh NAME
.Nm autofs
.Nd automount configuration properties
.Sh DESCRIPTION
The behavior of the
.Xr automount 8
command and the
.Xr automountd 8
daemon is controlled by property values that are stored in the Service
Management Facility,
.Xr smf 7 .
The
.Xr sharectl 8
command should be used to query or change values for these properties.
.Pp
Changes made to
.Nm
property values on an
.Nm automount
or
.Nm automountd
command line override the values set using
.Xr sharectl 8 .
.Pp
The following list describes the properties:
.Bl -tag -width Ds
.It Sy timeout Ns = Ns Ar num
Specifies a duration, in seconds, that a file system is to remain mounted when
not in use.
The default value is 600
.Pq 10 minutes .
Equivalent to the
.Fl t
option in
.Nm automount .
.It Sy automount_verbose Ns = Ns Sy true Ns | Ns Sy false
Verbose mode.
Causes you to be notified of non-critical events, such as
.Nm
mounts and unmounts.
The default value is
.Sy false .
Equivalent to the
.Fl v
option in
.Nm automount .
.It Sy automountd_verbose Ns = Ns Sy true Ns | Ns Sy false
Verbose mode.
Causes status messages to be logged to the svc:/system/filesystem/autofs:default
log file.
The default value is
.Sy false .
Equivalent to the
.Fl v
option in
.Nm automountd .
.It Sy nobrowse Ns = Ns Sy true Ns | Ns Sy false
Turn on or off browsing for all
.Nm
mount points.
The default value is
.Sy false .
Equivalent to the
.Fl n
option in
.Nm automountd .
.It Sy trace Ns = Ns Ar num
Expands each RPC call and logs it to svc:/system/filesystem/autofs:default
log file.
The default value, 0, turns off such tracing.
Starting with 1, with each higher value, the verbosity of trace output
increases.
.It Xo
.Sy environment Ns = Ns Ar name Ns = Ns Ar value Ns
.Oo , Ns Ar name Ns = Ns Ar value Oc Ns ...
.Xc
Specifies a comma separated list of environment variables.
If an environment variable has more than one value, those values should be
separated with a comma, preceded by a backslash as an escape character
.Pq Qq Sy \e, .
For example:
.Bd -literal -offset indent
VAR1=val1,VAR2=val2\e,val3
.Ed
.El
.Sh SEE ALSO
.Xr smf 7 ,
.Xr automount 8 ,
.Xr automountd 8 ,
.Xr sharectl 8
