illumos/illumos-gate/usr/src/man/man5/brand.4th.5
.\" Copyright (c) 2011 Devin Teske
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd Apr 22, 2017
.Dt BRAND.4TH 5
.Os
.Sh NAME
.Nm brand.4th
.Nd loader ASCII art boot module
.Sh DESCRIPTION
The file that goes by the name of
.Nm
is a set of commands designed to draw the ASCII art illumos brand above the
boot loader menu.
The commands of
.Nm
by themselves are not enough for most uses.
Please refer to the
examples below for the most common situations, and to
.Xr loader 5
for additional commands.
.Pp
Before using any of the commands provided in
.Nm ,
it must be included
through the command:
.Pp
.Dl include brand.4th
.Pp
This line is present in the default
.Pa /boot/forth/menu.rc
file, so it is not needed (and should not be re-issued) in a normal setup.
.Pp
The commands provided by it are:
.Pp
.Bl -tag -width disable-module_module -compact -offset indent
.It Ic draw-brand
Draws the illumos brand.
.Pp
The brand that is drawn is configured by setting the
.Ic loader_brand
variable in
.Xr loader.conf 4
to one of
.Dq Li illumos
(the default) or
.Dq Li none .
.Pp
The position of the logo can be configured by setting the
.Ic loader_brand_x
and
.Ic loader_brand_y
variables in
.Xr loader.conf 4 .
The default values are 2 (x) and 1 (y).
.El
.Pp
The environment variables that effect its behavior are:
.Bl -tag -width bootfile -offset indent
.It Va loader_brand
Selects the desired brand in the beastie boot menu.
Possible values are:
.Dq Li illumos
(default) or
.Dq Li none .
.It Va loader_brand_x
Sets the desired column position of the brand.
Default is 2.
.It Va loader_brand_y
Sets the desired row position of the brand.
Default is 1.
.El
.Sh FILES
.Bl -tag -width /boot/forth/loader.4th -compact
.It Pa /boot/zfsloader
The
.Xr zfsloader 5 .
.It Pa /boot/forth/brand.4th
.Nm
itself.
.It Pa /boot/loader.rc
.Xr loader 4
bootstrapping script.
.El
.Sh EXAMPLES
Set illumos brand in
.Xr loader.conf 4 :
.Pp
.Bd -literal -offset indent -compact
loader_brand="illumos"
.Ed
.Sh SEE ALSO
.Xr loader.conf 4 ,
.Xr loader 5
