illumos/illumos-gate/usr/src/man/man5/fstypes.5
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FSTYPES 5 "Dec 18, 1991"
.SH NAME
fstypes \- file that registers distributed file system packages
.SH DESCRIPTION
.sp
.LP
\fBfstypes\fR resides in directory \fB/etc/dfs\fR and lists distributed file
system utilities packages installed on  the system.  For each installed
distributed file system type, there is a line that begins with the file system
type name (for example, ``nfs''), followed by white space and descriptive text.
.sp
.LP
The file system indicated in the first line of the file is the  default file
system; when Distributed File System (DFS)  Administration commands are entered
without the  option  \fB\(miF\fR \fIfstypes\fR, the system takes the file
system type from the first line of the  \fBfstypes\fR file.
.sp
.LP
The default file system can be changed by editing the \fBfstypes\fR file with
any supported text editor.
.SH SEE ALSO
.sp
.LP
.BR dfmounts (8),
.BR dfshares (8),
.BR share (8),
.BR shareall (8),
.BR unshare (8)
