illumos/illumos-gate/usr/src/man/man5/gsscred.conf.5
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH GSSCRED.CONF 5 "Mar 17, 2004"
.SH NAME
gsscred.conf \- Generic Security Services credential configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/gss/gsscred.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBgsscred.conf\fR file contains GSS credential information including
options that can be set by the system administrator.
.sp
.LP
The options that are in this file include:
.sp
.in +2
.nf
SYSLOG_UID_MAPPING=yes
.fi
.in -2

.sp
.LP
If this option is set to \fByes\fR, GSS cred to Unix cred mapping results will
be logged to \fBsyslog\fR(3C) at level \fBauth.debug\fR.
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/gss/gsscred.conf\fR\fR
.ad
.RS 25n
Contains GSS credential information.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
.BR syslog (3C),
.BR krb5.conf (5),
.BR attributes (7),
.BR kerberos (7),
.BR gsscred (8),
.BR gssd (8)
