illumos/illumos-gate/usr/src/man/man5/hba.conf.5
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH HBA.CONF 5 "Sep 4, 2003"
.SH NAME
hba.conf \- configuration file for the HBAAPI library
.SH DESCRIPTION
.sp
.LP
The \fB/etc/hba.conf\fR file is used to specify the Vendor-Specific Libraries
that are installed on the system. This file is used by the Common Library to
load the individual VSLs when \fBHBA_LoadLibrary\fR(3HBAAPI) is called. If
changes are made to the file while the library is in use, the library should be
freed and reloaded. A version 1 VSL is compatible only with a version 1 Common
Library. A version 2 VSL is compatible with both a version 1 and a version 2
Common Library.
.sp
.LP
Each VSL entry is a single line of the form:
.sp
.in +2
.nf
"name"	    "library path"
.fi
.in -2

.sp
.LP
where:
.sp
.ne 2
.na
\fB\fIname\fR\fR
.ad
.RS 16n
is the description of library. The library name should be prepended with the
domain of the manufacturer of the library.
.RE

.sp
.ne 2
.na
\fB\fIlibrary path\fR\fR
.ad
.RS 16n
is the absolute path to the shared object library file.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRContents of \fB/etc/hba.conf\fR
.sp
.in +2
.nf
#
# This file contains names and references to HBA libraries
#
# Format:
#
# <library name>  <library pathname>
#
# The library name should be prepended with the domain of
# the manufacturer or driver author.
com.sun.fchba32		/usr/lib/libsun_fc.so.1
com.sun.fchba64		/usr/lib/sparcv9/libsun_fc.so.1
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Standard: FC-MI 1.92 (API version 1)
_
	T{
Standard: FC-HBA Version 4 (API version 2)
T}
.TE

.SH SEE ALSO
.sp
.LP
.BR HBA_LoadLibrary (3HBAAPI),
.BR libhbaapi (3LIB),
.BR attributes (7)
.SH BUGS
.sp
.LP
The HBAAPI is provided in both 32- and 64-bit versions, but only one
configuration file is specified. As a result, both 32- and 64-bit VSL libraries
must be specified within the same file. When using the 32-bit Common Library,
the 64-bit VSLs will fail to load. When using the 64-bit Common Library, the
32-bit VSLs will fail to load. These failures are silently ignored by the
Common Library during normal usage, but can result in warning messages when
running client applications in a debugger.
