illumos/illumos-gate/usr/src/man/man5/ieee802.11.5
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH IEEE802.11 5 "Nov 28, 2006"
.SH NAME
ieee802.11 \- 802.11 kernel statistics
.SH DESCRIPTION
.sp
.LP
This page describes the kernel statistics that can be used to monitor
attributes specific to the 802.11 physical layer. These statistics can be
retrieved using \fBkstat\fR(1M). Not all 802.11 devices will support all
statistics.
.sp
.ne 2
.na
\fB\fBtx_frags\fR\fR
.ad
.RS 16n
Count of data and management fragments transmitted.
.RE

.sp
.ne 2
.na
\fB\fBrx_frags\fR\fR
.ad
.RS 16n
Count of data and management fragments received.
.RE

.sp
.ne 2
.na
\fB\fBrx_dups\fR\fR
.ad
.RS 16n
Count of duplicate frames received. Duplicates are determined by the sequence
control field.
.RE

.sp
.ne 2
.na
\fB\fBmcast_tx\fR\fR
.ad
.RS 16n
Count of broadcast and multicast frames transmitted.
.RE

.sp
.ne 2
.na
\fB\fBmcast_rx\fR\fR
.ad
.RS 16n
Count of broadcast and multicast frames received.
.RE

.sp
.ne 2
.na
\fB\fBtx_failed\fR\fR
.ad
.RS 16n
Count of frames that could not be transmitted due to the retransmission limit
being reached.
.RE

.sp
.ne 2
.na
\fB\fBtx_retrans\fR\fR
.ad
.RS 16n
Count of frames successfully retransmitted after one or more retransmissions.
.RE

.sp
.ne 2
.na
\fB\fBtx_reretrans\fR\fR
.ad
.RS 16n
Count of frames successfully retransmitted after more than one retransmission.
.RE

.sp
.ne 2
.na
\fB\fBrts_success\fR\fR
.ad
.RS 16n
Count of times a \fBCTS\fR was received in response to an \fBRTS\fR.
.RE

.sp
.ne 2
.na
\fB\fBrts_failure\fR\fR
.ad
.RS 16n
 Count of times a \fBCTS\fR was not received in response to an \fBRTS\fR.
.RE

.sp
.ne 2
.na
\fB\fBack_failure\fR\fR
.ad
.RS 16n
Count of times an \fBACK\fR was expected but was not received.
.RE

.sp
.ne 2
.na
\fB\fBfcs_errors\fR\fR
.ad
.RS 16n
Count of frames received with \fBFCS\fR errors.
.RE

.sp
.ne 2
.na
\fB\fBwep_errors\fR\fR
.ad
.RS 16n
Count of frames received with the \fBWEP\fR bit set but that either should not
have been encrypted or that were discarded due to \fBWEP\fR not being
supported.
.RE

.SH SEE ALSO
.sp
.LP
\fBkstat\fR(1M)
