illumos/illumos-gate/usr/src/man/man5/ike.preshared.5
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH IKE.PRESHARED 5 "Oct 15, 2001"
.SH NAME
ike.preshared \- pre-shared keys file for IKE
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/secret/ike.preshared\fR
.fi

.SH DESCRIPTION
.sp
.LP
 The \fB/etc/inet/secret/ike.preshared\fR file contains secret keying material
that two \fBIKE\fR instances can use to authenticate each other. Because of the
sensitive nature of this data, it is kept in the \fB/etc/inet/secret\fR
directory, which is only accessible by root.
.sp
.LP
Pre-shared keys are delimited by open-curly-brace (\fB{\fR) and
close-curly-brace (\fB}\fR) characters. There are five name-value pairs
required inside a pre-shared key:
.sp

.sp
.TS
c c c
l l l .
Name	Value	Example
localidtype	IP	localidtype IP
remoteidtype	IP	remoteidtype IP
localid	IP-address	localid 10.1.1.2
remoteid	IP-address	remoteid 10.1.1.3
key	hex-string          	1234567890abcdef
.TE

.sp
.LP
Comment lines with \fB#\fR appearing in the first column are also legal.
.sp
.LP
Files in this format can also be used by the \fBikeadm\fR(8) command to load
additional pre-shared keys into a running an \fBin.iked\fR(8) process.
.SH EXAMPLES
.LP
\fBExample 1 \fRA Sample ike.preshared File
.sp
.LP
The following is an example of an \fBike.preshared\fR file:

.sp
.in +2
.nf

#
# Two pre-shared keys between myself, 10.1.1.2, and two remote
# hosts.  Note that names are not allowed for IP addresses.
#
# A decent hex string can be obtained by performing:
#           od -x </dev/random | head
#

{
    localidtype IP
    localid 10.1.1.2
    remoteidtype IP
    remoteid 10.21.12.4
    key 4b656265207761732068657265210c0a
}

{
   localidtype IP
   localid 10.1.1.2
   remoteidtype IP
   remoteid 10.9.1.25
   key 536f20776572652042696c6c2c2052656e65652c20616e642043687269732e0a
}
.fi
.in -2

.SH SECURITY
.sp
.LP
If this file is compromised, all \fBIPsec\fR security associations derived from
secrets in this file will be compromised as well. The default permissions on
\fBike.preshared\fR are \fB0600\fR. They should stay this way.
.SH SEE ALSO
.sp
.LP
.BR od (1),
.BR random (4D),
.BR attributes (7),
.BR ikeadm (8),
.BR in.iked (8),
.BR ipseckey (8)
