illumos/illumos-gate/usr/src/man/man5/issue.5
'\" te
.\"  Copyright 1989 AT&T, Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ISSUE 5 "Jan 2, 2002"
.SH NAME
issue \- issue identification file
.SH DESCRIPTION
.sp
.LP
The file \fB/etc/issue\fR contains the issue or project identification to be
printed as a login prompt. \fBissue\fR is an ASCII file that is read by program
\fBttymon\fR and then written to any terminal spawned or respawned, prior to
the normal prompt.
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/issue\fR\fR
.ad
.RS 14n

.RE

.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR ttymon (8)
