illumos/illumos-gate/usr/src/man/man5/me.5
'\" te
.\"  Copyright (c) 1980 Regents of the University of California.  All rights reserved.  The Berkeley software License Agreement  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH me 5 "25 Feb 1992" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
me \- macros for formatting papers
.SH SYNOPSIS
.LP
.nf
\fBnroff\fR  \fB-me\fR [\fIoptions\fR] \fIfilename\fR...
.fi

.LP
.nf
\fBtroff\fR  \fB-me\fR [\fIoptions\fR] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
This package of \fBnroff\fR and \fBtroff\fR macro definitions provides a canned
formatting facility for technical papers in various formats. When producing
2-column output on a terminal, filter the output through \fBcol\fR(1).
.sp
.LP
The macro requests are defined below. Many \fBnroff\fR and \fBtroff\fR requests
are unsafe in conjunction with this package, however, these requests may be
used with impunity after the first \fB\&.pp\fR:
.sp
.ne 2
.mk
.na
\fB\&.bp\fR
.ad
.RS 12n
.rt  
begin new page
.RE

.sp
.ne 2
.mk
.na
\fB\&.br\fR
.ad
.RS 12n
.rt  
break output line here
.RE

.sp
.ne 2
.mk
.na
\fB\&.sp \fIn\fR\fR
.ad
.RS 12n
.rt  
insert \fIn\fR spacing lines
.RE

.sp
.ne 2
.mk
.na
\fB\&.ls \fIn\fR\fR
.ad
.RS 12n
.rt  
(line spacing) \fIn\fR=1 single, \fIn\fR=2 double space
.RE

.sp
.ne 2
.mk
.na
\fB\&.na\fR
.ad
.RS 12n
.rt  
no alignment of right margin
.RE

.sp
.ne 2
.mk
.na
\fB\&.ce \fIn\fR\fR
.ad
.RS 12n
.rt  
center next \fIn\fR lines
.RE

.sp
.ne 2
.mk
.na
\fB\&.ul \fIn\fR\fR
.ad
.RS 12n
.rt  
underline next \fIn\fR lines
.RE

.sp
.ne 2
.mk
.na
\fB\&.sz \fI+n\fR\fR
.ad
.RS 12n
.rt  
add \fIn\fR to point size
.RE

.sp
.LP
Output of the \fBeqn\fR(1), \fBneqn\fR(1), \fBrefer\fR(1), and \fBtbl\fR(1)
preprocessors for equations and tables is acceptable as input.
.SH REQUESTS
.sp
.LP
In the following list, "initialization" refers to the first \fB\&.pp,\fR
\fB\&.lp\fR, \fB\&.ip\fR, \fB\&.np\fR, \fB\&.sh\fR, or \fB\&.uh\fR macro. This
list is incomplete.
.sp

.sp
.TS
tab();
cw(.83i) cw(.67i) cw(.67i) cw(3.33i) 
cw(.83i) cw(.67i) cw(.67i) cw(3.33i) 
.
\fIRequest\fR\fIInitial\fR\fICause\fR\fIExplanation\fR
\fIValue\fR\fIBreak\fR
\fB\&.(c\fR-yesBegin centered block.
\fB\&.(d\fR-noBegin delayed text.
\fB\&.(f\fR-noBegin footnote.
\fB\&.(l\fR-yesBegin list.
\fB\&.(q\fR-yesBegin major quote.
\fB\&.(x\fR\fIx\fR -noBegin indexed item in index \fIx\fR.
\fB\&.(z\fR-noBegin floating keep.
\fB\&.)c\fR-yesEnd centered block.
\fB\&.)d\fR-yesEnd delayed text.
\fB\&.)f\fR-yesEnd footnote.
\fB\&.)l\fR-yesEnd list.
\fB\&.)q\fR-yesEnd major quote.
\fB\&.)x\fR-yesEnd index item.
\fB\&.)z\fR-yesEnd floating keep.
\fB\&.++\fR \fIm H\fR -noDefine paper section.
\fIm\fR defines the part of the paper,
T{
and can be \fBC\fR (chapter), \fBA\fR (appendix), \fBP\fR (preliminary, for instance,
T}
abstract, table of contents, etc.),
\fBB\fR (bibliography), \fBRC\fR (chapters
renumbered from page one each
chapter), or \fBRA\fR (appendix renumbered
from page one).
\fB\&.+c \fR\fIT\fR -yesBegin chapter (or appendix, etc.,
as set by \fB\&.++\fR).  \fIT\fR is
the chapter title.
\fB\&.1c\fR1yesOne column format on a new page.
\fB\&.2c\fR1yesTwo column format.
\fB\&.EN\fR-yesSpace after equation produced by \fBeqn\fR
or \fBneqn\fR.
\fB\&.EQ\fR \fIx y\fR -yesPrecede equation; break out and
add space.  Equation number is \fIy\fR.
The optional argument \fIx\fR may be \fII\fR
to indent equation (default),
\fIL\fR to left-adjust the equation, or
\fIC\fR to center the equation.
\fB\&.GE\fR-yesEnd \fIgremlin\fR picture.
\fB\&.GS\fR-yesBegin \fIgremlin\fR picture.
\fB\&.PE\fR-yesEnd \fBpic\fR picture.
\fB\&.PS\fR-yesBegin \fBpic\fR picture.
\fB\&.TE\fR-yesEnd table.
\fB\&.TH\fR-yesEnd heading section of table.
\fB\&.TS\fR \fIx\fR-yesBegin table; if \fIx\fR is \fIH\fR table
has repeated heading.
\fB\&.ac\fR \fIA N\fR -noSet up for ACM style output.
\fIA\fR is the Author's name(s), \fIN\fR is the
total number of pages. Must be given
before the first initialization.
\fB\&.b\fR \fIx\fR nonoPrint \fIx\fR in boldface; if no argument
switch to boldface.
\fB\&.ba\fR \fI+n\fR 0yesAugments the base indent by \fIn\fR.
This indent is used to set the indent
on regular text (like paragraphs).
\fB\&.bc\fRnoyesBegin new column.
\fB\&.bi\fR \fIx\fR nonoPrint \fIx\fR in bold italics 
(nofill only).
\fB\&.bu\fR-yesBegin bulleted paragraph.
\fB\&.bx\fR \fIx\fRnonoPrint \fIx\fR in a box (nofill only).
\fB\&.ef\fR  \fI\&'x'y'z\fR\&'''''noSet even footer to \fIx y z\fR.
\fB\&.eh\fR \fI\&'x'y'z\fR\&'''''noSet even header to \fIx y z\fR.
\fB\&.fo\fR \fI\&'x'y'z\fR\&'''''noSet footer to \fIx y z\fR.
\fB\&.hx\fR-noSuppress headers and footers on
next page.
\fB\&.he\fR \fI\&'x'y'z\fR\&'''''noSet header to \fIx  y  z\fR.
\fB\&.hl\fR-yesDraw a horizontal line.
\fB\&.i\fR \fIx\fR nonoItalicize \fIx\fR; if \fIx\fR missing, italic
text follows.
\fB\&.ip\fR \fIx y\fR noyesStart indented paragraph, with
hanging tag \fIx\fR.  Indentation is
\fIy\fR ens (default 5).
\fB\&.lp\fRyesyesStart left-blocked paragraph.
\fB\&.lo\fR-noRead in a file of local macros
of the form \fB\&.*\fR\fIx.\fR Must be
given before initialization.
\fB\&.np\fR1yesStart numbered paragraph.
\fB\&.of\fR \fI\&'x'y'z\fR\&'''''noSet odd footer to x  y  z.
\fB\&.oh\fR \fI\&'x'y'z\fR\&'''''noSet odd header to x  y  z.
\fB\&.pd\fR-yesPrint delayed text.
\fB\&.pp\fRnoyesBegin paragraph. First line indented.
\fB\&.r\fRyesnoRoman text follows.
\fB\&.re\fR-noReset tabs to default values.
\fB\&.sc\fRnonoRead in a file of special characters
and diacritical marks.  Must be
given before initialization.
\fB\&.sh\fR \fIn x\fR -yesSection head follows, font
automatically bold.  \fIn\fR is level
of section, \fIx\fR is title of section.
\fB\&.sk\fRnonoLeave the next page blank.
Only one page is remembered ahead.
\fB\&.sm\fR \fIx\fR-noSet \fIx\fR in a smaller pointsize.
\fB\&.sz\fR \fI+n\fR 10pnoAugment the point size by \fIn\fR points.
\fB\&.th\fRnonoProduce the paper in thesis format.
Must be given before initialization.
\fB\&.tp\fRnoyesBegin title page.
\fB\&.u\fR \fIx\fR-noUnderline argument (even in \fBtroff\fR).
(Nofill only).
\fB\&.uh\fR-yesLike \fB\&.sh\fR but unnumbered.
\fB\&.xp\fR \fIx\fR -noPrint index \fIx\fR.
.TE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/tmac/e\fR\fR
.ad
.RS 28n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/tmac/*.me\fR\fR
.ad
.RS 28n
.rt  

.RE

.SH SEE ALSO
.sp
.LP
\fBcol\fR(1), \fBeqn\fR(1), \fBnroff\fR(1), \fBrefer\fR(1), \fBtbl\fR(1),
\fBtroff\fR(1)
