illumos/illumos-gate/usr/src/man/man5/nca.if.5
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NCA.IF 5 "Feb 18, 2003"
.SH NAME
nca.if \- the NCA configuration file that specifies physical interfaces
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/nca.if\fR
.fi

.SH DESCRIPTION
.sp
.LP
Specify the physical interfaces for which the Solaris Network Cache and
Accelerator ("\fBNCA\fR") feature will be configured in the \fBnca.if\fR
configuration file. List the physical interfaces in the file, one per line. To
configure \fBNCA\fR to listen on all physical interfaces present on the system
backed by a \fBhostname.{interface_name}\fR, then list only an asterik
("\fB*\fR") in \fBnca.if\fR.
.sp
.LP
When the \fBncakmod\fR(1) initialization script is invoked during system boot,
it will attempt to configure each physical interface specified in the
\fBnca.if\fR file by using \fBncaconfd\fR(8). Note that there must be an
accompanying \fBhostname.{interface_name}\fR file and an entry in
\fB/etc/hosts\fR for the contents of \fBhostname.{interface_name}\fR.
.sp
.LP
You must reboot in order to implement changes to the \fBnca.if\fR file.
.SH EXAMPLES
.SS "x86"
.LP
\fBExample 1 \fR\fBnca.if\fR on x86
.sp
.LP
The following is an example of an \fBnca.if\fR file that would be used on an
x86 system:

.sp
.in +2
.nf
iprb1
iprb6
iprb8
.fi
.in -2

.SS "SPARC"
.LP
\fBExample 2 \fR\fBnca.if\fR on SPARC
.sp
.LP
The following is an example of an \fBnca.if\fR file that would be used on a
SPARC system:

.sp
.in +2
.nf
hme2
hme3
hme4
.fi
.in -2

.SS "All Platforms"
.LP
\fBExample 3 \fRConfiguring NCA to Listen on All Physical Interfaces
.sp
.LP
The following example shows the contents of an \fBnca.if\fR file that would be
used to configure either platform to listen on all physical interfaces present
on the system:

.sp
.in +2
.nf
*
.fi
.in -2

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/nca/nca.if\fR\fR
.ad
.RS 25n
Lists the physical interfaces on which \fBNCA\fR will run.
.RE

.sp
.ne 2
.na
\fB\fB/etc/hostname.{}{0-9}\fR\fR
.ad
.RS 25n
Lists all physical interfaces configured on the server.
.RE

.sp
.ne 2
.na
\fB\fB/etc/hosts\fR\fR
.ad
.RS 25n
Lists all host names associated with the server. Entries in this file must
match with entries in \fB/etc/hostname.{}{0-9}\fR for \fBNCA\fR to function.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR ncab2clf (1),
.BR ncakmod (1),
.BR ncakmod.conf (5),
.BR ncalogd.conf (5),
.BR attributes (7),
.BR ifconfig (8)
.sp
.LP
\fISystem Administration Guide: IP Services\fR
