illumos/illumos-gate/usr/src/man/man5/ncad_addr.5
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NCAD_ADDR 5 "April 9, 2016"
.SH NAME
ncad_addr \- name of the Solaris Network Cache and Accelerator (NCA) socket
utility library
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ncad_addr.so\fR
.fi

.SH DESCRIPTION
.LP
\fBncad_addr.so\fR is the Solaris Network Cache and Accelerator (\fBNCA\fR)
socket utility library. Use this library with a web server to avoid support for
the \fBPF_NCA\fR family type socket. The web server can take advantage of NCA
functionality.
.sp
.LP
Interpose the \fBncad_addr\fR interfaces before the interfaces in
\fBlibsocket\fR by setting the environment variable \fBLD_PRELOAD\fR to
\fBncad_addr.so\fR so that it is preloaded before \fBlibsocket.so.1\fR. The
\fBncad_addr.so\fR interfaces will be interposed only if NCA is enabled. See
\fBncakmod\fR(1).
.SH EXAMPLES
.LP
\fBExample 1 \fRInterposing \fBncad_addr\fR
.sp
.LP
Using Bourne shell syntax as an example, set \fBLD_PRELOAD\fR as shown below to
interpose the \fBncad_addr\fR socket utility library:

.sp
.in +2
.nf
LD_PRELOAD=/usr/lib/ncad_addr.so /usr/bin/httpd
.fi
.in -2

.SH FILES
.ne 2
.na
\fB\fB/usr/lib/ncad_addr.so\fR\fR
.ad
.RS 25n
\fBncad_addr\fR socket utility library shared object
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(7)  for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Unstable
.TE

.SH SEE ALSO
.LP
\fBnca\fR(1), \fBncab2clf\fR(1), \fBncakmod\fR(1), \fBsocket\fR(3SOCKET),
\fBnca.if\fR(5),  \fBncakmod.conf\fR(5),
.BR attributes (7)
.SH NOTES
.LP
Only applications that use the \fBNCA\fR feature, for example, web servers,
should interpose this library.
