illumos/illumos-gate/usr/src/man/man5/networks.5
'\" te
.\"  Copyright 1989 AT&T
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NETWORKS 5 "March 30, 2022"
.SH NAME
networks \- network name database
.SH SYNOPSIS
.nf
\fB/etc/inet/networks\fR
.fi

.LP
.nf
\fB/etc/networks\fR
.fi

.SH DESCRIPTION
The \fBnetworks\fR file is a local source of information regarding the networks
which comprise the Internet. The networks file can be used in conjunction
with, or instead of, other networks sources, including the NIS maps
\fBnetworks.byname\fR and \fBnetworks.byaddr\fR.
Programs use the \fBgetnetbyname\fR(3SOCKET) routines to access
this information.
.sp
.LP
The network file has a single line for each network, with the following
information:
.sp
.in +2
.nf
\fIofficial-network-name network-number aliases\fR
.fi
.in -2

.sp
.LP
Items are separated by any number of  \fBSPACE\fR or \fBTAB\fR characters. A
`\fB#\fR' indicates the beginning of a comment. Characters up to the end of the
line are not interpreted by routines which search the file. This file is
normally created from the official network database maintained at the Network
Information Control Center (NIC), though local changes may be required to bring
it up to date regarding unofficial aliases and/or unknown networks.
.sp
.LP
Network numbers may be specified in the conventional dot (`\fB\&.\fR') notation
using the \fBinet_network\fR routine from the Internet address manipulation
library, \fBinet\fR(3C). Network names may contain any printable character
other than a field delimiter, \fBNEWLINE\fR, or comment character.
.SH SEE ALSO
.BR inet (3C),
.BR getnetbyaddr (3SOCKET),
.BR getnetbyname (3SOCKET),
.BR nsswitch.conf (5)
.SH NOTES
The official SVR4 name of the \fBnetworks\fR file is \fB/etc/inet/networks\fR.
The symbolic link \fB/etc/networks\fR exists for \fBBSD\fR compatibility.
.sp
.LP
The network number in \fBnetworks\fR database is the host address shifted to
the right by the number of 0 bits in the address mask. For example, for the
address \fB24.132.47.86\fR that has a mask of \fBfffffe00\fR, its network
number is \fB803351\fR. This is obtained when the address is shifted right by 9
bits. The address maps to \fB12.66.23\fR. The trailing 0 bits should not be
specified.  The network number here is different from that described in
\fBnetmasks\fR(5). For this example, the entry in \fBnetmasks\fR would be
\fB24.132.46.0 fffffe00\fR.
