illumos/illumos-gate/usr/src/man/man5/publickey.5
'\" te
.\"  Copyright 1989 AT&T .\e" Copyright (c) 1988 Sun Microsystems, Inc. - All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH PUBLICKEY 5 "Feb 25, 2017"
.SH NAME
publickey \- public key database
.SH SYNOPSIS
.LP
.nf
\fB/etc/publickey\fR
.fi

.SH DESCRIPTION
.LP
\fB/etc/publickey\fR is  a local  public key database that is used for secure
RPC. The  \fB/etc/publickey\fR file can be used in conjunction with or instead
of other publickey databases, including the NIS publickey map.
Each entry in the database consists of a network user name
(which may refer to either a user or a hostname), followed by the user's public
key (in hex notation), a colon, and then the user's secret key encrypted with a
password (also in hex notation).
.sp
.LP
The \fB/etc/publickey\fR file contains a default entry for \fBnobody\fR.
.SH SEE ALSO
.LP
.BR chkey (1),
.BR getpublickey (3NSL),
.BR nsswitch.conf (5),
.BR newkey (8)
