illumos/illumos-gate/usr/src/man/man5/space.5
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SPACE 5 "Feb 7, 1997"
.SH NAME
space \- disk space requirement file
.SH DESCRIPTION
.sp
.LP
\fBspace\fR is an \fBASCII\fR file that gives information about disk space
requirements for the target environment. The \fBspace\fR file defines space
needed beyond what is used by objects defined in the \fBprototype\fR(5) file;
for example, files which will be installed with the \fBinstallf\fR(8) command.
The \fBspace\fR file should define the maximum amount of additional space that
a package will require.
.sp
.LP
The generic format of a line in this file is:
.sp
.LP
\fIpathname  blocks  inodes\fR
.sp
.LP
Definitions for the fields are as follows:
.sp
.ne 2
.na
\fB\fIpathname\fR\fR
.ad
.RS 12n
Specify a directory name which may or may not be the mount  point for a
filesystem. Names that do not begin with a slash  ('\fB/\fR') indicate
relocatable directories.
.RE

.sp
.ne 2
.na
\fB\fIblocks\fR\fR
.ad
.RS 12n
Define the number of disk blocks required for installation of the files and
directory entries contained in the pathname (using a 512-byte block size).
.RE

.sp
.ne 2
.na
\fB\fIinodes\fR\fR
.ad
.RS 12n
Define the number of inodes required for installation of the files and
directory entries contained in the pathname.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRA sample file.
.sp
.in +2
.nf
# extra space required by config data which is
# dynamically loaded onto the system
data	500	1
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
.BR prototype (5),
.BR installf (8)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
