illumos/illumos-gate/usr/src/man/man7fs/sharefs.7fs
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH sharefs 7FS "31 Oct 2007" "SunOS 5.11" "File Systems"
.SH NAME
sharefs \- Kernel sharetab filesystem
.SH DESCRIPTION
.sp
.LP
The \fBsharefs\fR filesystem describes the state of all shares currently loaded
by the kernel. It is mounted during boot time as a read-only file at
\fB/etc/dfs/sharetab\fR.
.sp
.LP
Filesystem contents are dynamic and  reflect  the current set of shares in the
system. File contents are described in \fBsharetab\fR(4).
.sp
.LP
File contents can be modified as a result of \fBshare\fR(1M),
\fBsharectl\fR(1M), \fBsharemgr\fR(1M) and changing properties of a
\fBzfs\fR(1M) data set.
.sp
.LP
The module may not be unloaded dynamically by the kernel.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/sharetab\fR\fR
.ad
.RS 21n
.rt  
System record of shared file systems.
.RE

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M), \fBsharectl\fR(1M), \fBsharemgr\fR(1M), \fBzfs\fR(1M),
\fBsharetab\fR(4)
