/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */
/*
 * Copyright 2009 Sun Microsystems, Inc.  All rights reserved.
 * Use is subject to license terms.
 * Copyright (c) 2016 by Delphix. All rights reserved.
 */

#include <sys/types.h>
#include <sys/sysmacros.h>
#include <sys/open.h>
#include <sys/param.h>
#include <sys/vm_machparam.h>
#include <sys/machparam.h>
#include <sys/systm.h>
#include <sys/signal.h>
#include <sys/cred.h>
#include <sys/user.h>
#include <sys/proc.h>
#include <sys/vnode.h>
#include <sys/uio.h>
#include <sys/buf.h>
#include <sys/file.h>
#include <sys/kmem.h>
#include <sys/stat.h>
#include <sys/stream.h>
#include <sys/stropts.h>
#include <sys/strsubr.h>
#include <sys/poll.h>
#include <sys/debug.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/errno.h>
#include <sys/modctl.h>
#include <sys/x_call.h>
#include <sys/cpuvar.h>
#include <sys/machcpuvar.h>
#include <sys/machsystm.h>

#include <sys/pda.h>
#include <sys/starfire.h>
#include <sys/idn.h>
#include <sys/idn_xf.h>

kmutex_t	idn_xf_mutex;		/* to serialize hardware access */
/*
 * This data structure is referenced during the cross-call
 * update of the CICs.  The semaphore is used for synchronization
 * when waiting for completion of the respective operation.
 * We want IDNCIC_TIMEOUT ticks for all the cpus to check-in
 * before we bail out and fail the operation.
 */
#define	IDNCIC_TIMEOUT		(30*hz)
#define	IDNCIC_TIMECHK		(hz/3)
#define	IDNCIC_UNKNOWN		0
#define	IDNCIC_OK		1	/* values for xf_errcic */
#define	IDNCIC_ERR		2
#define	IDNCIC_BUSY		3

#ifdef DEBUG
#define	NCICREGS		3	/* smmask, smbar, smlar */
#define	CICREG_SMMASK		0
#define	CICREG_SMBAR		1
#define	CICREG_SMLAR		2

#define	RESET_CIC_HISTORY() \
		(xf_cicboards = xf_cicbuses = 0, \
		bzero(xf_cicregs, sizeof (xf_cicregs)))

#define	UPDATE_CIC_HISTORY(reg, brd, bus, val) \
		(BOARDSET_ADD(xf_cicboards, (brd)), \
		BOARDSET_ADD(xf_cicbuses, (bus)), \
		xf_cicregs[brd][bus][reg] = (val))

#define	DUMP_CIC_HISTORY() \
{ \
	if (idn_debug & IDNDBG_XF) { \
		int	_bd, _bs; \
		procname_t	_proc = "dump_cic_history"; \
		for (_bd = 0; _bd < MAX_BOARDS; _bd++) { \
			if (!BOARD_IN_SET(xf_cicboards, _bd)) \
				continue; \
			for (_bs = 0; _bs < MAX_ABUSES; _bs++) { \
				if (!BOARD_IN_SET(xf_cicbuses, _bs)) \
					continue; \
				printf("%s: (bd.bs = %d.%d) m/b/l = " \
					"%x/%x/%x\n", _proc, _bd, _bs, \
					xf_cicregs[_bd][_bs][CICREG_SMMASK], \
					xf_cicregs[_bd][_bs][CICREG_SMBAR], \
					xf_cicregs[_bd][_bs][CICREG_SMLAR]); \
			} \
		} \
		DEBUG_DELAY(); \
	} \
}

/*
 * Globally updated during CIC reg updates.  Everybody has
 * a unique location, so no concern about updates stepping
 * on each other.
 */
static ushort_t	xf_cicboards, xf_cicbuses;
static uint_t	xf_cicregs[MAX_BOARDS][MAX_ABUSES][NCICREGS];
#else /* DEBUG */
#define	RESET_CIC_HISTORY()
#define	UPDATE_CIC_HISTORY(reg, brd, bus, val)
#define	DUMP_CIC_HISTORY()
#endif /* DEBUG */

struct idnxf_cic_info {			/* protected by idn_xf_mutex */
/*  0 */	short		xf_abus_mask;
/*  2 */	boardset_t	xf_boardset;
/*  4 */	uint_t		xf_smbase;
/*  8 */	uint_t		xf_smlimit;
/*  c */	int		xf_doadd;

/* 10 */	int		xf_count;	/* atomically updated */
/* 14 */	time_t		xf_start_time;
/* 18 */	kcondvar_t	xf_cv;
/* 1a */	short		xf_errtimer;
/* 1c */	int		xf_errcnt;	/* atomically updated */

/* 20 */	uchar_t		xf_errcic[MAX_BOARDS][MAX_ABUSES];

/* 60 */	kmutex_t	xf_mutex;
};	/* sizeof = 0x68 = 104 (26X) */

static struct idnxf_cic_info	idnxf_cic_info;
#ifdef DEBUG
static uint_t			o_idn_debug;
#endif /* DEBUG */

int	idn_check_cpu_per_board = 1;

static int	pc_prep_cic_buffer(int cpuid, uint_t cicdata);
static int	cic_write_sm_mask(int board, int bus, boardset_t sm_mask);
static int	cic_write_sm_bar(int board, int bus, uint_t sm_bar);
static int	cic_write_sm_lar(int board, int bus, uint_t sm_lar);
static int	cic_get_smmask_bit(void);
static int	pc_write_madr(pda_handle_t ph,
				int lboard, int rboard, uint_t madr);
static boardset_t	get_boardset(pda_handle_t ph, int *nboards);
static int	verify_smregs(int brd, int bus, boardset_t smmask,
				uint_t smbase, uint_t smlimit);
static void	idnxf_shmem_wakeup(void *arg);
static void	idnxf_shmem_update_one(uint64_t arg1, uint64_t arg2);
static int	idnxf_shmem_update_all(pda_handle_t ph,
				boardset_t boardset, uint_t smbase,
				uint_t smlimit, int doadd);

