illumos/illumos-gate/usr/src/man/man7ipp/ipqos.7ipp
'\" te
.\"  Copyright (c) 2002, Sun Microsystems Inc.
.\"  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ipqos 7ipp "25 Feb 2002" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
ipqos \- IP Quality of Service
.SH DESCRIPTION
.sp
.LP
\fBipqos\fR is an implementation of the Differentiated Services model defined
in \fIRFC2475: An Architecture for Differentiated Services\fR, which defines
the following entities: multi-field classifier, meter, marker, and dropper. The
Solaris implementation of \fBipqos\fR adds a flow accounting entity.
.sp
.LP
These entities can be combined into processing paths that constitute a series
of actions that are performed on groups of flows. The classifier groups
together flows and directs them in a given processing path. Classifier
configuration and path construction are achieved using the \fBipqosconf\fR(1M)
command.
.sp
.LP
A summary of the \fBipqos\fR entities follows. For more information, refer to
the corresponding man page for each entity.
.sp
.ne 2
.mk
.na
\fBipgpc\fR
.ad
.RS 21n
.rt  
An implementation of the classifier defined in the model. \fBipgpc\fR has been
extended and is able to select traffic based on IP header parameters, user id,
project id, interface name, interface group and direction.
.RE

.sp
.ne 2
.mk
.na
\fBtokenmt, tswtclmt\fR
.ad
.RS 21n
.rt  
These modules implement different metering algorithms. \fBtokenmt\fR implements
both \fIRFC2697: A Single Rate Three Color Marker \fR and \fIRFC 2698: A Two
Rate Three Color Marker\fR. \fItswtclmt\fR implements \fIRFC2859: A Time
Sliding Window Three Color Marker\fR. These modules only implement the metering
functions defined in the RFCs.
.RE

.sp
.ne 2
.mk
.na
\fBdlcosmk\fR
.ad
.RS 21n
.rt  
A marker entity that allows the setting of the user priority field of Ethernet
frames as defined in the \fIIEEE 802.1D\fR specification. \fBdlcosmk\fR is only
available with VLAN capable       network interfaces.
.RE

.sp
.ne 2
.mk
.na
\fBdscpmk\fR
.ad
.RS 21n
.rt  
A marker entity that enables the setting of the Differentiated Services Code
Point Value in the IP header as defined in \fIRFC 2474: Definition of the
Differentiated Services Field (DS Field)\fR in the IPv4 and IPv6 headers.
.RE

.sp
.ne 2
.mk
.na
\fBflowacct\fR
.ad
.RS 21n
.rt  
An accounting module that utilizes the Solaris extended accounting facility.
\fBflowacct\fR logs all flows with parameters used to build a charge back
mechanism.
.RE

.SH STATISTICS
.sp
.LP
\fBipqos\fR modules export statistics through the \fBkstat\fR facility.
Exported statistics contain the following common parameters:
.sp
.ne 2
.mk
.na
\fBmodule\fR
.ad
.RS 12n
.rt  
module name
.RE

.sp
.ne 2
.mk
.na
\fBinstance\fR
.ad
.RS 12n
.rt  
dynamic parameter identifying a specific instance
.RE

.sp
.ne 2
.mk
.na
\fBname\fR
.ad
.RS 12n
.rt  
a string  for global statistics (for example, ipgpc global stat) or a class
name for per-class statistics for a classifier action
.RE

.sp
.LP
To verify classifier configuration, generate traffic for each of the configured
classes and check that the statistic counters for the expected class are
increased. If you're unsure about the parameters for your traffic, you can use
\fBsnoop\fR(1M) to determine them.
.sp
.LP
Some actions have the instance id of the next configured action in their
statistics. This instance id can be used to follow the action processing path.
Instance id's -1 and -2 are the built-in actions continue and drop,
respectively.
.sp
.LP
Examples:
.sp
.LP
To retrieve all statistics for ipgpc:
.sp
.LP
 \fBkstat -m ipgpc\fR
.sp
.LP
To retrieve statistics for the class http:
.sp
.LP
 \fBkstat -m ipgpc -c http\fR
.SH SEE ALSO
.sp
.LP
\fBipqosconf\fR(1M), \fBdlcosmk\fR(7ipp), \fBdscpmk\fR(7ipp),
\fBflowacct\fR(7ipp), \fBipgpc\fR(7ipp), \fBtokenmt\fR(7ipp),
\fBtswtclmt\fR(7ipp)
.sp
.LP
\fIRFC 2475, An Architecture for Differentiated Services\fR S. Blake, D. Black,
M. Carlson, E. Davies, Z. Wang, W. Weiss \(em The Internet Society, 1998
.sp
.LP
\fIRFC 2474, Definition of the Differentiated Services Field (DS Field) in the
IPv4 and IPv6 Headers\fR K. Nichols, S. Blake, F. Baker, D. Black \(em The
Internet Society, 1998
.sp
.LP
\fIRFC 2697, A Single Rate Three Color Marker\fR J. Heinanen, R. Guerin \(em
The Internet Society, 1999
.sp
.LP
\fIRFC 2698, A Two Rate Three Color Marker\fR J. Heinanen, R. Guerin \(em The
Internet Society, 1999
.sp
.LP
\fIRFC 2859, A Time Sliding Window Three Colour Marker (TSWTCM)\fR W. Fang, N.
Seddigh, B. Nandy \(em The Internet Society, 2000
