illumos/illumos-gate/usr/src/man/man8/accept.8
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ACCEPT 8 "Feb 25, 2017"
.SH NAME
accept, reject \- accept or reject print requests
.SH SYNOPSIS
.LP
.nf
\fBaccept\fR \fIdestination\fR...
.fi

.LP
.nf
\fBreject\fR [\fB-r\fR \fIreason\fR] \fIdestination\fR...
.fi

.SH DESCRIPTION
.LP
\fBaccept\fR allows the queueing of print requests for the named destinations.
.sp
.LP
\fBreject\fR prevents queueing of print requests for the named destinations.
.sp
.LP
Use \fBlpstat\fR \fB-a\fR to check if destinations are accepting or rejecting
print requests.
.sp
.LP
Generally, \fBaccept\fR and \fBreject\fR are run on the print server to control
local print queues. Under some configurations, \fBaccept\fR and \fBreject\fR
are run on client systems when IPP is being used to communicate between client
and server.
.SH OPTIONS
.LP
The following options are supported for \fBreject\fR:
.sp
.ne 2
.na
\fB\fB-r\fR \fIreason\fR\fR
.ad
.RS 13n
Assigns a reason for rejection of print requests for \fIdestination.\fR
.sp
\fIreason\fR is reported by \fBlpstat\fR \fB-a\fR. By default, \fIreason\fR is
\fBunknown reason\fR for existing destinations, and \fBnew\fR \fBprinter\fR for
destinations added to the system but not yet accepting requests. Enclose
\fIreason\fR in quotes if it contains blanks.
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.na
\fB\fIdestination\fR\fR
.ad
.RS 15n
The name of the destination accepting or rejecting print requests. Destination
specifies the name of a printer or class of printers (see \fBlpadmin\fR(8)).
Specify \fIdestination\fR using atomic name or URI-style (scheme://endpoint)
names. See \fBprinters.conf\fR(5) for information regarding the naming
conventions for destinations.
.RE

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 12n
Successful completion.
.RE

.sp
.ne 2
.na
\fBnon-zero\fR
.ad
.RS 12n
An error occurred.
.RE

.SH FILES
.ne 2
.na
\fB\fB/etc/printers.conf\fR\fR
.ad
.RS 24n
System printer configuration database
.RE

.sp
.ne 2
.na
\fB\fB$HOME/.printers\fR\fR
.ad
.RS 24n
User-configurable printer database
.RE

.sp
.ne 2
.na
\fB\fBou=printers\fR\fR
.ad
.RS 24n
LDAP version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.na
\fB\fBprinters.conf.byname\fR\fR
.ad
.RS 24n
\fBNIS\fR version of \fB/etc/printers.conf\fR
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
CSI	Enabled. See \fBNOTES\fR.
_
Interface Stability	Obsolete
.TE

.SH SEE ALSO
.LP
.BR enable (1),
.BR lp (1),
.BR lpstat (1),
.BR printers.conf (5),
.BR attributes (7),
.BR lpadmin (8),
.BR lpsched (8)
.SH NOTES
.LP
\fBaccept\fR and \fBreject\fR affect only queueing on the print server's
spooling system. Requests made from a client system remain queued in the client
system's queueing mechanism until they are cancelled or accepted by the print
server's spooling system.
.sp
.LP
\fBaccept\fR is CSI-enabled except for the \fIdestination\fR name.
.sp
.LP
When IPP is in use, the user is prompted for a passphrase if the remote print
service is configured to require authentication.
