illumos/illumos-gate/usr/src/man/man8/captoinfo.8
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CAPTOINFO 8 "May 18, 1993"
.SH NAME
captoinfo \- convert a termcap description into a terminfo description
.SH SYNOPSIS
.LP
.nf
\fBcaptoinfo\fR [\fB-1\fR] [\fB-v\fR]... [\fB-V\fR] [\fB-w\fR \fIwidth\fR] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
\fBcaptoinfo\fR looks in \fIfilename\fR for  \fBtermcap\fR descriptions. For
each one found, an equivalent  \fBterminfo\fR description is written to
standard output, along with any comments found. A description which is
expressed as relative to another description (as specified in the \fBtermcap\fR
\fBtc = field\fR) is reduced to the minimum superset before being displayed.
.sp
.LP
If no  \fIfilename\fR is given, then the environment variable
\fB\fR\fBTERM\fR\fBCAP \fR is used for the filename or entry. If
\fB\fR\fBTERM\fR\fBCAP \fR is a full pathname to a file,  only the terminal
whose name is specified in the environment variable \fBTERM\fR is extracted
from that file. If the environment variable \fB\fR\fBTERM\fR\fBCAP \fR is not
set, then the file \fB/usr/share/lib/termcap\fR is read.
.SH OPTIONS
.sp
.ne 2
.na
\fB\fB\(mi1\fR\fR
.ad
.RS 12n
Display the fields one to a line. Otherwise, the fields are printed several to
a line, with a maximum width of 60 characters.
.RE

.sp
.ne 2
.na
\fB\fB-v\fR\fR
.ad
.RS 12n
Display tracing information on the standard error as the program runs.
Specifying additional \fB-v\fR options displays more detailed information.
.RE

.sp
.ne 2
.na
\fB\fB-V\fR\fR
.ad
.RS 12n
Display the version of the program in use on the standard error and then exit.
.RE

.sp
.ne 2
.na
\fB\fB-w\fR\fI width\fR\fR
.ad
.RS 12n
Change the output to \fIwidth\fR characters.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/usr/share/lib/terminfo/?/*\fR\fR
.ad
.sp .6
.RS 4n
compiled terminal description database
.RE

.sp
.ne 2
.na
\fB\fB/usr/share/lib/termcap\fR\fR
.ad
.sp .6
.RS 4n

.RE

.SH SEE ALSO
.sp
.LP
.BR curses (3CURSES),
.BR terminfo (5),
.BR attributes (7),
.BR infocmp (8)
.SH NOTES
.sp
.LP
\fBcaptoinfo\fR should be used to convert \fBtermcap\fR entries to
\fBterminfo\fR entries because the \fBtermcap\fR database may not be supplied
in future releases.
