illumos/illumos-gate/usr/src/man/man8/check-hostname.8
'\" te
.\"  Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CHECK-HOSTNAME 8 "Mar 8, 2006"
.SH NAME
check-hostname \- check if sendmail can determine the system's fully-qualified
host name
.SH SYNOPSIS
.LP
.nf
\fB /usr/sbin/check-hostname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBcheck-hostname\fR script is a migration aid for \fBsendmail\fR(8). This
script tries to determine the local host's fully-qualified host name (FQHN) in
a manner similar to \fBsendmail\fR(8). If \fBcheck-hostname\fR is able to
determine the \fBFQHN\fR of the local host, it reports success. Otherwise,
\fBcheck-hostname\fR reports how to reconfigure the system so that the
\fBFQHN\fR can be properly determined.
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/hosts\fR\fR
.ad
.RS 22n
Host name database
.RE

.sp
.ne 2
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 22n
Name service switch configuration file
.RE

.sp
.ne 2
.na
\fB\fB/etc/resolv.conf\fR\fR
.ad
.RS 22n
Configuration file for name server routines
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
.BR hosts (5),
.BR attributes (7),
.BR domainname (8),
.BR sendmail (8)
