illumos/illumos-gate/usr/src/man/man8/devprop.8
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DEVPROP 8 "Sep 26, 2007"
.SH NAME
devprop \- display device properties
.SH SYNOPSIS
.LP
.nf
\fB/sbin/devprop\fR [\fB-n\fR \fIdevice-path\fR] [\fB-vq\fR] [-\fB{b|i|l|s}\fR] [\fIproperty\fR[...]]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdevprop\fR command displays named device properties from the device
tree.
.sp
.LP
If a device path is specified on the command line, \fBdevprop\fR displays
device properties for that device node.
.sp
.LP
The output formats, while Volatile, are patterned after those of
\fBprtconf\fR(8).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-b\fR\fR
.ad
.sp .6
.RS 4n
The properties to be output are sequences of bytes (\fBDI_PROP_TYPE_BYTES\fR).
\fB-b\fR, \fB-i\fR, \fB-l\fR, and \fB-s\fR are mutually exclusive of one
another.
.RE

.sp
.ne 2
.na
\fB\fB-i\fR\fR
.ad
.sp .6
.RS 4n
The properties to be output are integers (\fBDI_PROP_TYPE_INT\fR).
.RE

.sp
.ne 2
.na
\fB\fB-l\fR\fR
.ad
.sp .6
.RS 4n
The properties to be output are 64-bit integers (\fBDI_PROP_TYPE_INT64\fR).
.RE

.sp
.ne 2
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
The properties to be output are strings (\fBDI_PROP_TYPE_STRING\fR) (the
default).
.RE

.sp
.ne 2
.na
\fB\fB-n\fR \fIdevice-path\fR\fR
.ad
.sp .6
.RS 4n
The path to a target device node for which properties are displayed. The
default path is that of the root node (equivalent to specifying \fB-n\fR
\fB/\fR).
.RE

.sp
.ne 2
.na
\fB\fB-q\fR\fR
.ad
.sp .6
.RS 4n
Specifies quoted output mode, in which string properties are output surrounded
by double quotation marks (\fB"\fR).
.RE

.sp
.ne 2
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Specifies verbose mode, in which the name of the property is output before its
value.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.na
\fB\fIproperty\fR...\fR
.ad
.sp .6
.RS 4n
Name of the property to be displayed.
.RE

.SH EXIT STATUS
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
No error occurred.
.RE

.sp
.ne 2
.na
\fB\fBnon-zero\fR\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	See below.
.TE

.sp
.LP
The command invocation and output are both Volatile. The location of the
utility is Committed.
.SH SEE ALSO
.sp
.LP
.BR libdevinfo (3LIB),
.BR attributes (7),
.BR prtconf (8)
