illumos/illumos-gate/usr/src/man/man8/diskscan.8
'\" te
.\"  Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DISKSCAN 8 "Feb 24, 1998"
.SH NAME
diskscan \- perform surface analysis
.SH SYNOPSIS
.LP
.nf
\fBdiskscan\fR [\fB-W\fR] [\fB-n\fR] [\fB-y\fR] \fIraw_device\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBdiskscan\fR is used by the system administrator to perform surface analysis
on a portion of a hard disk. The disk portion may be a raw partition or slice;
it is identified using its raw device name. By default, the specified portion
of the disk is read (non-destructive) and errors reported on standard error. In
addition, a progress report is printed on standard out. The list of bad blocks
should be saved in a file and later fed into \fBaddbadsec\fR(8), which will
remap them.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
Causes  \fBdiskscan\fR to suppress linefeeds when printing progress information
on standard out.
.RE

.sp
.ne 2
.na
\fB\fB-W\fR\fR
.ad
.RS 6n
Causes \fBdiskscan\fR to perform write and read surface analysis. This type of
surface analysis is destructive and should be invoked with caution.
.RE

.sp
.ne 2
.na
\fB\fB-y\fR\fR
.ad
.RS 6n
Causes  \fBdiskscan\fR to suppress the warning regarding destruction of
existing data that is issued when  \fB-W\fR is used.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.na
\fB\fIraw_device\fR\fR
.ad
.RS 14n
The address of the disk drive (see \fBFILES\fR).
.RE

.SH FILES
.sp
.LP
The raw device should be \fB/dev/rdsk/c?[t?]d?[ps]?\fR. See \fBdisks\fR(8) for
an explanation of \fBSCSI\fR and \fBIDE\fR device naming conventions.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (7),
.BR addbadsec (8),
.BR disks (8),
.BR fdisk (8),
.BR fmthard (8),
.BR format (8)
.SH NOTES
.sp
.LP
The \fBformat\fR(8) utility is available to format, label, analyze, and repair
\fBSCSI\fR disks. This utility is included with the \fBdiskscan\fR,
\fBaddbadsec\fR(8), \fBfdisk\fR(8), and \fBfmthard\fR(8) commands available
for x86. To format an \fBIDE\fR disk, use the \fB DOS\fR \fBformat\fR utility;
however, to label, analyze, or repair \fBIDE\fR disks on x86 systems, use the
Solaris \fBformat\fR(8) utility.
