illumos/illumos-gate/usr/src/man/man8/drvconfig.8
'\" te
.\" Copyright (c) 2002 Sun Microsystems, Inc. All
.\" Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DRVCONFIG 8 "Aug 9, 2004"
.SH NAME
drvconfig \- apply permission and ownership changes to devices
.SH SYNOPSIS
.LP
.nf
\fBdrvconfig\fR [\fB-bn\fR] [\fB-a\fR \fIalias_name\fR] [\fB-c\fR \fIclass_name\fR]
     [\fB-i\fR \fIdrivername\fR] [\fB-m\fR \fImajor_num\fR] [\fB-r\fR \fIroot_dir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBdevfsadm\fR(8) is now the preferred command and should be used instead of
\fBdrvconfig\fR.
.sp
.LP
The default operation of \fBdrvconfig\fR is to apply permission and ownership
changes to devices. Normally, this command is run automatically after a new
driver has been installed (with \fBadd_drv\fR(8)) and the system has been
rebooted.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-a\fR\fIalias_name\fR\fR
.ad
.RS 16n
Add the name \fIalias_name\fR to the list of aliases that this driver is known
by. This option, if used, must be used with the \fB-m\fR \fImajor_num\fR, the
\fB-b\fR and the \fB-i\fR \fIdrivername\fR options.
.RE

.sp
.ne 2
.na
\fB\fB-b\fR\fR
.ad
.RS 16n
Add a new major number to name binding into the kernel's internal
\fBname_to_major\fR tables. This option is not normally used directly, but is
used by other utilities such as \fBadd_drv\fR(8). Use of the \fB-b\fR option
requires that \fB-i\fR and \fB-m\fR be used also. No \fB/devices\fR entries are
created.
.RE

.sp
.ne 2
.na
\fB\fB-c\fR\fIclass_name\fR\fR
.ad
.RS 16n
The driver being added to the system exports the class \fIclass_name\fR. This
option is not normally used directly, but is used by other utilities. It is
only effective when used with the \fB-b\fR option.
.RE

.sp
.ne 2
.na
\fB\fB-i\fR\fIdrivername\fR\fR
.ad
.RS 16n
Only configure the devices for the named driver. The following options are used
by the implementation of \fBadd_drv\fR(8) and \fBrem_drv\fR(8), and may not
be supported in future versions of Solaris:
.RE

.sp
.ne 2
.na
\fB\fB-m\fR\fImajor_num\fR\fR
.ad
.RS 16n
Specify the major number \fImajor_num\fR for this driver to add to the kernel's
\fBname_to_major\fR binding tables.
.RE

.sp
.ne 2
.na
\fB\fB-n\fR\fR
.ad
.RS 16n
Do not try to load and attach any drivers, or if the \fB-i\fR option is given,
do not try to attach the driver named \fIdrivername\fR.
.RE

.sp
.ne 2
.na
\fB\fB-r\fR\fIroot_dir\fR\fR
.ad
.RS 16n
Perform operations under \fIroot_dir\fR, rather than directly under \fBroot\fR.
.RE

.SH EXIT STATUS
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 12n
Successful completion.
.RE

.sp
.ne 2
.na
\fBnon-zero\fR
.ad
.RS 12n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/devices\fR\fR
.ad
.RS 23n
Device nodes directory
.RE

.sp
.ne 2
.na
\fB\fB/etc/minor_perm\fR\fR
.ad
.RS 23n
Minor mode permissions
.RE

.sp
.ne 2
.na
\fB\fB/etc/name_to_major\fR\fR
.ad
.RS 23n
Major number binding
.RE

.sp
.ne 2
.na
\fB\fB/etc/driver_classes\fR\fR
.ad
.RS 23n
Driver class binding file
.RE

.SH SEE ALSO
.sp
.LP
.BR sh (1),
.BR devfs (4FS),
.BR path_to_inst (5),
.BR attributes (7),
.BR add_drv (8),
.BR modinfo (8),
.BR modload (8),
.BR modunload (8),
.BR rem_drv (8),
.BR update_drv (8)
