illumos/illumos-gate/usr/src/man/man8/fiocompress.8
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FIOCOMPRESS 8 "Dec 10, 2008"
.SH NAME
fiocompress \- file compression utility
.SH SYNOPSIS
.LP
.nf
\fB/sbin/fiocompress\fR \fB-c\fR [\fB-m\fR] [\fB-b\fR \fIblock_size\fR] \fIinput_file\fR \fIoutput_file\fR
.fi

.LP
.nf
\fB/sbin/fiocompress\fR \fB-d\fR \fIinput_file\fR \fIoutput_file\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfiocompress\fR utility is a file compression tool that works together
with the \fBdcfs\fR(4FS) file system to perform per-file compression. You can
use \fBfiocompress\fR to decompress a compressed file or mark a compressed file
as compressed, causing automatic decompression on read. The primary use of
\fBfiocompress\fR is to compress files in the boot archive.
.sp
.LP
Note that this utility is not a Committed interface. See \fBattributes\fR(7).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-b\fR \fIblock_size\fR\fR
.ad
.sp .6
.RS 4n
Specify a block size for compression. The default block size is 8192.
.RE

.sp
.ne 2
.na
\fB\fB-c\fR\fR
.ad
.sp .6
.RS 4n
Compress the specified file.
.RE

.sp
.ne 2
.na
\fB\fB-d\fR\fR
.ad
.sp .6
.RS 4n
Decompress the specified file.
.RE

.sp
.ne 2
.na
\fB\fB-m\fR\fR
.ad
.sp .6
.RS 4n
Mark the compressed file for automatic decompression on read. Can be used only
in conjunction with \fB-c\fR.
.RE

.SH EXIT STATUS
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.sp .6
.RS 4n
The command completed successfully.
.RE

.sp
.ne 2
.na
\fB\fB-1\fR\fR
.ad
.sp .6
.RS 4n
The command exited due to an error.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Private
.TE

.SH SEE ALSO
.sp
.LP
.BR dcfs (4FS),
.BR ufs (4FS),
.BR attributes (7),
.BR boot (8),
.BR bootadm (8)
.SH NOTES
.sp
.LP
This compression/decompression utility works only with files stored in a UFS
file system.
.sp
.LP
There is no obvious way to determine whether a given file is compressed, other
than copying the file and comparing the number of disk blocks of the copy
against the original.
