illumos/illumos-gate/usr/src/man/man8/hal-fdi-validate.8
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH HAL-FDI-VALIDATE 8 "Aug 28, 2006"
.SH NAME
hal-fdi-validate \- validate HAL device information files
.SH SYNOPSIS
.LP
.nf
\fBhal-fdi-validate\fR  [\fB-f\fR \fIdtd\fR] \fIfile\fR [\fIfile\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBhal-fdi-validate\fR command validates one or more device information
files. See \fBfdi\fR(5). The standard DTD file will be used unless the \fB-f\fR
option is used to specify a different file.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.na
\fB\fB-f\fR \fIdtd\fR\fR
.ad
.RS 10n
Specify path to a DTD file.
.RE

.SH OPERANDS
.sp
.LP
The \fBhal-fdi-validate\fR command accepts the following operand(s):
.sp
.ne 2
.na
\fB\fIfile\fR [\fIfile\fR...]\fR
.ad
.RS 18n
One or more DTD files to be validated.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Volatile
.TE

.SH SEE ALSO
.sp
.LP
.BR fdi (5),
.BR attributes (7),
.BR hal (7),
.BR hald (8)
