illumos/illumos-gate/usr/src/man/man8/ktkt_warnd.8
'\" te
.\" Copyright 1987, 1989 by the Student Information Processing Board of the Massachusetts Institute of Technology.  For copying and distribution information,  please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH KTKT_WARND 8 "Mar 21, 2005"
.SH NAME
ktkt_warnd \- Kerberos warning daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/krb5/ktkt_warnd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBktkt_warnd\fR is a daemon on Kerberos clients that can warn users when their
Kerberos tickets are about to expire or renew the tickets before they expire.
It is invoked by \fBinetd\fR when a ticket-granting ticket (TGT) is obtained
for the first time, such as after using the \fBkinit\fR command.
\fBktkt_warnd\fR can be configured through the \fB/etc/krb5/warn.conf\fR file
on the client. In \fBwarn.conf\fR, you can specify that you be supplied notice,
through \fBsyslog\fR or terminal or mail, of ticket expiration or to renew the
TGT.
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/krb5/warn.conf\fR\fR
.ad
.RS 23n
Kerberos warning configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR warn.conf (5),
.BR attributes (7),
.BR kerberos (7),
.BR smf (7),
.BR inetadm (8),
.BR inetd (8),
.BR svcadm (8)
.SH NOTES
.sp
.LP
The \fBktkt_warnd\fR service is managed by the service management facility,
\fBsmf\fR(7), under the service identifier:
.sp
.in +2
.nf
svc:/network/security/ktkt_warn:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(8). Responsibility for
initiating and restarting this service is delegated to \fBinetd\fR(8). Use
\fBinetadm\fR(8) to make configuration changes and to view configuration
information for this service. The service's status can be queried using the
\fBsvcs\fR(1) command.
