illumos/illumos-gate/usr/src/man/man8/labelit_ufs.8
'\" te
.\" Copyright (c) 2003 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH LABELIT_UFS 8 "Apr 15, 2003"
.SH NAME
labelit_ufs \- provide and print labels for ufs file systems
.SH SYNOPSIS
.LP
.nf
\fBlabelit\fR \fB-F\fR ufs [\fIgeneric_options\fR] \fIspecial\fR [\fIfsname\fR \fIvolume\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBlabelit\fR is used to write labels on unmounted disk file systems. Such
labels may be used to uniquely identify volumes and are used by volume-oriented
programs such as \fBvolcopy\fR(8).
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.na
\fB\fIgeneric_options\fR\fR
.ad
.RS 19n
options supported by the generic  \fBlabelit\fR command. See
\fBlabelit\fR(8).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.na
\fB\fIspecial\fR\fR
.ad
.RS 11n
name should be the physical disk section (for example, \fB/dev/dsk/c0d0s6\fR).
The device may not be on a remote machine.
.RE

.sp
.ne 2
.na
\fB\fIfsname\fR\fR
.ad
.RS 11n
represents the mount point (for example, \fBroot\fR, \fBu1\fR, and so on) of
the file system.
.RE

.sp
.ne 2
.na
\fB\fIvolume\fR\fR
.ad
.RS 11n
may be used to represent the physical volume name.
.RE

.sp
.LP
If  \fIfsname\fR and  \fIvolume\fR are not specified, \fBlabelit\fR prints the
current values of these labels.  Both  \fIfsname\fR and  \fIvolume\fR are
limited to six or fewer characters.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 12n
Write or display of labels was successful.
.RE

.sp
.ne 2
.na
\fBnon-zero\fR
.ad
.RS 12n
An error occurred.
.RE

.SH SEE ALSO
.sp
.LP
.BR ufs (4FS),
.BR attributes (7),
.BR labelit (8),
.BR volcopy (8)
