illumos/illumos-gate/usr/src/man/man8/ldap_cachemgr.8
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH LDAP_CACHEMGR 8 "May 13, 2017"
.SH NAME
ldap_cachemgr \- LDAP daemon to manage client configuration for LDAP based
Network Information Service lookups
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ldap/ldap_cachemgr\fR [\fB-l\fR \fIlog-file\fR] [\fB-g\fR]
.fi

.SH DESCRIPTION
.LP
The \fBldap_cachemgr\fR daemon is a process that provides an up-to-date
configuration cache for LDAP naming services. It is started during multi-user
boot.
.sp
.LP
The \fBldap_cachemgr\fR utility provides caching for all parameters as
specified and used by the LDAP naming service clients. The \fBldap_cachemgr\fR
utility uses the cache files which are originally created by executing the
\fBldapclient\fR(8) utility, as cold start files. Updates to the cache files
take place dynamically if profiles are used to configure the client. See the
\fBinit\fR option to \fBldapclient\fR(8).
.sp
.LP
The \fBldap_cachemgr\fR utility helps improve the performance of the clients
that are using LDAP as the Naming service repository. In order for the LDAP
naming services to function properly, the \fBldap_cachemgr\fR daemon must be
running. \fBldap_cachemgr\fR also improves system security by making the
configuration files readable by superuser only.
.sp
.LP
The cache maintained by this daemon is shared by all the processes that access
LDAP Naming information. All processes access this cache through a door call.
On startup, \fBldap_cachemgr\fR initializes the cache from the cache files. See
\fBldapclient\fR(8). Thus, the cache survives machine reboots.
.sp
.LP
The \fBldap_cachemgr\fR daemon also acts as its own administration tool. If an
instance of \fBldap_cachemgr\fR is already running, commands are passed
transparently to the running version.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
Print current configuration and statistics to standard output. This is the only
option executable without superuser privileges.
.RE

.sp
.ne 2
.na
\fB\fB-l\fR \fIlog-file\fR\fR
.ad
.sp .6
.RS 4n
Cause \fBldap_cachemgr\fR to use a log file other than the default
\fB/var/ldap/cachemgr.log\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRStopping and Restarting the \fBldap_cachemgr\fR Daemon
.sp
.LP
The following example shows how to stop and to restart the \fBldap_cachemgr\fR
daemon.

.sp
.in +2
.nf
example# svcadm disable network/ldap/client
example# svcadm enable network/ldap/client
.fi
.in -2
.sp

.LP
\fBExample 2 \fRForcing \fBldap_cachemgr\fR to Reread Configuration Files
.sp
.LP
The following example shows how to force \fBldap_cachemgr\fR to reread the
\fB/var/ldap/ldap_client_file\fR and \fB/var/ldap/ldap_client_cred\fR files

.sp
.in +2
.nf
example# pkill -HUP ldap_cachemgr
.fi
.in -2
.sp

.SH FILES
.ne 2
.na
\fB\fB/var/ldap/cachemgr.log\fR\fR
.ad
.sp .6
.RS 4n
Default log file.
.RE

.sp
.ne 2
.na
\fB\fB/var/ldap/ldap_client_file\fR\fR
.ad
.br
.na
\fB\fB/var/ldap/ldap_client_cred\fR\fR
.ad
.sp .6
.RS 4n
Files containing the LDAP configuration of the client. These files are not to
be modified manually. Their content is not guaranteed to be human readable. Use
\fBldapclient\fR(8) to update these files.
.RE

.SH WARNINGS
.LP
The \fBldap_cachemgr\fR utility is included in the current Solaris release on
an uncommitted basis only. It is subject to change or removal in a future minor
release.
.SH SEE ALSO
.LP
.BR ldap (1),
.BR ldapadd (1),
.BR ldapdelete (1),
.BR ldaplist (1),
.BR ldapmodify (1),
.BR ldapmodrdn (1),
.BR ldapsearch (1),
.BR pkill (1),
.BR svcs (1),
.BR signal.h (3HEAD),
.BR resolv.conf (5),
.BR attributes (7),
.BR smf (7),
.BR idsconfig (8),
.BR ldapaddent (8),
.BR ldapclient (8),
.BR svcadm (8)
.SH NOTES
.LP
The \fBldap_cachemgr\fR service is managed by the service management facility,
\fBsmf\fR(7), under the service identifier:
.sp
.in +2
.nf
svc:/network/ldap/client
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(8). The service's
status can be queried using the \fBsvcs\fR(1) command.
