illumos/illumos-gate/usr/src/man/man8/ppdmgr.8
'\" te
.\"  Copyright (c) 2007 by Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH PPDMGR 8 "March 12, 2023"
.SH NAME
ppdmgr \- utility for managing PPD files
.SH SYNOPSIS
.nf
\fBppdmgr\fR \fB-a\fR \fIppd_filename_path\fR [\fB-L\fR \fIlabel\fR] [\fB-R\fR \fIppd_repository_name\fR] [\fB-w\fR]
.fi

.LP
.nf
\fBppdmgr\fR \fB-r\fR [\fB-L\fR \fIlabel\fR] [\fB-R\fR \fIppd_repository_name\fR]
.fi

.LP
.nf
\fBppdmgr\fR \fB-u\fR [\fB-L\fR \fIlabel\fR] [\fB-R\fR \fIppd_repository_name\fR]
.fi

.SH DESCRIPTION
The PPD File Manager adds PPD files to the print system's PPD file
repositories.
.sp
.LP
Multiple PPD file repositories may be available. PPD files that are supplied
with the system are available in the "\fBsystem\fR" repository. PPD files that
are supplied by third party vendors may be available in the "\fBvendor\fR"
repository. PPD files that are supplied by system administrators may be
available in the "\fBadmin\fR" repository, and PPD files that are added using
this utility are available in the "\fBuser\fR" repository.
.sp
.LP
PPD files are grouped under a user-provided "label" within the print system's
PPD file repository. The special reserved label name "\fBall\fR" can be used to
specify all of the available labels in a PPD file repository. The results are
undefined if a label name contains characters that are not in the portable
filename character set or if a label name starts with a hyphen (-). A label
name may not contain a semi-colon (:).
.SH OPTIONS
The following subcommand are supported:
.sp
.ne 2
.na
\fB\fB-a\fR \fIppd_file_path\fR\fR
.ad
.sp .6
.RS 4n
Adds a copy of \fIppd_file_path\fR to the system under the specified label in
the specified repository, where \fIppd_file_path\fR is the full path and file
name to the PPD file. The utility accepts a valid PPD file with either a
\fB\&.ppd\fR or \fB\&.ppd.gz\fR (gzipped) extension.
.RE

.sp
.ne 2
.na
\fB\fB-L\fR \fIlabel\fR\fR
.ad
.sp .6
.RS 4n
Specifies a label to group PPD files under. When specified with the \fB-a\fR
option, the default label is "\fBuser\fR". When specified with the \fB-r\fR or
\fB-u\fR option, the default label is "\fBall\fR". The following are reserved
labels:
.sp
.ne 2
.na
\fB\fBcaches\fR\fR
.ad
.RS 16n
may never be specified
.RE

.sp
.ne 2
.na
\fB\fBppdcache\fR\fR
.ad
.RS 16n
may never be specified
.RE

.sp
.ne 2
.na
\fB\fBmanufaliases\fR\fR
.ad
.RS 16n
may never be specified
.RE

.sp
.ne 2
.na
\fB\fBall\fR\fR
.ad
.RS 16n
applies the specified action to all labels in a repository, and may only be
specified with the \fB-r\fR or \fB-u\fR option.
.RE

.sp
.ne 2
.na
\fB\fBSUNW*\fR\fR
.ad
.RS 16n
anything starting with \fBSUNW\fR is reserved and should not be specified with
the \fB-a\fR option.
.RE

.RE

.sp
.ne 2
.na
\fB\fB-R\fR \fIrepository_name\fR\fR
.ad
.sp .6
.RS 4n
Specifies the name of a PPD file repository representing one of the PPD file
installation locations. Possible repository names include: "\fBuser\fR",
"\fBadmin\fR", "\fBvendor\fR", "\fBsystem\fR", and "\fBall\fR".
.sp
The repository name "\fBall\fR" signifies all of the possible repository names.
The default repository name is "\fBuser\fR". Only the "\fBuser\fR" or
"\fBadmin\fR" repository may be specified with the \fB-a\fR option.
.RE

.sp
.ne 2
.na
\fB\fB-r\fR\fR
.ad
.sp .6
.RS 4n
Rebuilds the cache information for the specified label in the specified
repository.
.RE

.sp
.ne 2
.na
\fB\fB-u\fR\fR
.ad
.sp .6
.RS 4n
Updates the cache information for the specified label in the specified
repository.
.RE

.sp
.ne 2
.na
\fB\fB-w\fR\fR
.ad
.sp .6
.RS 4n
Write the full path of the added PPD file. This option is only valid with the
\fB-a\fR option. Otherwise, this option is ignored.
.RE

.SH EXAMPLES
\fBExample 1 \fRAdding a copy of a PPD file to the repository
.sp
.LP
The following commands add a copy of a PPD file to the "\fBuser\fR" repository
under the "\fBuser\fR" label:

.sp
.in +2
.nf
# ppdmgr -a /net/somesystem/ppdfiles/ppdfile.ppd
.fi
.in -2
.sp

.sp
.LP
or

.sp
.in +2
.nf
# ppdmgr -a /net/somesystem/ppdfiles/ppdfile.ppd -L user
.fi
.in -2
.sp

.sp
.LP
The following command adds a copy of a PPD file to the "\fBuser\fR" repository
under the "\fBPhoto\fR" label and write the full path of the added copy to
standard output:

.sp
.in +2
.nf
# ppdmgr -a /net/somesystem/ppdfiles/ppdfile.ppd -L "Photo" -w
.fi
.in -2
.sp

.LP
\fBExample 2 \fRUpdating the cache for the PPD files
.sp
.LP
The following commands update the cache for the PPD files under the "\fBall\fR"
labels in the "\fBuser\fR" repository:

.sp
.in +2
.nf
 # ppdmgr -u
.fi
.in -2
.sp

.sp
.LP
or

.sp
.in +2
.nf
 # ppdmgr -u -R user -L all
.fi
.in -2
.sp

.sp
.LP
The following command updates the cache for the PPD files under the "photo"
label in the "\fBuser\fR" repository:

.sp
.in +2
.nf
 # ppdmgr -u -R user -L Photo
.fi
.in -2
.sp

.LP
\fBExample 3 \fRRebuilding the cache for the PPD files
.sp
.LP
The following command rebuilds the cache for the PPD files under the "Photo"
label in the "\fBuser\fR" repository:

.sp
.in +2
.nf
# ppdmgr -r -R user -L Photo
.fi
.in -2
.sp

.SH EXIT STATUS
The following exit values are returned:
.sp
.ne 2
.na
\fB\fB0\fR\fR
.ad
.RS 6n
Successful completion.
.RE

.sp
.ne 2
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
An error occurred.
.RE

.SH ATTRIBUTES
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.BR attributes (7)
