illumos/illumos-gate/usr/src/man/man8/rem_drv.8
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH REM_DRV 8 "Aug 13, 2007"
.SH NAME
rem_drv \- remove a device driver from the system
.SH SYNOPSIS
.LP
.nf
\fBrem_drv\fR [\fB-b\fR \fIbasedir\fR] \fIdevice_driver\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBrem_drv\fR command informs the system that the device driver
\fIdevice_driver\fR is no longer valid. If possible, \fBrem_drv\fR unloads
\fIdevice_driver\fR from memory. \fBrem_drv\fR also updates the system driver
configuration files.
.sp
.LP
If \fBrem_drv\fR has been executed, the next time the system is rebooted it
automatically performs a reconfiguration boot (see \fBkernel\fR(8)).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-b\fR \fIbasedir\fR\fR
.ad
.sp .6
.RS 4n
Sets the path to the root directory of the diskless client. Used on the server
to execute \fBrem_drv\fR for a client. The client machine must be rebooted to
unload the driver.
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with the
\fB-b\fR option. Doing so might damage the global zone's file system, might
compromise the security of the global zone, and might damage the non-global
zone's file system. See \fBzones\fR(7).
.RE
.RE

.sp
.ne 2
.na
\fB\fB-C\fR\fR
.ad
.sp .6
.RS 4n
Remove dangling device attribute nodes bound to the driver being removed. This
causes any device ownership or permissions customizations made to any node not
to  be preserved if the driver is added back. Recommended for use when
reprovisioning a machine from one configuration or use to another where past
administrative customizations might not be desired.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRRemoving the \fBsd\fR Driver
.sp
.LP
The following example removes the \fBsd\fR driver from use:

.sp
.in +2
.nf
example% rem_drv sd
.fi
.in -2
.sp

.LP
\fBExample 2 \fRRemoving a Diskless Client
.sp
.LP
The following example removes the driver from the \fBsun1\fR diskless client.
The driver is not uninstalled or unloaded until the client machine is rebooted.

.sp
.in +2
.nf
example% rem_drv \fB-b\fR /export/root/sun1 sd
.fi
.in -2
.sp

.sp
.LP
Note the caveat on the use of the \fB-b\fR option in the description of that
option, above.

.SH SEE ALSO
.sp
.LP
.BR devfs (4FS),
.BR attributes (7),
.BR zones (7),
.BR add_drv (8),
.BR kernel (8),
.BR update_drv (8)
