illumos/illumos-gate/usr/src/man/man8/remove_allocatable.8
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH REMOVE_ALLOCATABLE 8 "Jul 20, 2007"
.SH NAME
remove_allocatable \- remove entries from allocation databases
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/remove_allocatable\fR  [\fB-f\fR] \fB-n\fR \fIname\fR
.fi

.LP
.nf
\fB/usr/sbin/remove_allocatable\fR  [\fB-f\fR] [\fB-d\fR] \fB-t\fR \fIdev-type\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBremove_allocatable\fR removes entries of user allocatable devices from the
device allocation mechanism. \fBremove_allocatable\fR also removes entries of
some non-allocatable devices, such as printers, whose label range is managed by
the mechanism.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-d\fR\fR
.ad
.RS 15n
Removes  system-supplied  default attributes of the device type that is
specified with \fB-t\fR.
.RE

.sp
.ne 2
.na
\fB\fB-f\fR\fR
.ad
.RS 15n
Force the removal of an entry. \fBremove_allocatable\fR exits with an error if
this option is not specified when an entry with the specified device name no
longer exists.
.RE

.sp
.ne 2
.na
\fB\fB-n\fR \fIname\fR\fR
.ad
.RS 15n
Removes the entry for the device \fIname\fR.
.RE

.sp
.ne 2
.na
\fB\fB-t\fR \fIdev-type\fR\fR
.ad
.RS 15n
Removes devices of type \fIdev-type\fR.
.RE

.SH EXIT STATUS
.sp
.LP
When successful, \fBremove_allocatable\fR returns an exit status of \fB0\fR
(true). \fBremove_allocatable\fR returns a nonzero exit status in the event of
an error. The exit codes are as follows:
.sp
.ne 2
.na
\fB\fB1\fR\fR
.ad
.RS 5n
Invocation syntax error
.RE

.sp
.ne 2
.na
\fB\fB2\fR\fR
.ad
.RS 5n
Unknown system error
.RE

.sp
.ne 2
.na
\fB\fB3\fR\fR
.ad
.RS 5n
Device \fIname\fR or \fIdev-type\fR not found. This error occurs only when the
\fB-f\fR option is not specified.
.RE

.sp
.ne 2
.na
\fB\fB4\fR\fR
.ad
.RS 5n
Permission denied. User does not have DAC or MAC access to database.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	See below.
.TE

.sp
.LP
The invocation is Uncommitted. The options are Uncommitted. The output is
Not-an-Interface.
.SH SEE ALSO
.sp
.LP
.BR allocate (1),
.BR deallocate (1),
.BR attributes (7),
.BR device_clean (7),
.BR add_allocatable (8)
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the system
is configured with Trusted Extensions.
