illumos/illumos-gate/usr/src/man/man8/rpc.bootparamd.8
'\" te
.\"  Copyright 1989 AT&T
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH RPC.BOOTPARAMD 8 "Aug 1, 2004"
.SH NAME
rpc.bootparamd, bootparamd \- boot parameter server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rpc.bootparamd\fR [\fB-d\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBrpc.bootparamd\fR is a server process that provides information from a
\fBbootparams\fR database to diskless clients at boot time. See
.BR bootparams (5)
.sp
.LP
The source for the \fBbootparams\fR database is determined by the
\fBnsswitch.conf\fR(5) file (on the machine running the \fBrpc.bootparamd\fR
process).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
Display debugging information.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/bootparams\fR\fR
.ad
.RS 22n
boot parameter data base
.RE

.sp
.ne 2
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 22n
configuration file for the name-service switch
.RE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR bootparams (5),
.BR nsswitch.conf (5),
.BR attributes (7),
.BR smf (7),
.BR svcadm (8)
.SH NOTES
.sp
.LP
A diskless client requires service from at least one \fBrpc.bootparamd\fR
process running on a server that is on the same IP subnetwork as the diskless
client.
.sp
.LP
Some routines that compare hostnames use case-sensitive string comparisons;
some do not. If an incoming request fails, verify that the case of the
hostname in the file to be parsed matches the case of the hostname called  for,
and attempt the request again.
.sp
.LP
The \fBrpc.bootparamd\fR service is managed by the service management facility,
\fBsmf\fR(7), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/bootparams
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(8). The service's
status can be queried using the \fBsvcs\fR(1) command.
