illumos/illumos-gate/usr/src/man/man8/smbiod.8
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SMBIOD 8 "Jul 7, 2009"
.SH NAME
smbiod \- SMB client I/O daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/smbfs/smbiod\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBsmbiod\fR is a helper program that initiates an SMB reconnection, when
needed.
.sp
.LP
When a user runs an \fBsmbutil\fR or \fBmount_smbfs\fR command, an \fBsmbiod\fR
process is started and continues to run until that user no longer has any SMB
client connections. Only one \fBsmbiod\fR process runs for each user that has
SMB client connections.
.sp
.LP
Each \fBsmbiod\fR process instantiates a door service on one of the following
files:
.RS +4
.TP
.ie t \(bu
.el o
\fB/tmp/.smbiod-\fIUID\fR\fR file for normal users
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/var/run/smbiod-0\fR file for superuser
.RE
.sp
.LP
The \fBsmbiod\fR daemon has no external, customer-accessible interfaces.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.na
\fB0\fR
.ad
.RS 13n
Successful completion.
.RE

.sp
.ne 2
.na
\fB>0\fR
.ad
.RS 13n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/usr/lib/smbfs/smbiod\fR\fR
.ad
.RS 25n
SMB I/O daemon.
.RE

.sp
.ne 2
.na
\fB\fB/tmp/.smbiod-\fIUID\fR\fR\fR
.ad
.RS 25n
File on which to instantiate a door service for user \fIUID\fR.
.RE

.sp
.ne 2
.na
\fB\fB/var/run/smbiod-0\fR\fR
.ad
.RS 25n
File on which to instantiate a door service for superuser.
.RE

.SH ATTRIBUTES
.sp
.LP
See the \fBattributes\fR(7) man page for descriptions of the following
attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Uncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR ps (1),
.BR smbutil (1),
.BR smbfs (4FS),
.BR attributes (7),
.BR mount_smbfs (8)
