illumos/illumos-gate/usr/src/man/man8/sulogin.8
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 2008 Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SULOGIN 8 "Aug 21, 2008"
.SH NAME
sulogin \- access single-user mode
.SH SYNOPSIS
.LP
.nf
\fBsulogin\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsulogin\fR utility is automatically invoked by \fBinit\fR when the
system is first started. It prompts the user to type a user name and password
to enter system maintenance mode (single-user mode) or to type \fBEOF\fR
(typically CTRL-D) for normal startup (multi-user mode). The user should never
directly invoke \fBsulogin\fR. The user must have the
\fBsolaris.system.maintenance\fR authorization.
.sp
.LP
The \fBsulogin\fR utility can prompt the user to enter the root password on a
variable number of serial console devices, in addition to the traditional
console device. See \fBconsadm\fR(8) and \fBmsglog\fR(4D) for a description of
how to configure a serial device to display the single-user login prompt.
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/default/sulogin\fR\fR
.ad
.sp .6
.RS 4n
Default value can be set for the following flag:
.sp
.ne 2
.na
\fBPASSREQ\fR
.ad
.sp .6
.RS 4n
Determines if login requires a password. Default is \fBPASSREQ=YES\fR.
.RE

.RE

.sp
.ne 2
.na
\fB\fB/etc/default/login\fR\fR
.ad
.sp .6
.RS 4n
Default value can be set for the following flag:
.sp
.ne 2
.na
\fB\fBSLEEPTIME\fR\fR
.ad
.sp .6
.RS 4n
If present, sets the number of seconds to wait before login failure is printed
to the screen and another login attempt is allowed. Default is \fB4\fR seconds.
Minimum is \fB0\fR seconds. Maximum is \fB5\fR seconds.
.sp
Both \fBsu\fR(8) and \fBlogin\fR(1) are affected by the value of
\fBSLEEPTIME\fR.
.RE

.RE

.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR login (1),
.BR msglog (4D),
.BR attributes (7),
.BR consadm (8),
.BR init (8),
.BR su (8)
.SH NOTES
.sp
.LP
By default, the root user has all authorizations.
.sp
.LP
Granting the \fBsolaris.system.maintenance\fR authorization to the Console User
Rights Profile may have an undesirable side effect of granting the currently
logged in user maintenance mode access. The \fBsolaris.system.maintenance\fR
authorization should be directly granted to appropriate users rather than
through the Console User Rights Profile.
