illumos/illumos-gate/usr/src/man/man8/uusched.8
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH UUSCHED 8 "May 19, 1993"
.SH NAME
uusched \- uucp file transport program scheduler
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/uucp/uusched\fR [\fB-u\fR \fIdebug-level\fR] [\fB-x\fR \fIdebug-level\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBuusched\fR is the  \fBuucp\fR(1C) file transport scheduler. It is usually
started by the daemon \fIuudemon.hour\fR that is started by  \fBcron\fR(8)
from an entry in user \fBuucp\fR's crontab file:
.sp
.LP
\fB11,41 * * * * /etc/uucp/uucp/uudemon.hour\fR
.SH OPTIONS
.sp
.LP
The options are for debugging purposes only. \fIdebug-level\fR is a number
between  \fB0\fR and  \fB9\fR. Higher numbers give more detailed debugging
information:
.sp
.LP
The following options are supported:
.sp
.ne 2
.na
\fB\fB-u\fR\fI debug-level\fR\fR
.ad
.RS 18n
Passes the \fB-u\fR\fI debug-level\fR option  \fBuucico\fR(8) as \fB-x\fR\fI
debug-level.\fR
.RE

.sp
.ne 2
.na
\fB\fB-x\fR\fI debug-level\fR\fR
.ad
.RS 18n
Outputs debugging messages from  \fBuusched\fR.
.RE

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/uucp/Devices\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Permissions\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/etc/uucp/Systems\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/locks/*\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/uucp/*\fR\fR
.ad
.RS 27n

.RE

.sp
.ne 2
.na
\fB\fB/var/spool/uucppublic/*\fR\fR
.ad
.RS 27n

.RE

.SH SEE ALSO
.sp
.LP
.BR uucp (1C),
.BR uustat (1C),
.BR uux (1C),
.BR attributes (7),
.BR cron (8),
.BR uucico (8)
