illumos/illumos-gate/usr/src/man/man9f/ASSERT.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ASSERT 9F "Jan 16, 2006"
.SH NAME
ASSERT, assert \- expression verification
.SH SYNOPSIS
.LP
.nf
#include <sys/debug.h>



\fBvoid\fR \fBASSERT\fR(\fB\fR\fIEX\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIEX\fR\fR
.ad
.RS 6n
boolean expression.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBASSERT()\fR macro checks to see if the expression \fIEX\fR is true. If
it is not, then \fBASSERT()\fR causes an error message to be logged to the
console and the system to panic. \fBASSERT()\fR works only if the preprocessor
symbol \fBDEBUG\fR is defined.
.SH CONTEXT
.sp
.LP
The \fBASSERT()\fR macro can be used from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
\fIWriting Device Drivers\fR
