illumos/illumos-gate/usr/src/man/man9f/biofini.9f
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.,  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH BIOFINI 9F "Nov 20, 1996"
.SH NAME
biofini \- uninitialize a buffer structure
.SH SYNOPSIS
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBvoid\fR \fBbiofini\fR(\fBstruct buf *\fR\fIbp\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fIbp\fR\fR
.ad
.RS 6n
Pointer to the buffer header structure.
.RE

.SH DESCRIPTION
The \fBbiofini()\fR function uninitializes a \fBbuf\fR(9S) structure. If a
buffer structure has been allocated and initialized using \fBkmem_alloc\fR(9F)
and \fBbioinit\fR(9F) it needs to be uninitialized using \fBbiofini()\fR before
calling \fBkmem_free\fR(9F). It is not necessary to call \fBbiofini()\fR before
freeing a buffer structure using \fBfreerbuf\fR(9F) because \fBfreerbuf()\fR
will call \fBbiofini()\fR directly.
.SH CONTEXT
The \fBbiofini()\fR function can be called from any context.
.SH EXAMPLES
\fBExample 1 \fRUsing \fBbiofini()\fR
.sp
.in +2
.nf
struct buf *bp = kmem_alloc(biosize(), KM_SLEEP);
bioinit(bp);
/* use buffer */
biofini(bp);
kmem_free(bp, biosize());
.fi
.in -2

.SH SEE ALSO
\fBbioinit\fR(9F), \fBbioreset\fR(9F), \fBbiosize\fR(9F), \fBfreerbuf\fR(9F),
\fBkmem_alloc\fR(9F), \fBkmem_free\fR(9F), \fBbuf\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
