illumos/illumos-gate/usr/src/man/man9f/csx_GetHandleOffset.9f
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CSX_GETHANDLEOFFSET 9F "May 16, 1997"
.SH NAME
csx_GetHandleOffset \- return current access handle offset
.SH SYNOPSIS
.nf
#include <sys/pccard.h>

\fBint32_t\fR \fBcsx_GetHandleOffset\fR(\fBacc_handle_t\fR \fIhandle\fR, \fBuint32_t *\fR\fIoffset\fR);
.fi

.SH INTERFACE LEVEL
illumos \fBDDI \fRSpecific (illumos \fBDDI) \fR
.SH PARAMETERS
.ne 2
.na
\fB\fIhandle\fR \fR
.ad
.RS 11n
Access handle returned by \fBcsx_RequestIRQ\fR(9F) or \fBcsx_RequestIO\fR(9F).
.RE

.sp
.ne 2
.na
\fB\fIoffset\fR \fR
.ad
.RS 11n
Pointer to a \fBuint32_t\fR in which the current access handle offset is
returned.
.RE

.SH DESCRIPTION
This function returns the current offset for the access handle, \fIhandle\fR,
in \fIoffset\fR.
.SH RETURN VALUES
.ne 2
.na
\fB\fBCS_SUCCESS\fR \fR
.ad
.RS 15n
Successful operation.
.RE

.SH CONTEXT
This function may be called from user or kernel context.
.SH SEE ALSO
.BR csx_RequestIO (9F),
.BR csx_RequestIRQ (9F),
.BR csx_SetHandleOffset (9F)
.sp
.LP
\fIPC Card 95 Standard, PCMCIA/JEIDA\fR
