illumos/illumos-gate/usr/src/man/man9f/csx_GetMappedAddr.9f
'\" te
.\"  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH CSX_GETMAPPEDADDR 9F "Jul 19, 1996"
.SH NAME
csx_GetMappedAddr \- return mapped virtual address
.SH SYNOPSIS
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_GetMappedAddr\fR(\fBacc_handle_t\fR \fIhandle\fR, \fBvoid **\fR\fIaddr\fR);
.fi

.SH INTERFACE LEVEL
illumos \fBDDI \fRSpecific (illumos \fBDDI) \fR
.SH PARAMETERS
.ne 2
.na
\fB\fIhandle\fR \fR
.ad
.RS 11n
The access handle returned from \fBcsx_RequestIO\fR(9F),
\fBcsx_RequestWindow\fR(9F), or \fBcsx_DupHandle\fR(9F).
.RE

.sp
.ne 2
.na
\fB\fIaddr\fR \fR
.ad
.RS 11n
The virtual or \fBI/O \fRport number represented by the handle.
.RE

.SH DESCRIPTION
This function returns the mapped virtual address or the mapped \fBI/O \fRport
number represented by the handle, \fIhandle\fR.
.SH RETURN VALUES
.ne 2
.na
\fB\fBCS_SUCCESS\fR \fR
.ad
.RS 28n
The resulting address or \fBI/O \fRport number can be directly accessed by the
caller.
.RE

.sp
.ne 2
.na
\fB\fBCS_FAILURE\fR \fR
.ad
.RS 28n
The resulting address or \fBI/O \fRport number can not be directly accessed by
the caller; the caller must make all accesses to the mapped area via the common
access functions.
.RE

.sp
.ne 2
.na
\fB\fBCS_UNSUPPORTED_FUNCTION\fR \fR
.ad
.RS 28n
No \fBPCMCIA \fRhardware installed.
.RE

.SH CONTEXT
This function may be called from user, kernel, or interrupt context.
.SH SEE ALSO
.BR csx_DupHandle (9F),
.BR csx_Get8 (9F),
.BR csx_Put8 (9F),
.BR csx_RepGet8 (9F),
.BR csx_RepPut8 (9F),
.BR csx_RequestIO (9F),
.BR csx_RequestWindow (9F)
.sp
.LP
\fIPC Card 95 Standard, PCMCIA/JEIDA\fR
