illumos/illumos-gate/usr/src/man/man9f/ddi_getiminor.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.
.\"  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_GETIMINOR 9F "Nov 18, 2004"
.SH NAME
ddi_getiminor \- get kernel internal minor number from an external dev_t
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/mkdev.h>
#include <sys/ddi.h>



\fBminor_t\fR \fBddi_getiminor\fR(\fBdev_t\fR \fIdev\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete. \fBgetminor\fR(9F) should be used instead.
.SH PARAMETERS
.sp
.LP
The following parameters are supported:
.sp
.ne 2
.na
\fB\fIdev\fR\fR
.ad
.RS 7n
Device number.
.RE

.SH DESCRIPTION
.sp
.LP
\fBddi_getiminor()\fR extracts the minor number from a device number. This call
should be used only for device numbers that have been passed to the kernel from
the user space through opaque interfaces such as the contents of
\fBioctl\fR(9E) and \fBputmsg\fR(2). The device numbers passed in using
standard device entry points must continue to be interpreted using the
\fBgetminor\fR(9F) interface. This new interface is used to translate between
user visible device numbers and in kernel device numbers. The two numbers may
differ in a clustered system.
.sp
.LP
For certain bus types, you can call this \fBDDI\fR function from a
high-interrupt context.  These types include \fBISA\fR and SBus buses.  See
\fBsysbus\fR(5), \fBisa\fR(5), and \fBsbus\fR(5) for details.
.SH CONTEXT
.sp
.LP
\fBddi_getiminor()\fR can be called from user context only.
.SH RETURN VALUES
.sp
.LP
The minor number or \fBEMINOR_UNKNOWN\fR if the minor number of the device is
invalid.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Stability Level	Obsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (7),
.BR getmajor (9F),
.BR getminor (9F),
.BR makedevice (9F)
.sp
.LP
\fIWriting Device Drivers\fR
.SH WARNINGS
.sp
.LP
Drivers are required to replace calls to \fBddi_getminor.9f\fR by
\fBgetminor\fR(9F)) in order to compile under Solaris 10 and later versions.
