illumos/illumos-gate/usr/src/man/man9f/ddi_dev_nintrs.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_DEV_NINTRS 9F "March 6, 2023"
.SH NAME
ddi_dev_nintrs \- return the number of interrupt specifications a device has
.SH SYNOPSIS
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dev_nintrs\fR(\fBdev_info_t *\fR\fIdip\fR, \fBint *\fR\fIresultp\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI). This interface is obsolete. Use the new
interrupt interfaces referenced in \fBIntro\fR(9F). Refer to \fIWriting Device
Drivers\fR for more information.
.SH DESCRIPTION
The \fBddi_dev_nintrs()\fR function returns the number of interrupt
specifications a device has in \fB*\fR\fIresultp\fR.
.SH RETURN VALUES
The \fBddi_dev_nintrs()\fR function returns:
.sp
.ne 2
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
A successful return. The number of interrupt specifications that the device has
is set in \fIresultp\fR.
.RE

.sp
.ne 2
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
The device has no interrupt specifications.
.RE

.SH CONTEXT
The \fBddi_dev_nintrs()\fR function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Obsolete
.TE

.SH SEE ALSO
.BR isa (5),
.BR Intro (9F),
.BR ddi_add_intr (9F),
.BR ddi_dev_nregs (9F),
.BR ddi_dev_regsize (9F)
.sp
.LP
\fIWriting Device Drivers\fR
