illumos/illumos-gate/usr/src/man/man9f/ddi_root_node.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_ROOT_NODE 9F "Jan 16, 2006"
.SH NAME
ddi_root_node \- get the root of the dev_info tree
.SH SYNOPSIS
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBdev_info_t  *\fR\fBddi_root_node\fR(\fBvoid\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH DESCRIPTION
The \fBddi_root_node()\fR function returns a pointer to the root node of the
device information tree.
.SH RETURN VALUES
The \fBddi_root_node()\fR function returns a pointer to a device information
structure.
.SH CONTEXT
The \fBddi_root_node()\fR function can be called from user, interrupt, or
kernel context.
.SH SEE ALSO
\fIWriting Device Drivers\fR
