illumos/illumos-gate/usr/src/man/man9f/ddi_get_parent.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_GET_PARENT 9F "Jan 16, 2006"
.SH NAME
ddi_get_parent \- find the parent of a device information structure
.SH SYNOPSIS
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBdev_info_t *\fR\fBddi_get_parent\fR(\fBdev_info_t *\fR\fIdip\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fIdip\fR\fR
.ad
.RS 7n
Pointer to a device information structure.
.RE

.SH DESCRIPTION
The \fBddi_get_parent()\fR function returns a pointer to the device information
structure which is the parent of the one pointed to by \fIdip\fR.
.SH RETURN VALUES
The \fBddi_get_parent()\fR function returns a pointer to a device information
structure.
.SH CONTEXT
The \fBddi_get_parent()\fR function can be called from user, interrupt, or
kernel context.
.SH SEE ALSO
\fIWriting Device Drivers\fR
