illumos/illumos-gate/usr/src/man/man9f/ddi_dev_nregs.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_DEV_NREGS 9F "Jan 16, 2006"
.SH NAME
ddi_dev_nregs \- return the number of register sets a device has
.SH SYNOPSIS
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dev_nregs\fR(\fBdev_info_t *\fR\fIdip\fR, \fBint *\fR\fIresultp\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fIdip\fR\fR
.ad
.RS 11n
A pointer to the device's \fBdev_info\fR structure.
.RE

.sp
.ne 2
.na
\fB\fIresultp\fR\fR
.ad
.RS 11n
Pointer to an integer that holds the number of register sets on return.
.RE

.SH DESCRIPTION
The \fBddi_dev_nregs()\fR function returns the number of sets of registers the
device has.
.SH RETURN VALUES
The \fBddi_dev_nregs()\fR function returns:
.sp
.ne 2
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
A successful return. The number of register sets is returned in \fIresultp\fR.
.RE

.sp
.ne 2
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
The device has no registers.
.RE

.SH CONTEXT
The \fBddi_dev_nregs()\fR function can be called from user, interrupt, or
kernel context.
.SH SEE ALSO
.BR ddi_dev_nintrs (9F),
.BR ddi_dev_regsize (9F)
.sp
.LP
\fIWriting Device Drivers\fR
