illumos/illumos-gate/usr/src/man/man9f/ddi_mem_put8.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_MEM_PUT8 9F "Nov 1, 2005"
.SH NAME
ddi_mem_put8, ddi_mem_put16, ddi_mem_put32, ddi_mem_put64,
\- write data to mapped device in the memory space or allocated DMA memory
.SH SYNOPSIS
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_mem_put8\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint8_t *\fR\fIdev_addr\fR,
     \fBuint8_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_mem_put16\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint16_t *\fR\fIdev_addr\fR,
     \fBuint16_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_mem_put32\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint32_t *\fR\fIdev_addr\fR,
     \fBuint32_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_mem_put64\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint64_t *\fR\fIdev_addr\fR,
     \fBuint64_t\fR \fIvalue\fR);
.fi

.SH PARAMETERS
.ne 2
.na
\fB\fIhandle\fR\fR
.ad
.RS 12n
The data access handle returned from setup calls, such as
\fBddi_regs_map_setup\fR(9F).
.RE

.sp
.ne 2
.na
\fB\fIdev_addr\fR\fR
.ad
.RS 12n
Base device address.
.RE

.sp
.ne 2
.na
\fB\fIvalue\fR\fR
.ad
.RS 12n
The data to be written to the device.
.RE

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI). The \fBddi_mem_put8()\fR,
\fBddi_mem_put16()\fR, \fBddi_mem_put32()\fR, \fBddi_mem_put64()\fR,
\fBddi_mem_putb()\fR, \fBddi_mem_putl()\fR, \fBddi_mem_putll()\fR, and
\fBddi_mem_putw()\fR functions are obsolete. The \fBddi_put8\fR(9F) function
replaces \fBddi_mem_put8()\fR. The \fBddi_put16\fR(9F) function replaces
\fBddi_mem_put16()\fR. The \fBddi_put32\fR(9F) function replaces
\fBddi_mem_put32()\fR. The \fBddi_put64\fR(9F) function replaces
\fBddi_mem_put64()\fR.
.SH DESCRIPTION
These routines generate a write of various sizes to memory space or allocated
\fBDMA \fRmemory. The \fBddi_mem_put8()\fR, \fBddi_mem_put16()\fR,
\fBddi_mem_put32()\fR, and \fBddi_mem_put64()\fR functions write 8 bits, 16
bits, 32 bits and 64 bits of data, respectively, to the device address,
\fIdev_addr\fR, in memory space.
.sp
.LP
Each individual datum will automatically be translated to maintain a consistent
view between the host and the device based on the encoded information in the
data access handle. The translation may involve byte-swapping if the host and
the device have incompatible endian characteristics.
.SH CONTEXT
These functions can be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Obsolete
.TE

.SH SEE ALSO
.BR ddi_mem_get8 (9F),
.BR ddi_mem_get8 (9F),
.BR ddi_mem_rep_get8 (9F),
.BR ddi_put16 (9F),
.BR ddi_put32 (9F),
.BR ddi_put64 (9F),
.BR ddi_put8 (9F),
.BR ddi_regs_map_setup (9F),
.BR ddi_device_acc_attr (9S)
