illumos/illumos-gate/usr/src/man/man9f/ddi_get_eventcookie.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_GET_EVENTCOOKIE 9F "Nov 6, 2003"
.SH NAME
ddi_get_eventcookie \- retrieve a NDI event service cookie handle
.SH SYNOPSIS
.nf
#include <sys/dditypes.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_get_eventcookie\fR(\fBdev_info_t *\fR\fIdip\fR, \fBchar *\fR\fIname\fR,
     \fBddi_eventcookie_t *\fR\fIevent_cookiep\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fBdev_info_t *\fR\fIdip\fR\fR
.ad
.sp .6
.RS 4n
Child device node requesting the cookie.
.RE

.sp
.ne 2
.na
\fB\fBchar *\fR\fIname\fR\fR
.ad
.sp .6
.RS 4n
NULL-terminated string containing the name of the event.
.RE

.sp
.ne 2
.na
\fB\fBddi_eventcookie_t *\fR\fIevent_cookiep\fR\fR
.ad
.sp .6
.RS 4n
Pointer to cookie where event cookie will be returned.
.RE

.SH DESCRIPTION
The \fBddi_get_eventcookie()\fR function queries the device tree for a cookie
matching the given event name and returns a reference to that cookie. The
search is performed by a calling up the device tree hierarchy until the request
is satisfied by a bus nexus driver, or the top of the \fBdev_info\fR tree is
reached.
.sp
.LP
The cookie returned by this function can be used to register a callback
handler, unregister a callback handler, or post an event.
.SH RETURN VALUES
.ne 2
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
Cookie handle is returned.
.RE

.sp
.ne 2
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
Request was not serviceable by any nexus driver in the driver's ancestral
device tree hierarchy.
.RE

.SH CONTEXT
The \fBddi_get_eventcookie()\fR function can be called from user and kernel
contexts only.
.SH ATTRIBUTES
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.BR attributes (7),
.BR ddi_add_event_handler (9F),
.BR ddi_remove_event_handler (9F)
.sp
.LP
\fIWriting Device Drivers\fR
