illumos/illumos-gate/usr/src/man/man9f/ddi_dma_get_attr.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_DMA_GET_ATTR 9F "Oct 12, 2005"
.SH NAME
ddi_dma_get_attr \- get the device DMA attribute structure from a DMA handle
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_get_attr\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBddi_dma_attr_t *\fR\fIattrp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIhandle\fR\fR
.ad
.RS 10n
The handle filled in by a call to \fBddi_dma_alloc_handle\fR(9F).
.RE

.sp
.ne 2
.na
\fB\fIattrp\fR\fR
.ad
.RS 10n
Pointer to a buffer suitable for holding a DMA attribute structure. See
\fBddi_dma_attr\fR(9S).
.RE

.SH DESCRIPTION
.sp
.LP
\fBddi_dma_get_attr()\fR is used to get a \fBddi_dma_attr\fR(9S) structure.
This structure describes the attributes of the DMA data path to which any
memory object bound to the given handle will be subject.
.SH RETURN VALUES
.sp
.ne 2
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 19n
Successfully passed back attribute structure in buffer pointed to by
\fIattrp\fR.
.RE

.sp
.ne 2
.na
\fB\fBDDI_DMA_BADATTR\fR\fR
.ad
.RS 19n
A valid attribute structure could not be passed back.
.RE

.SH CONTEXT
.sp
.LP
\fBddi_dma_get_attr()\fR can be called from any context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Obsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBddi_dma_alloc_handle\fR(9F), \fBddi_dma_attr\fR(9S)
