illumos/illumos-gate/usr/src/man/man9f/ddi_dma_mem_free.9f
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ddi_dma_mem_free 9F "26 Sep 1994" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_mem_free \- free previously allocated memory
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h> 
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_dma_mem_free\fR(\fBddi_acc_handle_t *\fR\fIhandlep\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandlep\fR \fR
.ad
.RS 12n
.rt  
Pointer to the data access handle previously allocated by a call to
\fBddi_dma_mem_alloc\fR(9F).
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
\fBddi_dma_mem_free()\fR deallocates the memory acquired by
\fBddi_dma_mem_alloc\fR(9F). In addition, it destroys the data access handle
\fIhandlep\fR associated with the memory.
.SH CONTEXT
.sp
.LP
\fBddi_dma_mem_free()\fR can be called from user, kernel, or interrupt context.
.SH SEE ALSO
.sp
.LP
\fBddi_dma_mem_alloc\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
