illumos/illumos-gate/usr/src/man/man9f/ddi_io_rep_get8.9f
'\" te
.\"  Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ddi_io_rep_get8 9F "1 Nov 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_io_rep_get8, ddi_io_rep_get16, ddi_io_rep_get32, ddi_io_rep_getb,
ddi_io_rep_getl, ddi_io_rep_getw \- read multiple data from the mapped device
register in I/O space
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h> 
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_io_rep_get8\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint8_t *\fR\fIhost_addr\fR, 
     \fBuint8_t *\fR\fIdev_addr\fR, \fBsize_t\fR \fIrepcount\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_io_rep_get16\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint16_t *\fR\fIhost_addr\fR,
     \fBuint16_t *\fR\fIdev_addr\fR,, \fBsize_t\fR \fIrepcount\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_io_rep_get32\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint32_t *\fR\fIhost_addr\fR,
     \fBuint32_t *\fR\fIdev_addr\fR,, \fBsize_t\fR \fIrepcount\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). The \fBddi_io_rep_get8()\fR,
\fBddi_io_rep_get16()\fR, \fBddi_io_rep_get32()\fR, \fBddi_io_rep_getb()\fR,
\fBddi_io_rep_getl()\fR, and \fBddi_io_rep_getw()\fR functions are obsolete.
The \fBddi_rep_get8\fR(9F) function replaces \fBddi_io_rep_get8()\fR. The
\fBddi_rep_get16\fR(9F) function replaces \fBddi_io_rep_get16()\fR. The
\fBddi_rep_get32\fR(9F) function replaces \fBddi_io_rep_get32()\fR. The
\fBddi_rep_get8\fR(9F) function replaces \fBddi_io_rep_getb()\fR. The
\fBddi_rep_get32\fR(9F) function replaces \fBddi_io_rep_getl()\fR. The
\fBddi_rep_get16\fR(9F) function replaces \fBddi_io_rep_getw()\fR.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR\fR
.ad
.RS 13n
.rt  
The data access handle returned from setup calls, such as
\fBddi_regs_map_setup\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIhost_addr\fR\fR
.ad
.RS 13n
.rt  
Base host address.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdev_addr\fR\fR
.ad
.RS 13n
.rt  
Base device address.
.RE

.sp
.ne 2
.mk
.na
\fB\fIrepcount\fR\fR
.ad
.RS 13n
.rt  
Number of data accesses to perform.
.RE

.SH DESCRIPTION
.sp
.LP
These routines generate multiple reads from the device address, \fIdev_addr\fR,
in I/O space. \fIrepcount\fR data is copied from the device address,
\fIdev_addr\fR, to the host address, \fIhost_addr\fR. For each input datum, the
\fBddi_io_rep_get8()\fR, \fBddi_io_rep_get16()\fR, and \fBddi_io_rep_get32()\fR
functions read 8 bits, 16 bits, and 32 bits of data, respectively, from the
device address. \fIhost_addr\fR must be aligned to the datum boundary described
by the function.
.sp
.LP
Each individual datum will automatically be translated to maintain a consistent
view between the host and the device based on the encoded information in the
data access handle. The translation may involve byte-swapping if the host and
the device have incompatible endian characteristics.
.SH CONTEXT
.sp
.LP
These functions can be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBisa\fR(4), \fBddi_io_get8\fR(9F), \fBddi_io_put8\fR(9F),
\fBddi_io_rep_put8\fR(9F), \fBddi_regs_map_free\fR(9F),
\fBddi_regs_map_setup\fR(9F), \fBddi_rep_get8\fR(9F), \fBddi_rep_get16\fR(9F),
\fBddi_rep_get32\fR(9F), \fBddi_device_acc_attr\fR(9S)
