illumos/illumos-gate/usr/src/man/man9f/ddi_dma_free.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_DMA_FREE 9F "Jan 16, 2006"
.SH NAME
ddi_dma_free \- release system DMA resources
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_free\fR(\fBddi_dma_handle_t\fR \fIhandle\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete. \fBddi_dma_free_handle\fR(9F) should be used
instead.
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIhandle\fR\fR
.ad
.RS 10n
The handle filled in by a call to \fBddi_dma_setup\fR(9F).
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_dma_free()\fR function releases system \fBDMA\fR resources set up by
\fBddi_dma_setup\fR(9F). When a \fBDMA\fR transfer completes, the driver should
free up system \fBDMA\fR resources established by a call to
\fBddi_dma_setup\fR(9F). This is done by a call to \fBddi_dma_free()\fR.
\fBddi_dma_free()\fR does an implicit \fBddi_dma_sync\fR(9F) for you so any
further synchronization steps are not necessary.
.SH RETURN VALUES
.sp
.LP
The \fBddi_dma_free()\fR function returns:
.sp
.ne 2
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
Successfully released resources
.RE

.sp
.ne 2
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
Failed to free resources
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_dma_free()\fR function can be called from user, interrupt, or kernel
context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Stability Level	Obsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBddi_dma_addr_setup\fR(9F), \fBddi_dma_buf_setup\fR(9F),
\fBddi_dma_free_handle\fR(9F), \fBddi_dma_htoc\fR(9F), \fBddi_dma_sync\fR(9F),
\fBddi_dma_req\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
