illumos/illumos-gate/usr/src/man/man9f/ddi_report_dev.9f
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_REPORT_DEV 9F "Jun 7, 1993"
.SH NAME
ddi_report_dev \- announce a device
.SH SYNOPSIS
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_report_dev\fR(\fBdev_info_t *\fR\fIdip\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fIdip\fR \fR
.ad
.RS 8n
a pointer the device's \fBdev_info\fR structure.
.RE

.SH DESCRIPTION
\fBddi_report_dev()\fR prints a banner at boot time,  announcing the device
pointed to by \fIdip\fR. The banner is always placed in the system logfile
(displayed by \fBdmesg\fR(1M)), but is only displayed on the console if the
system was booted with the verbose (\fB-v\fR) argument.
.SH CONTEXT
\fBddi_report_dev()\fR can be called from user context.
.SH SEE ALSO
\fBdmesg\fR(1M), \fBkernel\fR(1M)
.sp
.LP
\fIWriting Device Drivers\fR
