illumos/illumos-gate/usr/src/man/man9f/ddi_remove_event_handler.9f
'\" te
.\"  Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_REMOVE_EVENT_HANDLER 9F "May 2, 2003"
.SH NAME
ddi_remove_event_handler \- remove an NDI event service callback handler
.SH SYNOPSIS
.nf
#include <sys/dditypes.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_remove_event_handler\fR(\fBddi_registration_id_t\fR \fIid\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fBddi_registration_id_t \fR\fIid\fR\fR
.ad
.RS 28n
Unique system wide registration ID return by \fBddi_add_event_handler\fR(9F)
upon successful registration.
.RE

.SH DESCRIPTION
The \fBddi_remove_event_handler()\fR function removes the callback handler
specified by the registration \fIid\fR (\fBddi_registration_id_t\fR). Upon
successful removal, the callback handler is removed from the system and will
not be invoked in the face of the event.
.SH RETURN VALUES
.ne 2
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
Callback handler removed successfully.
.RE

.sp
.ne 2
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
Failed to remove callback handler.
.RE

.SH CONTEXT
The \fBddi_remove_event_handler()\fR function can be called from user and
kernel contexts only.
.SH ATTRIBUTES
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Stability Level	Committed
.TE

.SH SEE ALSO
.BR attributes (7),
.BR ddi_add_event_handler (9F),
.BR ddi_get_eventcookie (9F)
.sp
.LP
\fIWriting Device Drivers\fR
.SH NOTES
Device drivers must remove all registered callback handlers before
\fBdetach\fR(9E) processing for that device instance is complete.
