illumos/illumos-gate/usr/src/man/man9f/ddi_dma_coff.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_DMA_COFF 9F "Jan 16, 2006"
.SH NAME
ddi_dma_coff \- convert a DMA cookie to an offset within a DMA handle.
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_coff\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBddi_dma_cookie_t *\fR\fIcookiep\fR,
     \fBoff_t *\fR\fIoffp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris SPARC DDI (Solaris SPARC DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIhandle\fR\fR
.ad
.RS 11n
The \fIhandle\fR filled in by a call to \fBddi_dma_setup\fR(9F).
.RE

.sp
.ne 2
.na
\fB\fIcookiep\fR\fR
.ad
.RS 11n
A pointer to a \fBDMA\fR cookie (see \fBddi_dma_cookie\fR(9S)) that contains
the appropriate address, length and bus type to be used in programming the
\fBDMA\fR engine.
.RE

.sp
.ne 2
.na
\fB\fIoffp\fR\fR
.ad
.RS 11n
A pointer to an offset to be filled in.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_dma_coff()\fR function converts the values in \fBDMA\fR cookie
pointed to by \fIcookiep\fR to an offset (in bytes) from the beginning of the
object that the DMA\fBhandle\fR has mapped.
.sp
.LP
The \fBddi_dma_coff()\fR function allows a driver to update a \fBDMA\fR cookie
with values it reads from its device's \fBDMA\fR engine after a transfer
completes and convert that value into an offset into the object that is mapped
for \fBDMA\fR.
.SH RETURN VALUES
.sp
.LP
The \fBddi_dma_coff()\fR function returns:
.sp
.ne 2
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
Successfully filled in \fIoffp\fR.
.RE

.sp
.ne 2
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
Failed to successfully fill in \fIoffp\fR.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_dma_coff()\fR function can be called from user, interrupt, or kernel
context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Obsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBddi_dma_setup\fR(9F), \fBddi_dma_sync\fR(9F), \fBddi_dma_cookie\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
