illumos/illumos-gate/usr/src/man/man9f/ddi_dma_unbind_handle.9f
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DDI_DMA_UNBIND_HANDLE 9F "Sep 26, 1994"
.SH NAME
ddi_dma_unbind_handle \- unbinds the address in a DMA handle
.SH SYNOPSIS
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_unbind_handle\fR(\fBddi_dma_handle_t\fR \fIhandle\fR);
.fi

.SH PARAMETERS
.ne 2
.na
\fB\fIhandle\fR \fR
.ad
.RS 11n
The  \fBDMA\fR handle previously allocated by a call to
\fBddi_dma_alloc_handle\fR(9F).
.RE

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH DESCRIPTION
\fBddi_dma_unbind_handle()\fR frees all  \fBDMA\fR resources associated with an
existing  \fBDMA\fR handle.  When a  \fBDMA\fR transfer completes, the driver
should call \fBddi_dma_unbind_handle()\fR to free system  \fBDMA\fR resources
established by a call to \fBddi_dma_buf_bind_handle\fR(9F) or
\fBddi_dma_addr_bind_handle\fR(9F). \fBddi_dma_unbind_handle()\fR does an
implicit \fBddi_dma_sync\fR(9F) making further synchronization steps
unnecessary.
.SH RETURN VALUES
.ne 2
.na
\fB\fBDDI_SUCCESS\fR \fR
.ad
.RS 16n
on success
.RE

.sp
.ne 2
.na
\fB\fBDDI_FAILURE\fR \fR
.ad
.RS 16n
on failure
.RE

.SH CONTEXT
\fBddi_dma_unbind_handle()\fR can be called from user, kernel, or interrupt
context.
.SH SEE ALSO
.BR ddi_dma_addr_bind_handle (9F),
.BR ddi_dma_alloc_handle (9F),
.BR ddi_dma_buf_bind_handle (9F),
.BR ddi_dma_free_handle (9F),
.BR ddi_dma_sync (9F)
.sp
.LP
\fIWriting Device Drivers\fR
