illumos/illumos-gate/usr/src/man/man9f/flushband.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FLUSHBAND 9F "Jan 16, 2006"
.SH NAME
flushband \- flush messages for a specified priority band
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBflushband\fR(\fBqueue_t\fR \fI*q\fR, \fBunsigned char\fR \fIpri\fR, \fBint\fR \fIflag\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIq\fR\fR
.ad
.RS 8n
Pointer to the queue.
.RE

.sp
.ne 2
.na
\fB\fIpri\fR\fR
.ad
.RS 8n
Priority of messages to be flushed.
.RE

.sp
.ne 2
.na
\fB\fIflag\fR\fR
.ad
.RS 8n
Valid \fIflag\fR values are:
.RE

.sp
.ne 2
.na
\fB\fBFLUSHDATA\fR\fR
.ad
.RS 13n
Flush only data messages (types \fBM_DATA,\fR \fBM_DELAY,\fR \fBM_PROTO,\fR and
\fBM_PCPROTO\fR \fB\fR).
.RE

.sp
.ne 2
.na
\fB\fBFLUSHALL\fR\fR
.ad
.RS 13n
Flush all messages.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBflushband()\fR function flushes messages associated with the priority
band specified by \fIpri\fR. If \fIpri\fR is \fB0\fR, only normal and high
priority messages are flushed. Otherwise, messages are flushed from the band
\fIpri\fR according to the value of \fIflag\fR.
.SH CONTEXT
.sp
.LP
The \fBflushband()\fR function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
\fBflushq\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR \fISTREAMS Programming Guide\fR
