illumos/illumos-gate/usr/src/man/man9f/ldi_remove_event_handler.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.,  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH LDI_REMOVE_EVENT_HANDLER 9F "Aug 21, 2007"
.SH NAME
ldi_remove_event_handler \- remove an NDI event service callback
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi_obsolete.h>

\fBint\fR \fBldi_remove_event_handler\fR(\fBldi_handle_t\fR \fIlh\fR,
     \fIldi_callback_id_t id\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Obsolete
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIldi_handle_t lh\fR\fR
.ad
.RS 24n
Layered handle representing the device for which the event notification is
requested.
.RE

.sp
.ne 2
.na
\fB\fIldi_callback_id_t id\fR\fR
.ad
.RS 24n
Unique system-wide registration ID returned by \fBldi_add_event_handler\fR(9F)
upon successful registration.
.RE

.SH DESCRIPTION
.sp
.LP
This function is obsolete and is only maintained for compatibility. Use of this
function is strongly discouraged. For equivalent functionality provided by new
interfaces, see \fBldi_ev_register_callbacks\fR(9F) and
\fBldi_ev_remove_callbacks\fR(9F).
.sp
.LP
The \fBldi_remove_event_handler()\fR function removes the callback handler
specified by the registration ID (\fIldi_callback_id_t\fR). Upon successful
removal, the callback handler is removed from the system and is not invoked at
the event occurance.
.SH RETURN VALUES
.sp
.ne 2
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
Callback handler removed successfully.
.RE

.sp
.ne 2
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
Failed to remove callback handler.
.RE

.SH CONTEXT
.sp
.LP
This function can be called from user and kernel contexts only.
.SH SEE ALSO
.sp
.LP
\fBldi_ev_register_callbacks\fR(9F), \fBldi_ev_remove_callbacks\fR(9F),
\fBldi_add_event_handler\fR(9F), \fBldi_get_eventcookie\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
