illumos/illumos-gate/usr/src/man/man9f/ldi_devmap.9f
'\" te
.\"  Copyright (c) 2003, Sun Microsystems, Inc.,  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH LDI_DEVMAP 9F "Jun 3, 2003"
.SH NAME
ldi_devmap \- Issue a devmap request to a device
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_devmap\fR(\fBldi_handle_t\fR \fIlh\fR, \fBdevmap_cookie_t\fR \fIdhp\fR, \fBoffset_t\fR \fIoff\fR,
     \fBsize_t\fR \fIlen\fR, \fBsize_t *\fR\fImaplen\fR, \fBuint_t\fR \fImodel\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIlh\fR\fR
.ad
.RS 10n
Layered handle.
.RE

.sp
.ne 2
.na
\fB\fIdhp\fR\fR
.ad
.RS 10n
Opaque mapping handle used by the system to describe mapping.
.RE

.sp
.ne 2
.na
\fB\fIoff\fR\fR
.ad
.RS 10n
User offset within the logical device memory at which mapping begins.
.RE

.sp
.ne 2
.na
\fB\fIlen\fR\fR
.ad
.RS 10n
Mapping length (in bytes).
.RE

.sp
.ne 2
.na
\fB\fImaplen\fR\fR
.ad
.RS 10n
Pointer to length (in bytes) of validated mapping.  (Less than or equal to
\fIlen\fR).
.RE

.sp
.ne 2
.na
\fB\fImodel\fR\fR
.ad
.RS 10n
Data model type of current thread.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBldi_devmap()\fR function passes an devmap request to the device entry
point for the device specified by the layered handle. This operation is
supported for character devices.
.SH RETURN VALUES
.sp
.LP
The \fBldi_devmap()\fR function returns \fB0\fR upon success. If a failure
occurs before the request is passed to the device, possible return values are
shown below. Otherwise any other error number may be returned by the device.
.sp
.ne 2
.na
\fBEINVAL\fR
.ad
.RS 11n
Invalid input parameters.
.RE

.sp
.ne 2
.na
\fBENOTSUP\fR
.ad
.RS 11n
Operation is not supported for this device.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
