illumos/illumos-gate/usr/src/man/man9f/msgsize.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH MSGSIZE 9F "Jun 9, 2004"
.SH NAME
msgsize \- Return the total number of bytes in a message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/strsun.h>



\fBsize_t\fR \fBmsgsize\fR(\fBmblk_t *\fR\fImp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fImp\fR\fR
.ad
.RS 6n
Message to be evaluated.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBmsgsize()\fR function counts the number of bytes in a message,
regardless of the data type of the underlying data blocks.
.SH RETURN VALUES
.sp
.LP
Number of bytes in the message.
.SH CONTEXT
.sp
.LP
This function can be called from user, kernel or interrupt context.
.SH SEE ALSO
.sp
.LP
\fBmsgdsize\fR(9F)
.sp
.LP
\fISTREAMS Programming Guide\fR
