illumos/illumos-gate/usr/src/man/man9f/net_instance_register.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NET_INSTANCE_REGISTER 9F "May 1, 2008"
.SH NAME
net_instance_register \- register a set of instances to occur with IP instance
events
.SH SYNOPSIS
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_instance_register\fR(\fBnet_instance_t\fR *\fIinstances\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fIinstances\fR\fR
.ad
.RS 13n
must be a pointer returned by \fBnet_instance_alloc\fR(9F).
.RE

.SH DESCRIPTION
The \fBnet_instance_register()\fR function attempts to record the set of
functions passed by instances that are to be called when an event related to
\fBIP\fR instance maintenance occurs.
.SH RETURN VALUES
If the \fBnet_instance_register()\fR function succeeds, \fBDDI_SUCCESS\fR is
returned. Otherwise, \fBDDI_FAILURE\fR is returned to indicate failure due to
the name in the instance already being present.
.SH CONTEXT
The \fBnet_instance_register()\fR function may be called from user or kernel
context.
.SH ATTRIBUTES
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
\fBnet_instance_alloc\fR(9F), \fBnet_instance_unregister\fR(9F),
\fBattributes\fR(5), \fBnet_instance_t\fR(9S)
