illumos/illumos-gate/usr/src/man/man9f/net_getpmtuenabled.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NET_GETPMTUENABLED 9F "May 1, 2008"
.SH NAME
net_getpmtuenabled \- determine if path MTU discovery is enabled for a network
protocol
.SH SYNOPSIS
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_getpmtuenabled\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fInet\fR\fR
.ad
.RS 7n
value returned from a successful call to \fBnet_protocol_lookup\fR(9F).
.RE

.SH DESCRIPTION
The \fBnet_getpmtuenabled()\fR function returns a value to indicate whether or
not path \fBMTU\fR (\fBPMTU\fR) discovery is enabled for this network protocol.
.SH RETURN VALUES
The \fBnet_getpmtuenabled()\fR function returns:
.sp
.ne 2
.na
\fB-1\fR
.ad
.RS 6n
The network protocol does not support this function.
.RE

.sp
.ne 2
.na
\fB0\fR
.ad
.RS 6n
PATH MTU discovery is disabled.
.RE

.sp
.ne 2
.na
\fB1\fR
.ad
.RS 6n
PATH MTU discovery is enabled.
.RE

.SH CONTEXT
The \fBnet_getpmtuenabled()\fR function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
\fBnet_getmtu\fR(9F), \fBnet_protocol_lookup\fR(9F)
