illumos/illumos-gate/usr/src/man/man9f/net_protocol_lookup.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (C) 2012, Joyent, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NET_PROTOCOL_LOOKUP 9F "Mar 5, 2012"
.SH NAME
net_protocol_lookup \- locate an implementation of a network layer protocol
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBnet_handle_t\fR \fBnet_protocol_lookup\fR(\fBnetid_t\fR \fIid\fR, \fBconst\fR \fBchar\fR *\fIprotocol\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIid\fR\fR
.ad
.RS 10n
network instance identifier.
.RE

.sp
.ne 2
.na
\fB\fIfamily\fR\fR
.ad
.RS 10n
name of the network protocol to find.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_protocol_lookup()\fR function attempts to locate a data structure
that defines what capabilities it is exporting through this interface. The
value returned by this call is guaranteed to be valid until it is passed into a
call to \fBnet_protocol_release\fR(9F), after which it should no longer be
treated as valid.
.sp
.LP
The protocol must be a registered name of a network protocol that has been
registered. The symbols \fBNHF_INET\fR and \fBNHF_INET6\fR should be passed to
\fBnet_protocol_lookup()\fR as the protocol name to gain access to either
\fBIPv4\fR or \fBIPv6\fR respectively.
.SH RETURN VALUES
.sp
.LP
The \fBnet_protocol_lookup()\fR function returns \fBNULL\fR if it does not find
any knowledge about the network protocol referenced. Otherwise, it returns a
value that can be used with other calls in this framework.
.SH CONTEXT
.sp
.LP
The \fBnet_protocol_lookup()\fR function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_protocol_release\fR(9F), \fBattributes\fR(5)
