illumos/illumos-gate/usr/src/man/man9f/net_netidtozonid.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NET_NETIDTOZONID 9F "May 1, 2008"
.SH NAME
net_netidtozonid \- map a netid_t structure identifier to a zoneid_t structure
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBzoneid_t\fR \fBnet_netidtozonid\fR(\fBconst\fR \fBnetid_t\fR \fInet\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fInet\fR\fR
.ad
.RS 7n
valid \fBnetid_t\fR structure that refers to an existing \fBIP\fR instance.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_netidtozonid()\fR function maps the given \fBnetid_t\fR (used to
represent an instance of \fBIP\fR) into the matching \fBzoneid_t\fR structure
that is associated with it.
.SH RETURN VALUES
.sp
.LP
The \fBnet_netidtozonid()\fR function returns -1 if no mapping took place.
Otherwise, it returns the \fBzoneid_t\fR structure currently associated with a
\fBnetid_t\fR structure. For shared stack zones, the \fBzoneid_t\fR structure
for the global zone is returned.
.SH CONTEXT
.sp
.LP
The \fBnet_netidtozonid()\fR function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBnet_zoneidtonetid\fR(9F), \fBattributes\fR(5)
