illumos/illumos-gate/usr/src/man/man9f/nochpoll.9f
'\" te
.\"  Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NOCHPOLL 9F "Jan 16, 2006"
.SH NAME
nochpoll \- error return function for non-pollable devices
.SH SYNOPSIS
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBnochpoll\fR(\fBdev_t\fR \fIdev\fR, \fBshort\fR \fIevents\fR, \fBint\fR \fIanyyet\fR, \fBshort\fR \fI*reventsp\fR,
      \fBstruct pollhead\fR \fI**pollhdrp\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI).
.SH PARAMETERS
.ne 2
.na
\fB\fIdev\fR\fR
.ad
.RS 12n
Device number.
.RE

.sp
.ne 2
.na
\fB\fIevents\fR\fR
.ad
.RS 12n
Event flags.
.RE

.sp
.ne 2
.na
\fB\fIanyyet\fR\fR
.ad
.RS 12n
Check current events only.
.RE

.sp
.ne 2
.na
\fB\fIreventsp\fR\fR
.ad
.RS 12n
Event flag pointer.
.RE

.sp
.ne 2
.na
\fB\fIpollhdrp\fR\fR
.ad
.RS 12n
Poll head pointer.
.RE

.SH DESCRIPTION
The \fBnochpoll()\fR function is a routine that simply returns the value
\fBENXIO\fR. It is intended to be used in the \fBcb_ops\fR(9S) structure of a
device driver for devices that do not support the \fBpoll\fR(2) system call.
.SH RETURN VALUES
The \fBnochpoll()\fR function returns \fBENXIO\fR.
.SH CONTEXT
The \fBnochpoll()\fR function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.BR poll (2),
.BR chpoll (9E),
.BR cb_ops (9S)
.sp
.LP
\fIWriting Device Drivers\fR
