illumos/illumos-gate/usr/src/man/man9f/outb.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All RIghts Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH OUTB 9F "Oct 24, 2012"
.SH NAME
outb, outw, outl \- write to an I/O port
.SH SYNOPSIS
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBvoid\fR \fBoutb\fR(\fBint\fR \fIport\fR, \fBunsigned char\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBoutw\fR(\fBint\fR \fIport\fR, \fBunsigned short\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBoutl\fR(\fBint\fR \fIport\fR, \fBunsigned long\fR \fIvalue\fR);
.fi

.SH INTERFACE LEVEL
The functions described here are obsolete. For the \fBoutb()\fR, \fBoutw()\fR,
and \fBoutl()\fR functions use, respectively, \fBddi_put8\fR(9F),
\fBddi_put16\fR(9F), and \fBddi_put32\fR(9F) instead.
.SH PARAMETERS
.ne 2
.na
\fB\fIport\fR\fR
.ad
.RS 9n
A valid \fBI/O\fR port address.
.RE

.sp
.ne 2
.na
\fB\fIvalue\fR\fR
.ad
.RS 9n
The data to be written to the \fBI/O\fR port.
.RE

.sp
.ne 2
.na
\fB\fIaddr\fR\fR
.ad
.RS 9n
The address of a buffer from which the values will be fetched.
.RE

.sp
.ne 2
.na
\fB\fIcount\fR\fR
.ad
.RS 9n
The number of values to be written to the \fBI/O\fR port.
.RE

.SH DESCRIPTION
These routines write data of various sizes to the \fBI/O\fR port with the
address specified by \fIport\fR.
.sp
.LP
The \fBoutb()\fR, \fBoutw()\fR, and \fBoutl()\fR functions write 8 bits, 16
bits, and 32 bits of data respectively, writing the data specified by
\fIvalue\fR.
.sp
.SH CONTEXT
These functions may be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
_
Interface Stability	Obsolete
.TE

.SH SEE ALSO
.BR isa (5),
.BR attributes (7),
.BR ddi_put16 (9F),
.BR ddi_put32 (9F),
.BR ddi_put8 (9F),
.BR inb (9F)
.sp
.LP
\fIWriting Device Drivers\fR
