illumos/illumos-gate/usr/src/man/man9f/pci_config_get8.9f
'\" te
.\"  Copyright (c) 2005, Sun Microsystems, Inc.,  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH PCI_CONFIG_GET8 9F "Nov 1, 2005"
.SH NAME
pci_config_get8, pci_config_get16, pci_config_get32, pci_config_get64,
pci_config_put8, pci_config_put16, pci_config_put32, pci_config_put64,
\- read or write single datum of various sizes to the PCI Local Bus Configuration space
.SH SYNOPSIS
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBuint8_t\fR \fBpci_config_get8\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoffset\fR);
.fi

.LP
.nf
\fBuint16_t\fR \fBpci_config_get16\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoffset\fR);
.fi

.LP
.nf
\fBuint32_t\fR \fBpci_config_get32\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoffset\fR);
.fi

.LP
.nf
\fBuint64_t\fR \fBpci_config_get64\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoffset\fR);
.fi

.LP
.nf
\fBvoid\fR \fBpci_config_put8\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoffset\fR,
     \fBuint8_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBpci_config_put16\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoffset\fR,
     \fBuint16_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBpci_config_put32\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoffset\fR,
     \fBuint32_t\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBpci_config_put64\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoffset\fR,
     \fBuint64_t\fR \fIvalue\fR);
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI). The \fBpci_config_getb()\fR,
\fBpci_config_getl()\fR, \fBpci_config_getll()\fR, \fBpci_config_getw()\fR,
\fBpci_config_putb()\fR, \fBpci_config_putl()\fR, \fBpci_config_putll()\fR, and
\fBpci_config_putw()\fR functions are obsolete. The \fBpci_config_get8()\fR
function replaces \fBpci_config_getb()\fR. The \fBpci_config_get32()\fR
function replaces \fBpci_config_getl()\fR. The \fBpci_config_get64()\fR
function replaces \fBpci_config_getll()\fR. The \fBpci_config_get16()\fR
function replaces \fBpci_config_getw()\fR. The \fBpci_config_put8()\fR function
replaces \fBpci_config_putb()\fR. The \fBpci_config_put32()\fR function
replaces \fBpci_config_putl()\fR. The \fBpci_config_put64()\fR function
replaces \fBpci_config_putll()\fR. The \fBpci_config_put16()\fR function
replaces \fBpci_config_putw()\fR.
.SH PARAMETERS
.ne 2
.na
\fB\fIhandle\fR\fR
.ad
.RS 10n
The data access handle returned from \fBpci_config_setup\fR(9F).
.RE

.sp
.ne 2
.na
\fB\fIoffset\fR\fR
.ad
.RS 10n
Byte offset from the beginning of the \fBPCI \fRConfiguration space.
.RE

.sp
.ne 2
.na
\fB\fIvalue\fR\fR
.ad
.RS 10n
Output data.
.RE

.SH DESCRIPTION
These routines read or write a single datum of various sizes from or to the
\fBPCI \fRLocal Bus Configuration space. The \fBpci_config_get8()\fR,
\fBpci_config_get16()\fR, \fBpci_config_get32()\fR, and
\fBpci_config_get64()\fR functions read 8 bits, 16 bits, 32 bits, and 64 bits
of data, respectively. The \fBpci_config_put8()\fR, \fBpci_config_put16()\fR,
\fBpci_config_put32()\fR, and \fBpci_config_put64()\fR functions write 8 bits,
16 bits, 32 bits, and 64 bits of data, respectively. The \fIoffset\fR argument
must be a multiple of the datum size.
.sp
.LP
Since th  \fBPCI \fRLocal Bus Configuration space is represented in little
endian data format, these functions translate the data from or to native host
format to or from little endian format.
.sp
.LP
\fBpci_config_setup\fR(9F) must be called before invoking these functions.
.SH RETURN VALUES
\fBpci_config_get8()\fR, \fBpci_config_get16()\fR, \fBpci_config_get32()\fR,
and \fBpci_config_get64()\fR return the value read from the  \fBPCI \fRLocal
Bus Configuration space.
.SH CONTEXT
These routines can be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.BR attributes (7),
.BR pci_config_setup (9F),
.BR pci_config_teardown (9F)
