illumos/illumos-gate/usr/src/man/man9f/putq.9f
'\" te
.\"  Copyright 1989 AT&T
.\"  Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH PUTQ 9F "Jan 16, 2006"
.SH NAME
putq \- put a message on a queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBputq\fR(\fBqueue_t *\fR\fIq\fR, \fBmblk_t *\fR\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIq\fR\fR
.ad
.RS 6n
Pointer to the queue to which the message is to be added.
.RE

.sp
.ne 2
.na
\fB\fIbp\fR\fR
.ad
.RS 6n
Message to be put on the queue.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBputq()\fR function is used to put messages on a driver's queue after the
module's put routine has finished processing the message. The message is placed
after any other messages of the same priority, and flow control parameters are
updated. If \fBQNOENB\fR is not set, the service routine is enabled. If no
other processing is done, \fBputq()\fR can be used as the module's put routine.
.SH RETURN VALUES
.sp
.LP
The \fBputq()\fR function returns \fB1\fR on success and \fB0\fR on failure.
.sp
.LP
Upon failure, the caller should call \fBfreemsg\fR(9F) to free the pointer to
the message block.
.SH CONTEXT
.sp
.LP
The \fBputq()\fR function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
See the \fBdatamsg\fR(9F) function page for an example of \fBputq()\fR.
.SH SEE ALSO
.sp
.LP
\fBdatamsg\fR(9F), \fBputbq\fR(9F), \fBqenable\fR(9F), \fBrmvq\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
