illumos/illumos-gate/usr/src/man/man9f/scsi_hba_pkt_comp.9f
'\" te
.\" Copyright (c) 2009, Sun Microsystems Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SCSI_HBA_PKT_COMP 9F "Jan 29, 2009"
.SH NAME
scsi_hba_pkt_comp \- scsi_pkt completion routine
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>

\fBvoid\fR \fBscsi_hba_pkt_comp\fR(\fBstruct scsi_pkt *\fR\fIpkt\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIpkt\fR\fR
.ad
.RS 7n
Pointer to a \fBscsi_pkt\fR(9S) structure.
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
After filling in \fBscsi_pkt\fR(9S) fields with packet completion information,
an HBA driver should call the \fBscsi_hba_pkt_comp()\fR function. This function
is the recommended way for an HBA driver to signal completion of a
\fBscsi_pkt\fR structure.  Use is mandatory for HBA drivers that use
\fBtran_setup_pkt\fR(9E).
.sp
.LP
Calling the \fBscsi_hba_pkt_comp()\fR function allows SCSA to observe, and
possibly react to, the completion of a \fBscsi_pkt\fR request.
.sp
.LP
A call to the \fBscsi_hba_pkt_comp()\fR function will always result in a call
to the \fIpkt_comp\fR() callback function defined in \fBscsi_pkt\fR(9S). This
\fIpkt_comp\fR() callback may, however, occur after return from
\fBscsi_hba_pkt_comp()\fR, and may occur from a different thread executing on a
different CPU.
.SH CONTEXT
.sp
.LP
The \fBscsi_hba_pkt_comp()\fR function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBtran_setup_pkt\fR(9E), \fBscsi_pkt\fR(9S)
.SH NOTES
.sp
.LP
HBA driver calls \fBscsi_hba_pkt_comp()\fR instead of calling
\fBscsi_pkt\fR(9S) \fIpkt_comp\fR directly.
