illumos/illumos-gate/usr/src/man/man9f/strqset.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH STRQSET 9F "Jan 16, 2006"
.SH NAME
strqset \- change information about a queue or band of the queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBstrqset\fR(\fBqueue_t *\fR\fIq\fR, \fBqfields_t\fR \fIwhat\fR, \fBunsigned char\fR \fIpri\fR, \fBintptr_t\fR \fIval\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIq\fR\fR
.ad
.RS 8n
Pointer to the queue.
.RE

.sp
.ne 2
.na
\fB\fIwhat\fR\fR
.ad
.RS 8n
Field of the \fBqueue\fR structure (or the specified priority band) to return
information about. Valid values are one of:
.sp
.ne 2
.na
\fB\fBQHIWAT\fR\fR
.ad
.RS 11n
High water mark.
.RE

.sp
.ne 2
.na
\fB\fBQLOWAT\fR\fR
.ad
.RS 11n
Low water mark.
.RE

.sp
.ne 2
.na
\fB\fBQMAXPSZ\fR\fR
.ad
.RS 11n
Largest packet accepted.
.RE

.sp
.ne 2
.na
\fB\fBQMINPSZ\fR\fR
.ad
.RS 11n
Smallest packet accepted.
.RE

.RE

.sp
.ne 2
.na
\fB\fIpri\fR\fR
.ad
.RS 8n
Priority band of interest.
.RE

.sp
.ne 2
.na
\fB\fIval\fR\fR
.ad
.RS 8n
The value for the field to be changed.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBstrqset()\fR function gives drivers and modules a way to change
information about a queue or a particular band of a queue without directly
accessing STREAMS data structures.
.SH RETURN VALUES
.sp
.LP
On success, \fB0\fR is returned. \fBEINVAL\fR is returned if an undefined
attribute is specified.
.SH CONTEXT
.sp
.LP
The \fBstrqset()\fR function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
\fBstrqget\fR(9F), \fBqueue\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.SH NOTES
.sp
.LP
When lowering existing values, set \fBQMINPSZ\fR before setting \fBQMAXPSZ\fR;
when raising existing values, set \fBQMAXPSZ\fR before setting \fBQMINPSZ\fR.
