illumos/illumos-gate/usr/src/man/man9f/strqget.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH STRQGET 9F "Jan 16, 2006"
.SH NAME
strqget \- get information about a queue or band of the queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBstrqget\fR(\fBqueue_t *\fR\fIq\fR, \fBqfields_t\fR \fIwhat\fR, \fBunsigned char\fR \fIpri\fR, \fBvoid *\fR\fIvalp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIq\fR\fR
.ad
.RS 8n
Pointer to the queue.
.RE

.sp
.ne 2
.na
\fB\fIwhat\fR\fR
.ad
.RS 8n
Field of the \fBqueue\fR structure for (or the specified priority band) to
return information about. Valid values are one of:
.sp
.ne 2
.na
\fB\fBQHIWAT\fR\fR
.ad
.RS 11n
High water mark.
.RE

.sp
.ne 2
.na
\fB\fBQLOWAT\fR\fR
.ad
.RS 11n
Low water mark.
.RE

.sp
.ne 2
.na
\fB\fBQMAXPSZ\fR\fR
.ad
.RS 11n
Largest packet accepted.
.RE

.sp
.ne 2
.na
\fB\fBQMINPSZ\fR\fR
.ad
.RS 11n
Smallest packet accepted.
.RE

.sp
.ne 2
.na
\fB\fBQCOUNT\fR\fR
.ad
.RS 11n
Approximate size (in bytes) of data.
.RE

.sp
.ne 2
.na
\fB\fBQFIRST\fR\fR
.ad
.RS 11n
First message.
.RE

.sp
.ne 2
.na
\fB\fBQLAST\fR\fR
.ad
.RS 11n
Last message.
.RE

.sp
.ne 2
.na
\fB\fBQFLAG\fR\fR
.ad
.RS 11n
Status.
.RE

.RE

.sp
.ne 2
.na
\fB\fIpri\fR\fR
.ad
.RS 8n
Priority band of interest.
.RE

.sp
.ne 2
.na
\fB\fIvalp\fR\fR
.ad
.RS 8n
The address of where to store the value of the requested field.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBstrqget()\fR function gives drivers and modules a way to get information
about a queue or a particular band of a queue without directly accessing
STREAMS data structures, thus insulating them from changes in the
implementation of these data structures from release to release.
.SH RETURN VALUES
.sp
.LP
On success, \fB0\fR is returned and the value of the requested field is stored
in the location pointed to by \fIvalp\fR. An error number is returned on
failure.
.SH CONTEXT
.sp
.LP
The \fBstrqget()\fR function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
\fBstrqset\fR(9F), \fBqueue\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
