illumos/illumos-gate/usr/src/man/man9f/swab.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SWAB 9F "Jan 16, 2006"
.SH NAME
swab \- swap bytes in 16-bit halfwords
.SH SYNOPSIS
.LP
.nf
#include <sys/sunddi.h>



\fBvoid\fR \fBswab\fR(\fBvoid *\fR\fIsrc\fR, \fBvoid *\fR\fIdst\fR, \fBsize_t\fR \fInbytes\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.na
\fB\fIsrc\fR\fR
.ad
.RS 10n
A pointer to the buffer containing the bytes to be swapped.
.RE

.sp
.ne 2
.na
\fB\fIdst\fR\fR
.ad
.RS 10n
A pointer to the destination buffer where the swapped bytes will be written. If
\fIdst\fR is the same as \fIsrc\fR the buffer will be swapped in place.
.RE

.sp
.ne 2
.na
\fB\fInbytes\fR\fR
.ad
.RS 10n
Number of bytes to be swapped, rounded down to the nearest half-word.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBswab()\fR function copies the bytes in the buffer pointed to by
\fIsrc\fR to the buffer pointer to by \fIdst\fR, swapping the order of adjacent
bytes in half-word pairs as the copy proceeds. A total of \fInbytes\fR bytes
are copied, rounded down to the nearest half-word.
.SH CONTEXT
.sp
.LP
The \fBswab()\fR function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
\fIWriting Device Drivers\fR
.SH NOTES
.sp
.LP
Since \fBswab()\fR operates byte-by-byte, it can be used on non-aligned
buffers.
