illumos/illumos-gate/usr/src/man/man7p/rarp.7p
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH RARP 7P "May 28, 2005"
.SH NAME
rarp, RARP \- Reverse address resolution protocol
.SH DESCRIPTION
.sp
.LP
You use the RARP protocol to map dynamically between the Internet Protocol (IP)
and network interface MAC addresses. RARP is often used to boot a Solaris
client. RARP clients include the SPARC boot PROM, x86 boot floppy, SunOS
kernel, and \fBifconfig\fR(1M). \fBin.rarpd\fR(1M) provides the server-side
implementation.
.sp
.LP
RARP request timeout behavior in application-layer clients is governed by the
\fB/etc/inet/rarp\fR default file. To tune the number of retries an application
attempts before giving up, set the \fBRARP_RETRIES\fR variable in
\fB/etc/inet/rarp\fR. If the file is not present or \fBRARP_RETRIES\fR is not
initialized within it, applications retry a maximum of five times with a eight
second wait between retries.
.SH FILES
.sp
.LP
\fB/etc/inet/rarp\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability (protocol)	Standard
_
Interface Stability (defaults file)	Unstable
_
Interface Stability (RARP_RETRIES)	Unstable
.TE

.SH SEE ALSO
.sp
.LP
\fBifconfig\fR(1M), \fBin.rarpd\fR(1M), \fBarp\fR(7P)
.sp
.LP
\fIReverse Address Resolution Protocol RFC 903.  June, 1984\fR R. Finlayson, T.
Mann, J.C. Mogul, M. Theimer
