illumos/illumos-gate/usr/src/man/man7p/slp.7p
'\" te
.\" Copyright (C) 1999, Sun Microsystems, Inc.
.\" All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SLP 7P "Nov 17, 1999"
.SH NAME
slp \- Service Location Protocol
.SH DESCRIPTION
.sp
.LP
The Service Location Protocol (\fBSLP\fR) is a dynamic service discovery
protocol that runs on top of the Internet Protocol (\fBIP\fR). The protocol is
specified by the \fBIETF\fR standard-track documents \fIRFC 2165\fR,  \fIRFC
2608\fR, \fIRFC 2609\fR; the \fBAPI\fR is documented in \fIRFC 2614\fR. .
.sp
.LP
There are two components to the \fBSLP\fR technology. The first is a daemon,
\fBslpd\fR(1M), which coordinates \fBSLP\fR operations. The second is a
software library, \fBslp_api\fR(3SLP), through which processes access a public
\fBAPI\fR. Both components are configured by means of the \fBSLP\fR
configuration file, \fBslp.conf\fR(4).
.sp
.LP
The \fBSLP\fR \fBAPI\fR is useful for two types of processes:
.sp
.ne 2
.na
\fBClient Applications\fR
.ad
.RS 23n
Services and service information can be requested from the \fBAPI\fR.  Clients
do not need to know the location of a required service, only the type of
service, and optionally, the service characteristics.  \fBSLP\fR will supply
the location and other information to the client through the \fBAPI\fR.
.RE

.sp
.ne 2
.na
\fBServer Processes\fR
.ad
.RS 23n
Programs that offer network services use the \fBSLP\fR \fBAPI\fR to advertise
their location as well as other service information. The advertisement can
optionally include attributes describing the service. Advertisements are
accompanied by a lifetime; when the lifetime expires, the advertisement is
flushed, unless it is refreshed prior to expiration.
.RE

.sp
.LP
\fBAPI\fR libraries are available for both the C and Java languages.
.sp
.LP
\fBSLP\fR provides the following additional features:
.RS +4
.TP
.ie t \(bu
.el o
\fBslpd\fR(1M) can be configured to function as a transparent directory agent.
This feature makes \fBSLP\fR scalable to the enterprise. System administrators
can configure directory agents to achieve a number of different strategies for
scalability.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSLP\fR service advertising and discovery is performed in scopes. Unless
otherwise configured, all discovery and all advertisements are in the scope
\fIdefault\fR. In the case of a larger network, scopes can be used to group
services and client systems so that users will only find those services which
are physically near them, belong to their department, or satisfy the specified
criteria.  Administrators can configure these scopes to achieve different
service provider strategies.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Services may be registered by proxy through a serialized registration file.
This is an alternative to registering services through the \fBAPI\fR. See
\fBslpd.reg\fR(4) for more information.
.RE
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
CSI	CSI-enabled
_
Interface Stability	Standard
_
MT-Level	MT-Safe
.TE

.SH SEE ALSO
.sp
.LP
\fBslpd\fR(1M), \fBslp_api\fR(3SLP), \fBslp.conf\fR(4), \fBslpd.reg\fR(4),
\fBattributes\fR(5)
.sp
.LP
Guttman, E.,  Perkins, C., Veizades, J., and Day, M., \fIRFC 2608, Service
Location Protocol, Version 2\fR, The Internet Society, June 1999.
.sp
.LP
Guttman, E.,  Perkins, C., and Kempf, J., \fIRFC 2609, Service Templates and
Service: Schemes\fR, The Internet Society, June 1999.
.sp
.LP
Kempf, J. and Guttman, E., \fIRFC 2614, An API for Service Location\fR, The
Internet Society, June 1999.
.sp
.LP
Veizades, J., Guttman, E.,  Perkins, C., and Kaplan, S., \fIRFC 2165, Service
Location Protocol\fR, Network Working Group, 1997.
