illumos/illumos-gate/usr/src/man/man7d/aac.7d
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH AAC 7D "Dec 27, 2007"
.SH NAME
aac \- SCSI HBA driver for Adaptec AdvancedRAID Controller
.SH DESCRIPTION
.sp
.LP
The \fBaac\fR plain SCSI host bus adapter driver is a SCSA-compliant nexus
driver that supports the Adaptec 2200S/2120S SCSI RAID card, Dell PERC 3Di SCSI
RAID controller, Dell  PERC  3Si  SCSI RAID controller, Adaptec 2820SA SATA
RAID card, Adaptec 4800SAS, 4805SAS SAS RAID cards and SUN's STK RAID REM, STK
RAID INT, and STK RAID EXT RAID cards.
.sp
.LP
The \fBaac\fR driver is ported from FreeBSD and supports RAID disk I/O
functions and the RAID management interface.
.SH DRIVER CONFIGURATION
.sp
.LP
There are no user configurable parameters available. Please configure your
hardware through BIOS.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	T{
x86, SPARC (Limited to systems with AAC hardware RAID cards.)
T}
.TE

.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/drv/aac\fR\fR
.ad
.RS 27n
32-bit ELF kernel module.
.RE

.sp
.ne 2
.na
\fB/kernel/drv/amd64/aac\fR
.ad
.RS 27n
64-bit ELF kernel module. (x86)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/aac\fR\fR
.ad
.RS 27n
64-bit ELF kernel module. (SPARC)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/aac.conf\fR\fR
.ad
.RS 27n
Configuration file. (Contains no user-configurable options).
.RE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBattributes\fR(5), \fBscsi_hba_attach\fR(9F),
\fBscsi_sync_pkt\fR(9F), \fBscsi_transport\fR(9F), \fBscsi_device\fR(9S),
\fBscsi_inquiry\fR(9S), \fBscsi_pkt\fR(9S)
.sp
.LP
\fISmall Computer System Interface-2 (SCSI-2)\fR
