illumos/illumos-gate/usr/src/man/man7d/amdzen.7d
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\"
.\" Copyright 2021 Oxide Computer Company
.\"
.Dd September 26, 2020
.Dt AMDZEN 7D
.Os
.Sh NAME
.Nm amdzen ,
.Nm amdzen_stub
.Nd AMD Zen Nexus Driver
.Sh DESCRIPTION
The
.Nm
driver provides access to the Northbridge, Data Fabric, and System
Management Network
.Pq SMN
for a number of AMD processor lines, including AMD Ryzen CPUs and APUs,
ThreadRipper CPUs, and EPYC CPUs from the following families:
.Bl -bullet
.It
AMD Zen Naples, Summit Ridge, Whitehaven
.Pq Family 17h
.It
AMD Zen+ Colfax, Picasso, and Pinnacle Ridge
.Pq Family 17h
.It
AMD Zen 2 Castle Peak, Matisse, Rome, and Renoir
.Pq Family 17h
.It
AMD Zen 3 Cezanne, Milan, and Vermeer
.Pq Family 19h
.El
.Pp
This driver is a nexus driver and facilitates access to the northbridge,
data fabric, and SMN between various other devices such as
.Xr smntemp 7D .
The various processor devices that make up the northbridge and data
fabric have the
.Sy amdzen_stub
driver attached to them.
The different devices are all amalgamated and a single uniform view is
provided by the
.Sy amdzen
driver.
.Pp
The
.Nm
driver is a nexus driver that has the following children:
.Bl -tag -width "smntemp(7D)"
.It Xr smntemp 7D
Provides access to on-die temperature sensors.
.It Xr usmn 7D
Provides read access to the SMN.
This driver is intended for development purposes.
.It Xr zen_udf 7D
Provides read access to the data fabric.
This driver is intended for development purposes.
.El
.Sh ARCHITECTURE
The
.Sy amdzen
and
.Sy amdzen_stub
drivers are limited to
.Sy x86
platforms with AMD Family 17h and 19h processors.
.Sh SEE ALSO
.Xr smntemp 7D ,
.Xr usmn 7D ,
.Xr zen_udf 7D
