illumos/illumos-gate/usr/src/man/man7d/av1394.7d
'\" te
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.TH AV1394 7D "Jan 10, 2020"
.SH NAME
av1394 \- 1394 audio/video driver
.SH SYNOPSIS
.nf
\fBunit@GUID\fR
.fi

.SH DESCRIPTION
The \fBav1394\fR driver implements \fBiec61883\fR(7I) interfaces for IEEE 1394
compliant devices.
.SS "Asynchronous Transactions"
The driver allows applications to act as FCP controllers, but not FCP targets.
Only \fBIEC61883_FCP_CMD\fR requests can be sent with \fBwrite\fR(2). Only
\fBIEC61883_FCP_RESP\fR requests can be received with \fBread\fR(2).
.SS "Isochronous Transactions"
When the read/write method of is used for transmit, the driver is capable of
auto-detecting and transmitting SD-DVCR 525/60 and 625/50 streams. See
\fBiec61883\fR(7I) for details.
.SH FILES
.ne 2
.na
\fB/dev/av/N/async\fR
.ad
.RS 29n
device node for asynchronous data
.RE

.sp
.ne 2
.na
\fB/dev/av/N/isoch\fR
.ad
.RS 29n
device node for isochronous data
.RE

.sp
.ne 2
.na
\fB/kernel/drv/sparcv9/av1394\fR
.ad
.RS 29n
Device driver (SPARC)
.RE

.sp
.ne 2
.na
\fB/kernel/drv/amd64/av1394\fR
.ad
.RS 29n
Device driver (x86)
.RE

.SH ATTRIBUTES
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
l | l
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	All
_
Interface Stability	Committed
.TE

.SH SEE ALSO
\fBread\fR(2), \fBwrite\fR(2), \fBattributes\fR(5), \fBhci1394\fR(7D),
\fBiec61883\fR(7I)
.sp
.LP
\fIIEEE Std 1394-1995 Standard for a High Performance Serial Bus\fR
.sp
.LP
\fIIEC 61883 Consumer audio/video equipment - Digital interface\fR
