illumos/illumos-gate/usr/src/man/man7d/fbt.7d
'\" te
.\"  Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FBT 7D "Sep 4, 2003"
.SH NAME
fbt \- DTrace function boundary tracing provider
.SH DESCRIPTION
.sp
.LP
The \fBfbt\fR driver is a DTrace dynamic tracing provider that performs dynamic
instrumentation at function boundaries in the Solaris kernel.
.sp
.LP
The function is the fundamental unit of program text. In a well-designed
system, the function performs a discrete and well-defined operation on a
specified object or series of like objects. Most functions are implemented by
themselves calling functions on encapsulated objects, but some functions
\(emso-called "leaf functions" \(em are implemented without making further
function calls. The Function Boundary Tracing \fBfbt\fR provider contains a
mechanism for instrumenting the vast majority of functions in the kernel and
offering the instrumentation as a set of DTrace probes.
.sp
.LP
The \fBfbt\fR driver is not a public interface and you access the
instrumentation offered by this provider through DTrace. Refer to the
\fISolaris Dynamic Tracing Guide\fR for a description of the public documented
interfaces available for the DTrace facility and the probes offered by the
\fBfbt\fR provider.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Private
.TE

.SH SEE ALSO
.sp
.LP
\fBdtrace\fR(1M), \fBattributes\fR(5), \fBdtrace\fR(7D)
.sp
.LP
\fISolaris Dynamic Tracing Guide\fR
