illumos/illumos-gate/usr/src/man/man7d/fcp.7d
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FCP 7D "Oct 20, 2004"
.SH NAME
fcp \- Fibre Channel protocol driver
.SH DESCRIPTION
.sp
.LP
The \fBfcp\fR driver is the upper layer protocol that supports mechanisms for
transporting \fBSCSI\fR-3 commands over Fibre Channel. The \fBfcp\fR driver,
which interfaces with the Sun Fibre Channel transport library \fBfctl\fR(7D),
supports the standard functions provided by the \fBSCSA \fRinterface.
.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/drv/fcp\fR\fR
.ad
.RS 27n
32-bit ELF kernel driver (x86)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/fcp\fR\fR
.ad
.RS 27n
64-bit ELF kernel driver (x86)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/fcp\fR\fR
.ad
.RS 27n
64-bit ELF kernel driver (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See attributes(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC
_
Interface stability	Unknown
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBdriver.conf\fR(4), \fBfctl\fR(7D), \fBfp\fR(7d),
\fBusoc\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIFibre Channel Physical and Signaling Interface (FC-PH) ANSI X3.230: 1994\fR
.sp
.LP
\fIFibre Channel Generic Services (FC-GS-2) Project 1134-D\fR
.sp
.LP
\fIFibre Channel Arbitrated Loop (FC-AL) ANSI X3.272-1996\fR
.sp
.LP
\fIFibre Channel Protocol for SCSI (FCP) ANSI X3.269-1996\fR
.sp
.LP
\fISCSI-3 Architecture Model (SAM) Fibre Channel Private Loop SCSI Direct
Attach (FC-PLDA) ANSI X3.270-1996\fR
.sp
.LP
\fIFabric Loop Attachment (FC-FLA), NCITS TR-20:1998\fR
