illumos/illumos-gate/usr/src/man/man7d/fctl.7d
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH fctl 7D "20 Oct 2004" "SunOS 5.11" "Devices"
.SH NAME
fctl \- Sun Fibre Channel transport library
.SH DESCRIPTION
.sp
.LP
The \fBfctl\fR kernel module interfaces the Sun Fibre Channel upper layer
protocol (ULP) mapping modules with Sun Fibre Channel adapter (FCA) drivers.
There are no user-configurable options for this module.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/fctl\fR\fR
.ad
.RS 29n
.rt  
 32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/fctl\fR\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/fctl\fR\fR
.ad
.RS 29n
.rt  
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See attributes(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
Interface stabilityUnknown
.TE

.SH SEE ALSO
.sp
.LP
\fBfp\fR(7d)
