illumos/illumos-gate/usr/src/man/man7d/ibcm.7d
'\" te
.\"  Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ibcm 7D "2 Apr 2004" "SunOS 5.11" "Devices"
.SH NAME
ibcm \- Solaris InfiniBand Communication Manager
.SH DESCRIPTION
.sp
.LP
The Solaris InfiniBand Communication Manager (\fBIBCM\fR) is a Solaris kernel
misc module that adheres to the \fIInfiniBand Architecture Specification,
Volume 1: Release 1.1\fR for InfiniBand Communication Management Class.
.sp
.LP
\fBIBCM\fR provides a transport layer abstraction to IB clients to set up
reliable connected channels along with service, multicast, and path
lookup-related functionality. \fBIBCM\fR implements the CM protocol as per the
\fIInfiniBand Architecture Specification, Volume 1: Release 1.1\fR and utilizes
the InfiniBand Management Framework module for all IB management-related
functionality and the InfiniBand Transport Layer (see \fBibtl\fR(7D)) for all
IB Verbs-related functionality.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/ibcm\fR\fR
.ad
.RS 29n
.rt  
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/ibcm\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/ibcm\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attribute:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stability Consolidation Private
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBibtl\fR(7D)
.sp
.LP
\fIInfiniBand Architecture Specification, Volume 1: Release 1.1\fR
