illumos/illumos-gate/usr/src/man/man7d/ibdm.7d
'\" te
.\"  Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ibdm 7D "9 Oct 2004" "SunOS 5.11" "Devices"
.SH NAME
ibdm \- Solaris InfiniBand Device Manager
.SH DESCRIPTION
.sp
.LP
The Infiniband Device Manager (\fBIBDM\fR) is an IBTF-compliant kernel misc
module. \fBIBDM\fR adheres to the InfiniBand Device Management class as
described in \fIInfiniBand Architecture Specification, Volume 1: Release 1.1\fR
and enumerates all the devices which are visible from a given host and
maintains a data base of all IB devices visible to the host. \fBIBDM\fR
provides interfaces to the IB nexus driver that enables the driver to retrieve
information about IB devices on the fabric.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/ibdm\fR\fR
.ad
.RS 29n
.rt  
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/ibdm\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/ibdm\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attribute:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stability Contract Consolidation Private
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBib\fR(7D), \fBibtl\fR(7D), \fBibcm\fR(7D)
.sp
.LP
\fIInfiniBand Architecture Specification, Volume 1: Release 1.1\fR
.SH DIAGNOSTICS
.sp
.LP
None.
