illumos/illumos-gate/usr/src/man/man7d/ii.7d
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH II 7D "Jun 8, 2007"
.SH NAME
ii \- Instant Image control device
.SH DESCRIPTION
.sp
.LP
The \fBii\fR device is a control interface for Instant Image devices and
controls the Instant Image module through the \fBioctl\fR(2) interface.
.sp
.LP
Instant Image is a point-in-time volume copy facility for the Solaris operating
environment that is administered through the \fBiiadm\fR(1M) command. With
Instant Image, you can create an independent point-in-time copy of a volume or
a master volume-dependent point-in-time view.  You can also independently
access the master and shadow volume for read and write operations. Instant
Image also lets you update the shadow volume from the master volume or restore
the master volume from the shadow. (Restore operations to volumes can be full
or incremental). Instant Image supports fast volume re-synchronization, letting
you create a new point-in-time volume copy by updating the specified volume
with only changed data.
.sp
.LP
To create a shadow volume you need a:
.RS +4
.TP
1.
Master volume to be shadowed.
.RE
.RS +4
.TP
2.
Shadow volume where the copy will reside. This volume must be equal to or
larger than the master volume.
.RE
.RS +4
.TP
3.
Administrative bitmap volume or file for tracking differences between the
shadow and master volumes. The administrative bitmap volume or file must be at
least 24Kbytes in size and requires 8KBytes for each GByte (or part thereof) of
master volume size, plus an additional 8KBytes overhead. For example, to shadow
a 3GByte master volume, the administration volume must be 8KBytes + (3 *
8KBytes) =32KBytes in size.
.RE
.sp
.LP
The Instant Image module uses services provided by the SDBC and SD_GEN modules.
The SV module is required to present a conventional block device interface to
the storage product interface of the Instant Image, SDBC and SD_GEN modules.
.sp
.LP
When a shadow operation is suspended or resumed, the administration volumes may
be stored in permanent SDBC storage or loaded and saved to and from kernel
memory. The ii_bitmap variable in the \fB/kernel/drv/ii.conf\fR configuration
file determines the administration volume storage type. A value of 0 indicates
kernel memory, while a value of 1 indicates permanent SDBC storage.  If the
system is part of a storage products cluster, use the 1 value (permanent
storage), otherwise use kernel memory (0 value).
.SH FILES
.sp
.ne 2
.na
\fB\fBkernel/drv/ii\fR\fR
.ad
.RS 23n
32- bit ELF kernel module (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/ii.conf\fR\fR
.ad
.RS 23n
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBiiadm\fR(1M), \fBioctl\fR(2), \fBattributes\fR(5), \fBsv\fR(7D)
