illumos/illumos-gate/usr/src/man/man7d/ixgbe.7d
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\"  Copyright 2012, Nexenta Systems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with
.\" the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH IXGBE 7D "Jun 3, 2009"
.SH NAME
ixgbe \- Intel 10Gb PCI Express NIC Driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/ixgbe*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBixgbe\fR 10 Gigabit Ethernet driver is a multi-threaded, loadable,
clonable, GLD-based STREAMS driver supporting the Data Link Provider Interface,
\fBdlpi\fR(7P), on Intel 10-Gigabit PCI Express Ethernet controllers.
.sp
.LP
The \fBixgbe\fR driver functions include controller initialization, frame
transmit and receive, promiscuous and multicast support, and error recovery and
reporting.
.sp
.LP
The \fBixgbe\fR driver and hardware support auto-negotiation, a protocol
specified by the \fIIEEE 802.3ae\fR specification.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device, \fB/dev/ixgbe\fR, is used to access all
Intel 10 -Gigabit PCI Express Ethernet devices installed within the system.
.sp
.LP
The \fBixgbe\fR driver is managed by the \fBdladm\fR(1M) command line utility,
which allows VLANs to be defined on top of \fBixgbe\fR instances and for
\fBixgbe\fR instances to be aggregated. See \fBdladm\fR(1M) for more details.
.sp
.LP
You must send an explicit DL_ATTACH_REQ message to associate the opened stream
with a particular device (PPA). The PPA ID is interpreted as an unsigned
integer data type and indicates the corresponding device instance (unit)
number. The driver returns an error (DL_ERROR_ACK) if the PPA field value does
not correspond to a valid device instance number for the system. The device is
initialized on first attach and de-initialized (stopped) at last detach.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response to
your DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU is 16366.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is DL_ETHER.
.RE
.RS +4
.TP
.ie t \(bu
.el o
SAP (Service Access Point) length value is -2, meaning the physical address
component is followed immediately by a 2-byte SAP component within the DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address
(FF:FF:FF:FF:FF:FF).
.sp
Once in the DL_ATTACHED state, you must send a DL_BIND_REQ to associate a
particular SAP with the stream.
.RE
.SH CONFIGURATION
.sp
.LP
By default, the \fBixgbe\fR driver performs auto-negotiation to select the link
speed and mode. Link speed and mode can only be 10000 Mbps full-duplex for fiber, and only 10000, 1000, or 100 Mbps full-duplex for copper. See the
\fIIEEE802.3\fR standard for more information.
.SH FILES
.sp
.ne 2
.na
\fB\fB/dev/ixgbe*\fR\fR
.ad
.RS 29n
Special character device.
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/ixgbe\fR\fR
.ad
.RS 29n
32-bit device driver (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/ixgbe\fR\fR
.ad
.RS 29n
64-bit device driver (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/ixgbe\fR\fR
.ad
.RS 29n
64-bit device driver (SPARC).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/ixgbe.conf\fR\fR
.ad
.RS 29n
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
l l
l l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
Architecture	SPARC, x86
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5),
\fBstreamio\fR(7I), \fBdlpi\fR(7P)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
.sp
.LP
\fIIEEE 802.3ae Specificiation\fR, IEEE - 2002
