illumos/illumos-gate/usr/src/man/man7d/kmdb.7d
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH kmdb 7d "8 May 2004" "SunOS 5.11" "Devices"
.SH NAME
kmdb \- Kernel debugger
.SH DESCRIPTION
.sp
.LP
The \fBkmdb\fR driver is the mechanism used by mdb to invoke and control
\fBkmdb\fR. This is \fBnot\fR a public interface.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/kmdb\fR
.ad
.RS 13n
.rt  
Kernel debugger driver.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
