illumos/illumos-gate/usr/src/man/man7d/mr_sas.7d
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH MR_SAS 7D "May 28, 2009"
.SH NAME
mr_sas \- LSI MegaRAID SAS2.0 Controller HBA driver
.SH DESCRIPTION
.sp
.LP
The \fBmr_sas\fR MegaRAID SAS2.0 controller host bus adapter driver is a
SCSA-compliant nexus driver that supports the LSI MegaRAID SAS 92\fIxx\fR
series of controllers and the Sun StorageTek 6Gb/s SAS RAID HBA series of
controllers.
.sp
.LP
Some of the RAID Features include the following:
.RS +4
.TP
.ie t \(bu
.el o
RAID levels 0, 1, 5, and 6
.RE
.RS +4
.TP
.ie t \(bu
.el o
RAID spans 10, 50, and 60
.RE
.RS +4
.TP
.ie t \(bu
.el o
Online Capacity Expansion (OCE)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Online RAID Level Migration (RLM)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Auto resume after loss of system power during arrays array rebuild or
reconstruction (RLM)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configurable stripe size up to 1MB
.RE
.RS +4
.TP
.ie t \(bu
.el o
Check Consistency for background data integrity
.RE
.RS +4
.TP
.ie t \(bu
.el o
Patrol read for media scanning and repairing
.RE
.RS +4
.TP
.ie t \(bu
.el o
64 logical drive support
.RE
.RS +4
.TP
.ie t \(bu
.el o
Up to 64TB LUN support
.RE
.RS +4
.TP
.ie t \(bu
.el o
Automatic rebuild
.RE
.RS +4
.TP
.ie t \(bu
.el o
Global and dedicated Hot Spare support
.RE
.SS "Configuration"
.sp
.LP
The \fBmr_sas.conf\fR file contains one user configurable parameter, for MSI or
MSI-X support. Configure your hardware through the related BIOS utility or the
MegaCli Configuration Utility. If you want to install to a drive attached to a
\fBmr_sas\fR HBA, create the virtual drive first from the BIOS (X86) before
running Solaris install. The \fBMegaCli\fR utility can be downloaded from the
LSI website.
.sp
.LP
The LSI MegaRAID SAS device can support up to 64 virtual SAS2.0, SAS1.0,
SATA3.0, or SATA 6.0 disks. The BIOS numbers the virtual disks as 1 through 64,
however in Solaris these drives are numbered from 0 to 63. Also keep in mind
that SAS and SATA drives can not be configured into the same virtual disk.
.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/drv/mr_sas\fR\fR
.ad
.RS 30n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/mr_sas\fR\fR
.ad
.RS 30n
64-bit kernel module x86 ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/mr_sas\fR\fR
.ad
.RS 30n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/mr_sas.conf\fR\fR
.ad
.RS 30n
Driver configuration file containing one user-configurable option
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
l | l
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC, x86
_
Interface Stability	Uncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBattributes\fR(5), \fBsata\fR(7D),
\fBscsi_hba_attach_setup\fR(9F), \fBscsi_sync_pkt\fR(9F),
\fBscsi_transport\fR(9F), \fBscsi_device\fR(9S), \fBscsi_inquiry\fR(9S),
\fBscsi_pkt\fR(9S)
.sp
.LP
\fISmall Computer System Interface-2 (SCSI-2)\fR
.SH NOTES
.sp
.LP
The \fBmr_sas\fR driver only supports internal and external expanders that are
not fully SAS1.0 or fully SAS2.0 compliant.
