illumos/illumos-gate/usr/src/man/man7d/msglog.7d
'\" te
.\"  Copyright (c) 1998, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH MSGLOG 7D "Oct 13, 1998"
.SH NAME
msglog \- message output collection from system startup or background
applications
.SH SYNOPSIS
.LP
.nf
\fB/dev/msglog\fR
.fi

.SH DESCRIPTION
.sp
.LP
Output from system startup ("rc") scripts is directed to \fB/dev/msglog\fR,
which dispatches it appropriately.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Stable
.TE

.SH SEE ALSO
.sp
.LP
\fBsyslogd\fR(1M), \fBsyslog\fR(3C), \fBattributes\fR(5), \fBsysmsg\fR(7D)
.SH NOTES
.sp
.LP
In the current version of Solaris, \fB/dev/msglog\fR is an alias for
\fB/dev/sysmsg\fR.  In future versions of Solaris, writes to \fB/dev/msglog\fR
may be directed into a  more general logging mechanism such as
\fBsyslogd\fR(1M).
.sp
.LP
\fBsyslog\fR(3C) provides a more general logging mechanism  than
\fB/dev/msglog\fR and should be used in preference to \fB/dev/msglog\fR
whenever possible.
