illumos/illumos-gate/usr/src/man/man7d/ncp.7d
'\" te
.\" Copyright 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced
.\" with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NCP 7D "Jun 7, 2006"
.SH NAME
ncp \- UltraSPARC T1 server crypto provider device driver
.SH DESCRIPTION
.sp
.LP
The \fBncp\fR device driver is a multi-threaded, loadable hardware driver
supporting hardware assisted acceleration of RSA and DSA cryptographic
operations. This support is built into the UltraSPARC T1 processor.
.sp
.LP
The \fBncp\fR driver requires the presence of the \fISolaris Cryptographic
Framework\fR to enable applications and kernel clients to access the provided
services.
.SH CONFIGURATION
.sp
.LP
You configure the \fBncp\fR driver by defining  properties in
\fB/platform/sun4v/kernel/drv/ncp.conf\fR which override the default settings.
The following property is supported:
.sp
.ne 2
.na
\fBnostats\fR
.ad
.RS 11n
Disables the generation of  statistics. The \fBnostats\fR property may be used
to help prevent traffic  analysis, but this may inhibit support personnel.
.RE

.SH NETWORK STATISTICS
.sp
.LP
Solaris network drivers must implement statistics variables. The \fBncp\fR
driver maintains the following statistics:
.sp
.ne 2
.na
\fBmauXqfull\fR
.ad
.RS 22n
Number of times the queue for MAU X was found full when attempting to submit
jobs.
.RE

.sp
.ne 2
.na
\fBmauXupdate_failure\fR
.ad
.RS 22n
Number of submit job failures on MAU X.
.RE

.sp
.ne 2
.na
\fBmauXsubmit\fR
.ad
.RS 22n
Number of jobs submitted to MAU X since driver load (boot).
.RE

.sp
.ne 2
.na
\fBrsapublic\fR
.ad
.RS 22n
Total number of  jobs submitted to the device for RSA public key operations.
.RE

.sp
.ne 2
.na
\fBrsaprivate\fR
.ad
.RS 22n
Total number of  jobs submitted to the device for RSA private key operations.
.RE

.sp
.ne 2
.na
\fBdsasign\fR
.ad
.RS 22n
Total number of  jobs submitted to the device for DSA signing.
.RE

.sp
.ne 2
.na
\fBdsaverify\fR
.ad
.RS 22n
Total number of jobs submitted to the device for DSA verification.
.RE

.sp
.LP
Additional statistics may be supplied for Sun support personnel, but are not
useful to Solaris users and are not doc-    umented in this manpage.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC
_
Interface Stability 	Unstable
.TE

.SH FILES
.sp
.ne 2
.na
\fB\fB/platform/sun4v/kernel/drv/sparcv9/ncp\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver.
.RE

.sp
.ne 2
.na
\fB\fB/platform/sun4v/kernel/drv/ncp.conf\fR\fR
.ad
.sp .6
.RS 4n
Configuration file.
.RE

.SH SEE ALSO
.sp
.LP
\fBcryptoadm\fR(1M), \fBkstat\fR(1M), \fBprtconf\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fISolaris Cryptographic Framework\fR \(em Solaris Software Developer
Collection
.sp
.LP
\fISolaris Security for Developer's Guide\fR \(em Solaris Software Developer
Collection
