illumos/illumos-gate/usr/src/man/man7d/nxge.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NXGE 7D "Apr 12, 2008"
.SH NAME
nxge \- Sun 10/1 Gigabit Ethernet network driver
.SH SYNOPSIS
.LP
.nf
/dev/nxge*
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnxge\fR Gigabit Ethernet driver is a multi-threaded, loadable, clonable,
GLD-based STREAMS driver supporting the Data Link Provider Interface,
\fBdlpi\fR(7P), on Sun Gigabit Ethernet hardware (NIU, Sun x8, Express Dual 10
Gigabit Ethernet fiber XFP low profile adapter and the 10/100/1000BASE-T x8
Express low profile adapter).
.sp
.LP
The \fBnxge\fR driver functions include chip initialization, frame transmit and
receive, flow classification, multicast and promiscuous support, and error
recovery and reporting.
.sp
.LP
The \fBnxge\fR device provides fully-compliant \fIIEEE 802.3ae\fR 10Gb/s full
duplex operation using XFP-based 10GigE optics (NIU, dual 10 Gigabit fiber XFP
adapter). The Sun Ethernet hardware supports the \fIIEEE 802.3x\fR frame-based
flow control capabilities.
.sp
.LP
For the 10/100/1000BASE-T adapter, the \fBnxge\fR driver and hardware support
auto-negotiation, a protocol specified by the \fI1000 Base-T\fR standard.
Auto-negotiation allows each device to advertise its capabilities and discover
those of its peer (link partner). The highest common denominator supported by
both link partners is automatically selected, yielding the greatest available
throughput while requiring no manual configuration. The \fBnxge\fR driver also
allows you to configure the advertised capabilities to less than the maximum
(where the full speed of the interface is not required) or to force a specific
mode of operation, irrespective of the link partner's advertised capabilities.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device, \fB/dev/nxge\fR, is used to access all
Sun Neptune NIU devices installed within the system.
.sp
.LP
The \fBnxge\fR driver is managed by the \fBdladm\fR(1M) command line utility,
which allows VLANs to be defined on top of \fBnxge\fR  instances and for
\fBnxge\fR instances to be aggregated. See \fBdladm\fR(1M) for more details.
.sp
.LP
You must send an explicit DL_ATTACH_REQ message to associate the opened stream
with a particular device (PPA). The PPA ID is interpreted as an unsigned
integer data type and indicates the corresponding device instance (unit)
number. The driver returns an error (DL_ERROR_ACK) if the PPA field value does
not correspond to a valid device instance number for the system. The device is
initialized on first attach and de-initialized (stopped) at last detach.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response to a
DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum  SDU (default 1500).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU (default 0). The driver pads to the  mandatory 60-octet minimum
packet size.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is \fBDL_ETHER\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR length value is \fI-2\fR, meaning the physical address component is
followed immediately by a 2-byte \fBSAP\fR component within the \fBDLSAP\fR
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address
(FF:FF:FF:FF:FF:FF).
.sp
Due to the nature of link address definition for IPoIB, the
DL_SET_PHYS_ADDR_REQ DLPI primitive is not supported.
.sp
In the transmit case for streams that have been put in raw mode via the
DLIOCRAW ioctl, the dlpi application must prepend the 20 byte IPoIB destination
address to the data it wants to transmit over-the-wire. In the receive case,
applications receive the IP/ARP datagram along with the IETF defined 4 byte
header.
.RE
.sp
.LP
Once in the DL_ATTACHED state, you must send a DL_BIND_REQ to associate a
particular Service Access Point (SAP) with the stream.
.SH CONFIGURATION
.sp
.LP
For the \fI10/100/1000BASE-T\fR adapter, the \fBnxge\fR driver performs
auto-negotiation to select the link speed and mode. Link speed and mode may be
10000 Mbps full-duplex (10 Gigabit adapter), 1000 Mbps full-duplex, 100 Mbps
full-duplex, or 10 Mbps full-duplex, depending on the hardware adapter type.
See  the \fI IEEE802.3\fR standard for more information.
.sp
.LP
The auto-negotiation protocol automatically selects the 1000 Mbps, 100 Mbps, or
10 Mbps operation modes (full-duplex only) as the highest common denominator
supported by both link partners. Because the \fBnxge\fR device supports all
modes, the effect is to select the highest throughput mode supported by the
other device.
.sp
.LP
You can also set the capabilities advertised by the \fBnxge\fR device using
\fBdladm\fR(1M). The driver supports a number of parameters whose names begin
with \fBen_\fR (see below). Each of these parameters contains a boolean value
that determines if the device advertises that mode of operation. The
\fBadv_autoneg_cap\fR parameter controls  whether auto-negotiation is
performed. If  \fBadv_autoneg_cap\fR  is set to 0, the driver forces the mode
of operation selected by the first  non-zero parameter in priority order as
shown below:
.sp
.in +2
.nf
                            (highest priority/greatest throughput)
        en_1000fdx_cap          1000Mbps full duplex
        en_100fdx_cap           100Mbps full duplex
        en_10fdx_cap            10Mbps full duplex
                         (lowest priority/least throughput)
.fi
.in -2

.sp
.LP
All capabilities default to enabled. Note that changing any capability
parameter causes the link to go down while the link partners renegotiate the
link speed/duplex using the newly changed capabilities.
.SH FILES
.sp
.ne 2
.na
\fB\fB/dev/nxge*\fR\fR
.ad
.RS 28n
Special character device.
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/nxge\fR\fR
.ad
.RS 28n
32-bit device driver (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/nxge\fR\fR
.ad
.RS 28n
64-bit device driver (SPARC).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/nxge\fR\fR
.ad
.RS 28n
64-bit device driver (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/nxge.conf\fR\fR
.ad
.RS 28n
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBattributes\fR(5), \fBstreamio\fR(7I),
\fBdlpi\fR(7P), \fBdriver.conf\fR(4)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
.sp
.LP
\fIIEEE 802.3ae Specification\fR \(em 2002
