illumos/illumos-gate/usr/src/man/man7d/oplmsu.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH OPLMSU 7D "Apr 18, 2006"
.SH NAME
oplmsu \- Serial I/O multiplexing STREAMS device driver
.SH SYNOPSIS
.LP
.nf
\fB/pseudo-console\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBoplmsu\fR driver is a STREAMS multiplexer driver that connects multiple
serial devices to the system console.
.sp
.LP
Currently, this support is provided only on a SPARC Enterprise Server.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Private
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
