illumos/illumos-gate/usr/src/man/man7d/pcic.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH pcic 7D "27 June 2006" "SunOS 5.11" "Devices"
.SH NAME
pcic \- Intel i82365SL PC Card Interface Controller
.SH DESCRIPTION
.sp
.LP
The Intel i82365SL PC Card interface controller provides one or more \fBPCMCIA
PC\fR card sockets. The \fBpcic\fR driver implements a \fBPCMCIA\fR bus nexus
driver.
.sp
.LP
The driver provides basic support for the Intel 82365SL and compatible chips.
Tested chips are:
.RS +4
.TP
.ie t \(bu
.el o
Intel \(em 82365SL.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Cirrus Logic \(em PD6710/PD6720/PD6722.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Vadem \(em VG365/VG465/VG468/VG469.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Toshiba \(em PCIC and ToPIC
.RE
.RS +4
.TP
.ie t \(bu
.el o
Ricoh \(em RF5C366/RL5C466/RL5C475/RL5C476/RL5C477/RL5C478.
.RE
.RS +4
.TP
.ie t \(bu
.el o
02Micro \(em OZ6912/6972.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Texas Instruments \(em PCI1130/PCI1131/PCI1031/PCI1221/PCI1225/PCI1520/PCI
1410/PCI1420/PCI4520/PCI7510/PCI7621.
.RE
.sp
.LP
While most systems using one of the above chips will work, some systems are not
supported due to hardware designs options that may not be software detectable.
.sp
.LP
Direct access to the \fBPCMCIA\fR hardware is not supported. All device access
must be through the DDI.
.SH CONFIGURATION
.sp
.LP
Configuration of PC Card interface controllers are automatically done in the
system by leveraging ACPI on x86 (or OBP on SPARC). Configuration includes
allocation of device memory, I/O ports, CardBus subordinary bus number and
interrupts. There is no      user-interference required. Note that the
controller may not work when ACPI is disabled.
.sp
.LP
There is one driver configuration property defined in the \fBpcic.conf\fR file:
.sp
.ne 2
.mk
.na
\fB\fBinterrupt-priorities=6;\fR\fR
.ad
.RS 27n
.rt  
This   property must be defined and  must  be  below 10.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/pcic\fR\fR
.ad
.RS 25n
.rt  
\fBpcic\fR driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/pcic.conf\fR\fR
.ad
.RS 25n
.rt  
\fBpcic\fR configuration file.
.RE

.SH SEE ALSO
.sp
.LP
\fBcardbus\fR(4), \fBstp4020\fR(7D), \fBpcmcia\fR(7D)
