illumos/illumos-gate/usr/src/man/man7d/radeon.7d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with
.\" the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH RADEON 7D "Jun 24, 2009"
.SH NAME
radeon \- DRI (Direct Rendering Infrastructure)-compliant kernel driver
providing 3-dimensional graphic hardware acceleration support.
.SH DESCRIPTION
.sp
.LP
The \fBradeon\fR driver is a DRI-compliant  kernel driver that provides
graphics hardware acceleration support. DRI is a framework for coordinating OS
kernel, 3D  graphics hardware, X window system and OpenGL applications.
.sp
.LP
The \fBradeon\fR driver currently supports certain low-end ATI radeon graphics
cards, including Radeon X700.
.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/drv/radeon\fR\fR
.ad
.RS 28n
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/radeon\fR\fR
.ad
.RS 28n
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture 	x86
_
Interface Stability 	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fB/usr/X11/share/man/man1/Xserver.1\fR
.sp
.LP
\fB/usr/X11/share/man/man1/Xorg.1\fR
.sp
.LP
\fB/usr/X11/share/man/man5/X11.5\fR
.sp
.LP
\fBattributes\fR(5)
