illumos/illumos-gate/usr/src/man/man7d/sda.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SDA 7D "Jan 8, 2009"
.SH NAME
sda \- SD/MMC architecture
.SH DESCRIPTION
.sp
.LP
The \fBsda\fR module provides support services for Secure Digital (SD) and
MultiMediaCard (MMC) slot and card device drivers.
.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/misc/sda\fR\fR
.ad
.RS 28n
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/misc/amd64/sda\fR\fR
.ad
.RS 28n
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBsdhost\fR(7D)
.SH NOTES
.sp
.LP
The \fBsda\fR module provides support only for SD/MMC devices that are
connected via a supported slot driver. Notably, slots that are on USB busses
are normally treated as USB mass storage devices and are serviced by the
\fBscsa2usb\fR(7D) driver.
