illumos/illumos-gate/usr/src/man/man7d/sdcard.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SDCARD 7D "Feb 28, 2008"
.SH NAME
sdcard \- SD/MMC memory card driver
.SH DESCRIPTION
.sp
.LP
The \fBsdcard\fR memory card driver supports MultiMediaCard (MMC), Secure
Digital (SD), and Secure Digital High Capacity (SDHC) memory cards. It uses the
\fBblk2scsa\fR(7D) service to present these cards to the system as SCSI disks
on a virtual SCSI bus, creating a child device to be serviced with
\fBsd\fR(7D). Each card appears as its own SCSI LUN. Cards are hot-pluggable
and removable.
.SH DEVICE SPECIAL FILES
.sp
.LP
Disk block special file names are located in \fB/dev/dsk\fR. Raw file names are
located in \fB/dev/rdsk\fR.  See \fBsd\fR(7D).
.SH IOCTLS
.sp
.LP
See \fBdkio\fR(7I)
.SH ERRORS
.sp
.LP
See \fBsd\fR(7D) and \fBblk2scsa\fR(7D). Additionally, \fBsdcard\fR may issue
the following warnings, which indicate a failure to identify the card as a
supported type:
.sp
.in +2
.nf
"Unknown SD CSD version (%d)"
"Unknown MMC CSD version (%d)"
"Unknown MMCA version (%d)"
"Card type unknown"
.fi
.in -2

.SH FILES
.sp
.LP
Device special files for the storage device are created in the same way as
those for a SCSI disk. See \fBsd\fR(7D) for more information.
.sp
.ne 2
.na
\fB/dev/dsk/c\fIn\fRt\fIn\fRd\fIn\fRs\fIn\fR\fR
.ad
.RS 30n
Block files for disks.
.RE

.sp
.ne 2
.na
\fB/dev/rdsk/c\fIn\fRt\fIn\fRd\fIn\fRs\fIn\fR\fR
.ad
.RS 30n
Raw files for disks.
.RE

.sp
.ne 2
.na
\fB/kernel/drv/sdcard\fR
.ad
.RS 30n
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.na
\fB/kernel/misc/amd64/sdcard\fR
.ad
.RS 30n
64-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.na
\fB/kernel/drv/sparcv9/sdcard\fR
.ad
.RS 30n
64-bit ELF kernel module (SPARC).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
\fBrmformat\fR(1), \fBrmmount\fR(1), \fBcfgadm_scsi\fR(1M),
\fBcfgadm_sdcard\fR(1M), \fBfdisk\fR(1M), \fBmount\fR(1M), \fBumount\fR(1M),
\fBscsi\fR(4), \fBvfstab\fR(4), \fBattributes\fR(5), \fBblk2scsa\fR(7D),
\fBsd\fR(7D), \fBsda\fR(7D), \fBdkio\fR(7I), \fBpcfs\fR(7FS)
.sp
.LP
\fISystem Administration Guide, Volume I\fR
.sp
.LP
\fISystem Administration Guide: Basic Administration\fR
.SH DIAGNOSTICS
.sp
.LP
See \fBsd\fR(7D).
