illumos/illumos-gate/usr/src/man/man7d/sf.7d
'\" te
.\"  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH sf 7D "27 Mar 1997" "SunOS 5.11" "Devices"
.SH NAME
sf \- SOC+ FC-AL FCP Driver
.SH SYNOPSIS
.LP
.nf
sf@\fIport\fR,0 
.fi

.SH DESCRIPTION
.sp
.LP
The  \fBsf\fR driver is a SCSA compliant nexus driver which supports the Fibre
Channel Protocol for SCSI on Private Fibre Channel Arbitrated loops. An SBus
card called the  \fBSOC+\fR card (see  \fBsocal\fR(7D)) connects the Fibre
Channel loop to the host system.
.sp
.LP
The  \fBsf\fR driver interfaces with the  \fBSOC+\fR device driver,
\fBsocal\fR(7D), the SCSI disk target driver,  \fBssd\fR(7D), and the SCSI-3
Enclosure Services driver,  \fBses\fR(7D). It only supports SCSI devices of
type disk and ses.
.sp
.LP
The  \fBsf\fR driver supports the standard functions provided by the SCSA
interface.  The driver supports auto request sense and tagged queueing by
default.
.sp
.LP
The driver requires that all devices have unique hard addresses defined by
switch settings in hardware.  Devices with conflicting hard addresses will not
be accessible.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/platform/\fIarchitecture\fR/kernel/drv/sf\fR
.ad
.sp .6
.RS 4n
ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB/platform/\fIarchitecture\fR/kernel/drv/sf.conf\fR
.ad
.sp .6
.RS 4n
\fBsf\fR driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
.TE

.SH SEE ALSO
.sp
.LP
\fBluxadm\fR(1M), \fBprtconf\fR(1M), \fBdriver.conf\fR(4), \fBsocal\fR(7D),
\fBssd\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIANSI X3.272-1996, Fibre Channel Arbitrated Loop (FC-AL)\fR
.sp
.LP
\fIANSI X3.269-1996, Fibre Channel Protocol for SCSI (FCP)\fR
.sp
.LP
\fIANSI X3.270-1996, SCSI-3 Architecture Model (SAM)\fR
.sp
.LP
\fIFibre Channel Private Loop SCSI Direct Attach (FC-PLDA)\fR
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the messages below may display on the system
console.
.sp
.LP
The first set of messages indicate that the attachment was unsuccessful, and
will only display while the  \fBsf\fR driver is initially attempting to attach.
Each message is preceded by  \fBsf\fR\fI%d\fR , where  \fI%d\fR is the instance
number of the  \fBsf\fR device.
.sp
.ne 2
.mk
.na
\fBFailed to alloc soft state\fR
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for the internal state structure.  Driver
did not attach to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBBad soft state\fR
.ad
.sp .6
.RS 4n
Driver requested an invalid internal state structure. Driver did not attach to
device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBFailed to obtain transport handle\fR
.ad
.sp .6
.RS 4n
Driver was unable to obtain a transport handle to communicate with the socal
driver. Driver did not attach to device, SCSI devices will be inaccessible
.RE

.sp
.ne 2
.mk
.na
\fBFailed to allocate command/response pool\fR
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for commands and responses. Driver did not
attach to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBFailed to allocate kmem cache\fR
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for the packet cache. Driver did not attach
to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBFailed to allocate dma handle for\fR
.ad
.sp .6
.RS 4n
Driver was unable to allocate a dma handle for the loop map. Driver did not
attach to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBFailed to allocate lilp map\fR
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for the loop map. Driver did not attach to
device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBFailed to bind dma handle for\fR
.ad
.sp .6
.RS 4n
Driver was unable to bind a dma handle for the loop map. Driver did not attach
to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBFailed to attach\fR
.ad
.sp .6
.RS 4n
Driver was unable to attach for some reason that may be printed.  Driver did
not attach to device, SCSI devices will be inaccessible.
.RE

.sp
.LP
The next set of messages may display at any time.  The full device pathname,
followed by the shorter form described above, will precede the message.
.sp
.ne 2
.mk
.na
\fBInvalid lilp map\fR
.ad
.sp .6
.RS 4n
The driver did not obtain a valid lilp map from the socal driver. SCSI device
will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBTarget t, AL-PA x and hard\fR
.ad
.sp .6
.RS 4n
The device with a switch setting t has an AL-PA x which does not match its hard
address y. The device will not be accessible.
.RE

.sp
.ne 2
.mk
.na
\fBDuplicate switch settings\fR
.ad
.sp .6
.RS 4n
The driver detected devices with the same switch setting. All such devices will
be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBWWN changed on target t\fR
.ad
.sp .6
.RS 4n
The World Wide Name (WWN) has changed on the device with switch setting t.
.RE

.sp
.ne 2
.mk
.na
\fBTarget t, unknown device type\fR
.ad
.sp .6
.RS 4n
The driver does not know the device type reported by the device with switch
setting t.
.RE

