illumos/illumos-gate/usr/src/man/man7d/sv.7d
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SV 7D "Jun 8, 2007"
.SH NAME
sv \- Storage Volume system call device
.SH DESCRIPTION
.sp
.LP
The \fBsv\fR driver allows standard system call access (see \fBIntro\fR(2)) to
a disk device to be redirected into the StorageTek architecture software. This
enables standard applications to use Sun StorageTek Availability Suite
components such as Point-in-Time Copy and Remote Mirror software.
.SH FILES
.sp
.ne 2
.na
\fB\fBkernel/drv/sv\fR\fR
.ad
.RS 17n
SV control and administration driver.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBiiadm\fR(1M)
