illumos/illumos-gate/usr/src/man/man7d/usb_mid.7d
'\" te
.\" Copyright 2006 Sun Microsystems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH USB_MID 7D "May 13, 2017"
.SH NAME
usb_mid \- USB Multi Interface Driver
.SH SYNOPSIS
.LP
.nf
\fBdevice@\fR\fIunit-address\fR
.fi

.SH DESCRIPTION
.LP
The \fBusb_mid\fR driver is a \fBUSBA\fR (Solaris Universal Serial Bus
Architecture)-compliant nexus driver that binds to device level nodes of a
composite (multi interface) device if no vendor or class-specific driver is
available. The \fBusb_mid\fR driver creates interface nodes or interface
association nodes and attempts to bind drivers to them. If no driver is found
for interface association nodes, \fBusb_ia\fR(7D) is bound by default.
.SS "UGEN (Generic USB)"
.LP
The \fBusb_mid\fR driver also supports a \fBugen\fR(7D) interface allowing raw
access to the device, for example by libusb applications, by
passing the drivers bound to each interface. Since a libusb application might
change the state of the device, you should not access the device through the
child interface drivers. Note that the \fBusb_mid\fR driver creates a ugen
interface only if none of its children are explicitly bound to the
\fBugen\fR(7D) driver. Additionally, \fBusb_mid\fR does not create children.
.SH FILES
.ne 2
.na
\fB\fB/kernel/drv/usb_mid\fR \fR
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/usb_mid\fR \fR
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/usb_mid\fR \fR
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.na
\fB/dev/usb/*/*/* \fR
.ad
.sp .6
.RS 4n
ugen(7D) nodes.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC & x86, PCI-based systems
.TE

.SH SEE ALSO
.LP
\fBcfgadm_usb\fR(1M), \fBattributes\fR(5), \fBusba\fR(7D),
\fBusb_ia\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIUniversal Serial Bus Specification 2.0\fR\(em2000
.sp
.LP
\fIInterface Association Descriptor Engineering Change Notice (ECN)\fR\(em2003
.sp
.LP
\fISystem Administration Guide: Basic Administration\fR
.SH DIAGNOSTICS
.LP
In addition to being logged, the following messages may appear on the system
console. All messages are formatted in the following manner:
.sp
.in +2
.nf
Warning: <device path> (usb_mid<instance number>): Error Message...
.fi
.in -2
.sp

.sp
.ne 2
.na
\fBCannot access <device>. Please reconnect.\fR
.ad
.sp .6
.RS 4n
This device has been disconnected because a device other than the original one
has been inserted. The driver informs you of this fact by displaying the name
of the original device.
.RE

.sp
.ne 2
.na
\fBDevice not identical to the previous one on this port. Please disconnect and
reconnect.\fR
.ad
.sp .6
.RS 4n
Same condition as described above; however in this case, the driver is unable
to identify the original device with a name string.
.RE

.sp
.ne 2
.na
\fBPlease disconnect and reconnect this device.\fR
.ad
.sp .6
.RS 4n
A hotplug of the device is needed before it can be restored.
.RE

.sp
.LP
The following messages may be logged into the system log. They are formatted in
the following manner:
.sp
.in +2
.nf
<device path><usb_mid<instance number>): message...
.fi
.in -2
.sp

.sp
.ne 2
.na
\fBNo driver found for interface <n> (nodename: <string>) of <device>. \fR
.ad
.sp .6
.RS 4n
No driver is available for this interface.
.RE

.sp
.ne 2
.na
\fBNo driver found for device <device>. \fR
.ad
.sp .6
.RS 4n
No driver is available for this interface.
.RE

.sp
.ne 2
.na
\fBCan't support ugen for multiple configuration devices that have attached
child interface drivers.\fR
.ad
.sp .6
.RS 4n
No ugen interface is available and libusb cannot work with this
device.
.RE

