illumos/illumos-gate/usr/src/man/man7d/usmn.7d
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\"
.\" Copyright 2020 Oxide Computer Company
.\"
.Dd September 1, 2020
.Dt USMN 7D
.Os
.Sh NAME
.Nm usmn
.Nd AMD SMN user access driver
.Sh SYNOPSIS
.Pa /devices/pseudo/amdzen@0/usmn@2:usmn.*
.Sh DESCRIPTION
The
.Nm
driver provides the ability to read data from the AMD system management
network
.Pq SMN
on AMD Family 17h
.Pq Zen, Zen+, and Zen 2
processors.
.Pp
This driver is intended strictly for facilitating platform development
and is not recommended for systems that aren't doing kernel development
on AMD Zen platforms.
.Sh SEE ALSO
.Xr amdzen 7D ,
.Xr zen_udf 7D
