illumos/illumos-gate/usr/src/man/man7d/uwba.7d
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH UWBA 7D "Apr 17, 2009"
.SH NAME
uwba, uwb \- Solaris UWB Architecture (UWBA)
.SH DESCRIPTION
.sp
.LP
Ultra-WideBand (UWB) radio technology supports high bandwidth for wireless
devices. UWBA is a miscellaneous module and it supports radio controller
drivers for UWB based devices like HWA (Host Wire Adapter), WHCI (Wireless Host
Controller Interface) and so forth. For example, both HWA radio controller
driver (\fBhwarc\fR) and \fBwhci\fR driver register to \fBuwba\fR during
attach.
.sp
.LP
UWBA provides a series of common interfaces for drivers that support UWB radio
technology. Each radio controller driver register itself as a UWB dev to the
uwba model in the attach entry, then other driver or module can control this
device to perform the UWB functions through a list of common interface. For
example, a \fBhwahc\fR driver can control the \fBhwarc\fR driver to scan in a
specific channel, start/stop beacon, manage device/MAC address, and so forth.
.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/misc/uwba\fR\fR
.ad
.RS 29n
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/misc/amd64/uwba\fR\fR
.ad
.RS 29n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/misc/sparcv9/uwba\fR\fR
.ad
.RS 29n
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
l | l
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	PCI-based systems
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBhwahc\fR(7D), \fBhwarc\fR(7D), \fBusba\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIECMA-368 High Rate Ultra Wideband PHY and MAC Standard, 1st Edition\fR
.sp
.LP
\fIWireless Host Controller Interface Specification for Certified Wireless
Universal Serial Bus, Version 0.95\fR
.sp
.LP
\fIWireless Universal Serial Bus Specification 1.0\fR
