illumos/illumos-gate/usr/src/man/man7d/vr.7d
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH vr 7D "5 May 2009" "SunOS 5.11" "Devices"
.SH NAME
vr \- driver for VIA Rhine fast Ethernet controllers
.SH DESCRIPTION
.sp
.LP
The \fBvr\fR Fast Ethernet driver is GLD based and supporting the VIA Rhine
family of Fast Ethernet adapters:
.sp
.in +2
.nf
pci1106,3043 VIA VT86C100A Fast Ethernet
pci1106,3065 VT6102 VIA Rhine II
pci1106,3106 VT6105 VIA Rhine III
pci1106,3053 VT6105 VIA Rhine III Management Adapter
.fi
.in -2
.sp

.sp
.LP
The \fBvr\fR driver supports IEEE 802.3 auto-negotiation, flow control and VLAN
tagging.
.SS "Configuration"
.sp
.LP
The default configuration is \fBautonegotiation\fR with bidirectional flow
control. The advertised capabilities for \fBautonegotiation\fR are based on the
capabilities of the PHY.
.sp
.LP
You can set the capabilities advertised by the \fBvr\fR controlled device using
\fBdladm\fR(1M). The driver supports a number of parameters, the names of which
begin with \fBen_\fR (enabled). Each of these boolean parameters determines if
the device advertises that mode of operation when the hardware supports it.
.sp
.LP
The \fBadv_autoneg_cap\fR parameter controls whether auto-negotiation is
performed. If \fBadv_autoneg_cap\fR is 0, the driver selects the speed/duplex
combination from the first non-zero parameter from this list:
.sp
.in +2
.nf
en_100fdx_cap     100Mpbs full duplex
en_100hdx_cap     100Mpbs half duplex
en_10fdx_cap      10Mpbs full duplex
en_10hdx_cap      10Mpbs half duplex
.fi
.in -2
.sp

.sp
.LP
All capabilities default to enabled. Changing any capability parameter causes
the link to go down while the link partners renegotiate the link using the
newly changed capabilities.
.SS "Limitations"
.sp
.LP
The \fBvr\fR driver does not support asymmetric \fBflowcontrol\fR. VT86C100A
and Rhine II adapters are not capable of transmitting \fBflowcontrol\fR
messages
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/vr\fR\fR
.ad
.RS 26n
.rt  
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/vr\fR\fR
.ad
.RS 26n
.rt  
32-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/vr\fR\fR
.ad
.RS 26n
.rt  
64-bit device driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/vr\fR\fR
.ad
.RS 26n
.rt  
64-bit device driver (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBnetstat\fR(1M), \fBdriver.conf\fR(4), \fBattributes\fR(5),
\fBieee802.3\fR(5), \fBdlpi\fR(7P), \fBstreamio\fR(7I)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programmer's Guide\fR
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
.sp
.LP
\fIIEEE 802.3ae Specification - 2002\fR
