illumos/illumos-gate/usr/src/man/man7d/wpi.7d
'\" te
.\" Copyright (c) 2006 Damien Bergamini
.\" Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. 3. Neither the name of the author nor the names of any co-contributors may be used to endorse
.\" or promote products derived from this software without specific prior written permission.  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
.\" OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE
.\" Portions Copyright (c) 2007 by Sun Microsystems, Inc.  All Rights Reserved.
.TH wpi 7D "23 Apr 2007" "SunOS 5.11" "Devices"
.SH NAME
wpi \- Intel Pro Wireless 802.11a/b/g 3945 driver
.SH DESCRIPTION
.sp
.LP
The \fBwpi\fR \fI802.11b/g\fR wireless NIC driver is a multi-threaded,
loadable, clonable, GLDv3-based STREAMS driver supporting the Intel Pro
Wireless 3945ABG chipset-based NIC's.
.SH CONFIGURATION
.sp
.LP
The \fBwpi\fR driver performs auto-negotiation  to determine the data rate and
mode. Supported \fI802.11b\fR data rates are 1, 2, 5.5 and 11 Mbits/sec.
Supported \fI802.11g\fR data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48
and 54 Mbits/sec.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/wpi\fR\fR
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/wpi\fR\fR
.ad
.sp .6
.RS 4n
32-bit \fBELF\fR kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/wpi\fR\fR
.ad
.sp .6
.RS 4n
64-bit \fBELF\fR kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBwificonfig\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D),
\fBdlpi\fR(7P)
.sp
.LP
\fI802.11 \(em Wireless LAN Media Access Control and Physical Layer
Specification\fR \(em IEEE, 2001
