illumos/illumos-gate/usr/src/man/man4d/audiocs.4d
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH AUDIOCS 4D "May 12, 2009"
.SH NAME
audiocs \- Crystal Semiconductor 4231 Audio driver
.SH DESCRIPTION
.sp
.LP
The \fBaudiocs\fR driver supports the Crystal Semiconductor 4231 Codec to
implement the audio device interface.
.sp
.LP
The \fBaudiocs\fR device provides support for the internal speaker, headphone,
line out, line in, microphone, and, on some platforms, internal CD-ROM audio
in.
.SH ERRORS
.sp
.LP
\fBaudiocs\fR errors are described in the \fBaudio\fR(4I) manual page.
.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/audiocs\fR\fR
.ad
.sp .6
.RS 4n
64-bit \fBaudiocs\fR driver
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/audiocs.conf\fR\fR
.ad
.sp .6
.RS 4n
\fBaudiocs\fR driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC
_
Stability level	Uncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR ioctl (2),
.BR audio (4I),
.BR mixer (4I),
.BR streamio (4I),
.BR attributes (7)
.sp
.LP
Crystal Semiconductor, Inc. \fBCS4231\fR Data Sheet
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages can appear on the system
console:
.sp
.ne 2
.na
\fB\fBplay-interrupts too low\fR\fR
.ad
.br
.na
\fB\fBrecord-interrupts too low\fR\fR
.ad
.RS 30n
The interrupt rate specified in \fBaudiocs.conf\fR is set too low. It is being
reset to the rate specified in the message. Update \fBaudiocs.conf\fR to a
higher interrupt rate.
.RE

.sp
.ne 2
.na
\fB\fBplay-interrupts too high\fR\fR
.ad
.br
.na
\fB\fBrecord-interrupts too high\fR\fR
.ad
.RS 30n
The interrupt rate specified in \fBaudiocs.conf\fR is set too high. It is being
reset to the rate specified in the message. Update \fBaudiocs.conf\fR to a
lower interrupt rate.
.RE

