illumos/illumos-gate/usr/src/man/man4d/audiocmi.4d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH AUDIOCMI 4D "June 8, 2023"
.SH NAME
audiocmi \- C-Media 8738, 8768, and 8338 driver support
.SH DESCRIPTION
The \fBaudiocmi\fR driver provides support for the C-Media 8738, 8768, and 8338
audio controllers. These are found on some motherboards and some add-in PCI
cards.
.SH FILES
.ne 2
.na
\fB\fB/kernel/drv/amd64/audiocmi\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 kernel driver module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/audiocmi.conf\fR\fR
.ad
.sp .6
.RS 4n
Driver configuration file
.RE

.SH ATTRIBUTES
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	PC-based system
.TE

.SH SEE ALSO
.BR ioctl (2),
.BR audio (4I),
.BR mixer (4I),
.BR streamio (4I),
.BR attributes (7)
