illumos/illumos-gate/usr/src/man/man4d/audioixp.4d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH AUDIOIXP 4D "June 8, 2023"
.SH NAME
audioixp \- ATI IXP400 south bridge audio digital controller interface
.SH DESCRIPTION
The \fBaudioixp\fR device uses the IXP400 south bridge audio digital controller
and a AC-97 Codec to implement the audio device interface.
.sp
.LP
The \fBaudioixp\fR  device  provides  support  for  the internal speaker,
headphone, line out, line in, and microphone.
.SH FILES
.ne 2
.na
\fB\fB/kernel/drv/audioixp.conf\fR\fR
.ad
.RS 30n
Driver configuration file
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/audioixp\fR\fR
.ad
.RS 30n
64-bit kernel driver module
.RE

.SH ATTRIBUTES
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	PC-based system
_
Stability level	Uncommitted
.TE

.SH SEE ALSO
.BR ioctl (2),
.BR audio (4I),
.BR mixer (4I),
.BR streamio (4I),
.BR attributes (7)
.sp
.LP
\fIATI IXP400 South Bridge Data Sheet\fR
