illumos/illumos-gate/usr/src/man/man4d/audiots.4d
'\" te
.\"  Copyright (c) 2009 Sun Microsystems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH AUDIOTS 4D "June 8, 2023"
.SH NAME
audiots \- Acer Laboratories Inc. M5451 audio processor interface
.SH DESCRIPTION
The \fBaudiots\fR device uses the ALI M5451 audio processor and an AC-97 Codec
to implement the audio device interface.
.sp
.LP
The \fBaudiots\fR device provides support for the internal speaker, headphone,
line out, line in, and microphone.
.SH FILES
.ne 2
.na
\fB\fB/kernel/drv/amd64/audiots\fR\fR
.ad
.sp .6
.RS 4n
64-bit \fBaudiots\fR driver
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/audiots.conf\fR\fR
.ad
.sp .6
.RS 4n
\fBaudiots\fR driver configuration file
.RE

.SH ATTRIBUTES
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
_
Stability level	Uncommitted
.TE

.SH SEE ALSO
.BR ioctl (2),
.BR audio (4I),
.BR mixer (4I),
.BR streamio (4I),
.BR attributes (7)
.sp
.LP
Acer Laboratories Inc. \fBM5451\fR PCI Audio Processor Technical Specification
