illumos/illumos-gate/usr/src/man/man4d/audioens.4d
'\" te
.\"  Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH AUDIOENS 4D "June 8, 2023"
.SH NAME
audioens \- Ensoniq ESS 1371 and ESS 1373 audio driver
.SH DESCRIPTION
The \fBaudioens\fR driver provides support for the Ensoniq ESS1371, ESS1373,
and Creative 5880 AC'97 devices. These devices are commonly known by several
different names, including the Sound Blaster PCI128 and AudioPCI '97.
.SH FILES
.ne 2
.na
\fB\fB/kernel/drv/amd64/audioens\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 kernel module
.RE

.SH ATTRIBUTES
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	x86
_
Interface Stability	Uncommitted
.TE

.SH SEE ALSO
.BR audio (4I),
.BR dsp (4I),
.BR mixer (4I),
.BR attributes (7)
