illumos/illumos-gate/usr/src/man/man4d/audio810.4d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH AUDIO810 4D "June 8, 2023"
.SH NAME
audio810 \- Intel ICH series, nVidia nForce series and AMD 8111 audio core
support
.SH DESCRIPTION
The \fBaudio810\fR driver provides support for AC 97 audio controllers embedded
in Intel ICH, nVidia nForce, and AMD 8111 chips.
.SH FILES
.ne 2
.na
\fB\fB/kernel/drv/amd64/audio810\fR\fR
.ad
.RS 30n
64-bit x86 kernel driver module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/audio810.conf\fR\fR
.ad
.RS 30n
\fBaudio810\fR driver configuration file
.RE

.SH ATTRIBUTES
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	PC-based systems
_
Interface Stability	Uncommitted
.TE

.SH SEE ALSO
.BR ioctl (2),
.BR audio (4I),
.BR mixer (4I),
.BR streamio (4I),
.BR attributes (7)
.sp
.LP
\fIAMD-8111 HyperTransport I/O Hub Data Sheet\fR \(em Advanced Micro Devices
Inc.
.sp
.LP
\fIALC655 Specification\fR \(em Realtek Inc.
.SH NOTES
Some laptops (including Sony VAIO, among others), have their on-board amplifier
powered down by default, meaning that audio is suppressed even if hardware and
the \fBaudio810\fR driver are working normally. To correct this, set the
\fBac97-amplifier=0\fR property in the \fB/kernel/drv/audio810.conf\fR to
power-up the amplifier.
