illumos/illumos-gate/usr/src/man/man4d/devinfo.4d
'\" te
.\" Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DEVINFO 4D "Jan 9, 1998"
.SH NAME
devinfo \- device information driver
.SH DESCRIPTION
.sp
.LP
The \fBdevinfo\fR driver is a private mechanism used by the
\fBlibdevinfo\fR(3LIB) interfaces to access  kernel device configuration data
and to guarantee data consistency.
.SH FILES
.sp
.LP
\fB/devices/pseudo/devinfo@0:devinfo\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7)  for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Stability Level	Private
.TE

.SH SEE ALSO
.sp
.LP
.BR libdevinfo (3LIB),
.BR attributes (7)
.sp
.LP
\fIWriting Device Drivers\fR
