illumos/illumos-gate/usr/src/man/man4d/gpio_87317.4d
'\" te
.\" Copyright (2000 Sun Microsystems, Inc.  All
.\" Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH GPIO_87317 4D "Apr 12, 2000"
.SH NAME
gpio_87317 \- General purpose I/O driver for SuperIO
.SH DESCRIPTION
.sp
.LP
The \fBgpio_87317\fR driver is the general purpose I/O driver for the National
Semiconductor SuperIO (PC87317) chipset. It supports remote system controller
(RSC) administration via an interface to the SuperIO's general purpose I/O
bits.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	Limited to SPARC systems with  SuperIO
_
Interface Stability 	Unstable
.TE

.SH SEE ALSO
.sp
.LP
\fIPC87317VUL/PC97317VUL SuperI/O Data Sheet \fR\(em National Semiconductor
