illumos/illumos-gate/usr/src/man/man4d/ibtl.4d
'\" te
.\"  Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH IBTL 4D "Oct 9, 2004"
.SH NAME
ibtl \- Solaris InfiniBand Transport Layer
.SH DESCRIPTION
.sp
.LP
InfiniBand (\fBIB\fR) is an I/O technology based on switched fabrics. The
Solaris InfiniBand Transport Layer (\fBIBTL\fR) is a Solaris kernel misc module
and adheres to the \fIIB Architecture Version 1.1\fR specification and provides
a transport layer abstraction to \fBIB\fR client drivers.
.sp
.LP
\fBIBTL\fR implements the programming interfaces for the Solaris InfiniBand
Transport Framework (\fBIBTF\fR), consisting of the IB Channel Interface (CI)
and the IB Transport Interface (TI).
.sp
.LP
The CI consists of Host Channel Adapters (HCAs) and HCA drivers. A host is
attached to the IB fabric through the CI layer. The Solaris InfiniBand CI is
Sun's API rendering of the InfiniBand Architecture (IBTA) "verbs"
specification.
.sp
.LP
The Solaris InfiniBand TI is the kernel service driver interface into the
Solaris InfiniBand Transport Framework. It provides transport and
communications setup programming interfaces for Unreliable Datagram (UD) and
Reliable Connected (RC) transport types only.
.SH FILES
.sp
.ne 2
.na
\fB\fB/kernel/misc/ibtl\fR\fR
.ad
.RS 29n
32-bit x86 ELF kernel misc module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/misc/amd64/ibtl\fR\fR
.ad
.RS 29n
64-bit x86 ELF kernel misc module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/misc/sparcv9/ibtl\fR\fR
.ad
.RS 29n
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for a description of the following attribute:
.sp

.sp
.TS
box;
l | l
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Consolidation Private
.TE

.SH SEE ALSO
.sp
.LP
.BR ib (4D),
.BR ibcm (4D),
.BR ibdm (4D),
.BR attributes (7)
.sp
.LP
\fIInfiniBand Architecture Specification, Volume 1: Release 1.1\fR
