illumos/illumos-gate/usr/src/man/man4d/ixgbe.4d
.\"
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 2012, Nexenta Systems, Inc. All rights reserved.
.\" Copyright 2016, OmniTI Computer Consulting, Inc. All rights reserved.
.\" Copyright 2026 Oxide Computer Company
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.
.\"  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add the following below this CDDL HEADER, with
.\" the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.Dd "January 18, 2026"
.Dt IXGBE 4
.Os
.Sh NAME
.Nm ixgbe
.Nd Intel 10Gb PCI Express NIC Driver
.Sh SYNOPSIS
.Pa /dev/ixgbe*
.Pa /dev/net/ixgbe*
.Sh DESCRIPTION
The
.Nm
10 Gigabit Ethernet driver is a GLDV3 NIC driver for various Intel PCIe
Controllers including:
.Bl -bullet
.It
Intel 82598EB Ethernet Controller Family
.It
Intel 82599EB (X520) Ethernet Controller Family
.It
Intel X540 Ethernet Controller Family
.It
Intel X550 Ethernet Controller Family
.It
Intel E610 Ethernet Controller Family
.El
.Pp
The
.Nm
driver functions include controller initialization, frame transmit and receive,
multiple transmit and receive groups with receive side scaling
.Pq RSS ,
promiscuous and multicast support, transceiver management, LED control, UFM
management, and error recovery and reporting.
.Pp
The supported speeds vary based on the controller.
The 82598 and 82599 generally interface with optical transceivers.
The X540 supports 1 and 10GBASE-T, while the X550 and the E610 support 1, 2.5,
5, and 10GBASE-T.
The specific supported speeds vary based on the controller.
.Sh APPLICATION PROGRAMMING INTERFACE
The cloning character-special device,
.Pa /dev/ixgbe ,
is used to access all
.Nm
based devices installed within the system.
.Pp
The
.Nm
driver is managed by the
.Xr dladm 8
command line utility, which allows VLANs to be defined on top of
.Nm
instances and for
.Nm
instances to be aggregated.
See
.Xr dladm 8
for more details.
.Pp
You must send an explicit
.Dv DL_ATTACH_REQ
message to associate the opened stream with a particular device
.Pq PPA .
The PPA ID is interpreted as an unsigned integer data type and indicates the
corresponding device instance
.Pq unit
number.
The driver returns an error
.Pq Dv DL_ERROR_ACK
if the PPA field value does not correspond to a valid device instance number
for the system.
The device is initialized on first attach and de-initialized
.Pq stopped
at last detach.
.Pp
The values returned by the driver in the
.Dv DL_INFO_ACK
primitive in response to the
.Dv DL_INFO_REQ
are:
.Bl -bullet -offset indent
.It
Maximum SDU for Intel 82598EB is 16366.
.It
Maximum SDU for Intel 82599EB, X540 and X550 is 15500.
.It
Maximum SDU for Intel E610 is 9710.
.It
Minimum SDU is 0.
.It
DLSAP address length is 8.
.It
MAC type is
.Dv DL_ETHER .
.It
SAP
.Pq Service Access Point
length value is -2, meaning the physical address component is followed
immediately by a 2-byte SAP component within the DLSAP address.
.It
Broadcast address value is the Ethernet/IEEE broadcast address
.Pq FF:FF:FF:FF:FF:FF .
.Pp
Once in the
.Dv DL_ATTACHED
state, you must send a
.Dv DL_BIND_REQ
to associate a particular SAP with the stream.
.El
.Sh CONFIGURATION
By default, the
.Nm
driver performs auto-negotiation to select the link speed and mode.
Link speed and mode can only be 10000 Mbps full-duplex for fiber.
For copper, supported speeds may include 100, 1000, 2500, 5000, and 10000 Mbps
full-duplex.
See the
.Em IEEE802.3
standard for more information.
.Sh FILES
.Bl -tag -width Pa
.It Pa /dev/ixgbe* , Pa /dev/net/ixgbe*
Special character device.
.It Pa /kernel/drv/amd64/ixgbe
Device driver
.Pq x86
.It Pa /kernel/drv/ixgbe.conf
Driver configuration file
.El
.Sh SEE ALSO
.Xr streamio 4I ,
.Xr dlpi 4P ,
.Xr driver.conf 5 ,
.Xr attributes 7 ,
.Xr dladm 8 ,
.Xr netstat 8
.Pp
.Rs
.%T Writing Device Drivers
.%U https://www.illumos.org/books/wdd/
.Re
