illumos/illumos-gate/usr/src/man/man4d/myri10ge.4d
'\" te
.\" Copyright (c) 2007-2009 Myricom, Inc. All Rights Reserved. Use is subject to license terms.
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License"). You may not use this file except in compliance with the License. You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License. When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE. If applicable, add
.\" the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH MYRI10GE 4D "Sep 10, 2009"
.SH NAME
myri10ge \- Myricom Myri10GE 10Gb PCI Express NIC Driver
.SH SYNOPSIS
.LP
.nf
/dev/myri10ge*
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmyri10ge\fR Gigabit Ethernet driver is a multi-threaded, loadable,
clonable, GLD-based STREAMS driver that supports the Data Link Provider
Interface, \fBdlpi\fR(4P), on Myricom Myri10GE 10-Gigabit Ethernet controllers.
.sp
.LP
The \fBmyri10ge\fR driver functions include controller initialization, frame
transmit and receive, promiscuous and multicast support, multiple transmit and
receive queues, support for TCP Large Send Offload, support for TCP Large
Receive Offload, and error recovery and reporting.
.SS "Application Programming Interface"
.sp
.LP
The cloning character-special device, \fB/dev/myri10ge\fR, is used to access
all Myricom Myri10GE 10 -Gigabit Ethernet dev ices installed within the system.
.sp
.LP
The \fBmyri10ge\fR driver is managed by the \fBdladm\fR(8) command line
utility. dladm allows VLANs to be defined on top of \fBmyri10ge\fR instances
and for \fBmyri10ge\fR instances to be aggregated. See \fBdladm\fR(8) for more
details.
.sp
.LP
You must send an explicit \fBDL_ATTACH_REQ\fR message to associate the opened
stream with a particular device (\fBPPA\fR). The \fBPPA\fR ID is interpreted as
an unsigned integer data type and indicates the corresponding device instance
(unit) number. The driver returns an error (\fBDL_ERROR_ACK\fR) if the
\fBPPA\fR field value does not correspond to a valid device instance number for
the system. The device is initialized on first attach and de-initialized
(stopped) at last detach.
.sp
.LP
The values returned by the driver in the \fBDL_INFO_ACK\fR primitive in
response to your \fBDL_INFO_REQ\fR are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum \fBSDU\fR is \fB9000\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum \fBSDU\fR is \fB0\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBDLSAP\fR address length is \fB8\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBMAC\fR type is \fBDL_ETHER\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR (Service Access Point) length value is \fB-2\fR, meaning the physical
address component is followed immediately by a 2-byte \fBSAP\fR component
within the \fBDLSAP\fR address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broad- cast address
(\fBFF:FF:FF:FF:FF:FF\fR).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Once in the \fBDL_ATTACHED\fR state, you must send a \fBDL_BIND_REQ\fR to
associate a particular SAP with the stream.
.RE
.SS "Configuration"
.sp
.LP
Link speed and mode can only be 10000 Mbps full-duplex. See the \fIIEEE 802.3
Standard\fR for more information.
.SH FILES
.sp
.ne 2
.na
\fB\fB/dev/myri10ge*\fR\fR
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/myri10ge\fR\fR
.ad
.sp .6
.RS 4n
32-bit device driver (x86)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/myri10ge\fR\fR
.ad
.sp .6
.RS 4n
64-bit device driver (x86)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/myri10ge\fR\fR
.ad
.sp .6
.RS 4n
64-bit device driver (SPARC)
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/myri10ge.conf\fR\fR
.ad
.sp .6
.RS 4n
Configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC, x86
_
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
.BR streamio (4I),
.BR dlpi (4P),
.BR driver.conf (5),
.BR attributes (7),
.BR dladm (8),
.BR netstat (8)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fINetwork Interface Guide\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fIIEEE 802.3 Standard\fR
