illumos/illumos-gate/usr/src/man/man4d/ntxn.4d
'\" te
.\"  Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NTXN 4D "Oct 13, 2008"
.SH NAME
ntxn \- NetXen 10/1 Gigabit Ethernet network driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/ntxn*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBntxn\fR 10/1 Gigabit Ethernet driver is a multi-threaded, loadable,
clonable, GLD-based STREAMS driver supporting the Data Link Provider Interface,
\fBdlpi\fR(4P), on NetXen 10/1 Gigabit Ethernet controllers.
.sp
.LP
The \fBntxn\fR driver functions include chip initialization, frames transmit
and receive, promiscuous and multicast support, TCP and UDP checksum off-load
(IPv4) and 9600 bytes jumbo frame.
.sp
.LP
The \fBntxn\fR driver and hardware support the 10GBASE CX4, 10GBASE-SR/W, LR/W,
and 10/100/1000BASE-T physical layers.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device, \fB/dev/ntxn\fR, is used to access all
NetXen devices installed within the system.
.sp
.LP
The \fBntxn\fR driver is managed by the \fBdladm\fR(8) command line utility,
which allows VLANs to be defined on top of \fBntxn\fR instances and for
\fBntxn\fR instances to be aggregated. See \fBdladm\fR(8) for more details.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response to
your DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU is 9600.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is DL_ETHER.
.RE
.RS +4
.TP
.ie t \(bu
.el o
SAP (Service Access Point) length value is -2, meaning the physical address
component is followed immediately by a 2-byte SAP component within the DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address
(FF:FF:FF:FF:FF:FF).
.RE
.SH CONFIGURATION
.sp
.LP
By default, the \fBntxn\fR driver works without any configuration file.
.SH FILES
.sp
.ne 2
.na
\fB\fB/dev/ntxn*\fR\fR
.ad
.RS 26n
Special character device.
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/ntxn\fR\fR
.ad
.RS 26n
32-bit device driver (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/ntxn\fR\fR
.ad
.RS 26n
64-bit device driver (x86).
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/ntxn.conf\fR\fR
.ad
.RS 26n
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
l l
l l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
Architecture	x86
Interface Stability	Committed
.TE

.SH SEE ALSO
.sp
.LP
.BR streamio (4I),
.BR dlpi (4P),
.BR driver.conf (5),
.BR attributes (7),
.BR dladm (8),
.BR ndd (8),
.BR netstat (8)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
