illumos/illumos-gate/usr/src/man/man4d/ohci.4d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH OHCI 4D "May 13, 2017"
.SH NAME
ohci \- OpenHCI host controller driver
.SH SYNOPSIS
.LP
.nf
\fBusb@unit-address\fR
.fi

.SH DESCRIPTION
.LP
The \fBohci\fR driver is a USBA (Solaris USB Architecture) compliant nexus
driver that supports the \fIOpen Host Controller Interface Specification
1.1\fR, an industry standard developed by Compaq, Microsoft, and National
Semiconductor.
.sp
.LP
The \fBohci\fR driver supports bulk, interrupt, control and isochronous
transfers.
.SH FILES
.ne 2
.na
\fB\fB/kernel/drv/ohci\fR\fR
.ad
.RS 28n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/amd64/ohci\fR\fR
.ad
.RS 28n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/sparcv9/ohci\fR\fR
.ad
.RS 28n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.na
\fB\fB/kernel/drv/ohci.conf\fR\fR
.ad
.RS 28n
driver configuration file
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	SPARC, x86, PCI-based systems
.TE

.SH SEE ALSO
.LP
.BR ehci (4D),
.BR hubd (4D),
.BR uhci (4D),
.BR usba (4D),
.BR attributes (7)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIUniversal Serial Bus Specification 2.0\fR
.sp
.LP
\fIOpen Host Controller Interface Specification for USB 1.0a\fR
.sp
.LP
\fISystem Administration Guide: Basic Administration\fR
.SH DIAGNOSTICS
.LP
All host controller errors are passed to the client drivers. Root hub errors
are documented in \fBhubd\fR(4D).
.sp
.LP
In addition to being logged, the following messages may appear on the system
console. All messages are formatted in the following manner:
.sp
.in +2
.nf
WARNING: <device path> <ohci><instance number>>: Error message...
.fi
.in -2
.sp

.sp
.ne 2
.na
\fBUnrecoverable USB Hardware Error.\fR
.ad
.sp .6
.RS 4n
There was an unrecoverable USB hardware error reported by the OHCI Controller.
Please reboot the system. If this problem persists, contact your system vendor.
.RE

.sp
.ne 2
.na
\fBNo SOF interrupts have been received. This OHCI USB controller is
unusable.\fR
.ad
.sp .6
.RS 4n
The USB hardware is not generating Start Of Frame interrupts. Please reboot the
system. If this problem persists, contact your system vendor.
.RE

.sp
.LP
The following messages may be entered into the system log. They are formatted
in the following manner:
.sp
.in +2
.nf
<device path> <ohci<instance number>): Message...
.fi
.in -2
.sp

.sp
.ne 2
.na
\fBFailed to program frame interval register.\fR
.ad
.sp .6
.RS 4n
For an unspecified reason, the frame interval register has been nulled out by
the Uli M1575 chip. Please reboot the system. If this problem persists, contact
your system vendor.
.RE

