illumos/illumos-gate/usr/src/man/man4d/oplkmdrv.4d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH OPLKMDRV 4D "Apr 18, 2006"
.SH NAME
oplkmdrv \- key management driver for the SPARC Enterprise Server family
.SH SYNOPSIS
.LP
.nf
\fBkmdrv\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBoplkmdrv\fR is a character driver that implements a framework for exchanging
the security keys with the Service Processor on a SPARC Enterprise Server. The
\fBoplkmdrv\fR driver is specific to the SPARC Enterprise Server family.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Private
.TE

.sp
.LP
.BR attributes (7)
.SH SEE ALSO
.sp
.LP
.BR attributes (7)
