illumos/illumos-gate/usr/src/man/man4d/vioscsi.4d
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\"
.\" Copyright 2022 RackTop Systems, Inc.
.\"
.Dd June 17, 2022
.Dt VIOSCSI 4D
.Os
.Sh NAME
.Nm vioscsi
.Nd virtio SCSI driver
.Sh DESCRIPTION
The
.Nm
driver provides a virtual SCSI transport, allowing
access to
.Xr virtio 4D
based SCSI targets and logical units.
The driver supports the following capabilities:
.Bl -dash
.It
Dynamic hot-plug (if supported by the host)
.It
Honors packet timeouts specified in
.Xr scsi_pkt 9S
.It
Reset of target or logical unit via
.Xr scsi_reset 9F
.It
Abort for individual commands via
.Xr scsi_abort 9F
.It
Command queueing (both tagged and untagged)
.It
Honors per logical unit queue depth from device
.It
Up to 255 targets, and 16384 logical units per PCI function
.El
.Pp
The
.Nm
driver is based on
.Xr iport 9 ,
and uses a single iport per PCI function,
with a unit-address of "iport0".
Children of the iport use a unit-address with the
format "target,lun", where both target and lun are
presented as hexadecimal values.
.Sh NOTES
The
.Nm
driver may be slightly less efficient than
.Xr vioblk 4D ,
but it may support use as boot media, as well
as attachments to SCSI pass-through devices, which
may include devices such as tape drives via
.Xr st 4D
and enclosures via
.Xr ses 4D .
.Sh ARCHITECTURE
The
.Nm
driver is only supported on
.Sy x86 .
.Sh FILES
.Bl -tag -width Pa
.It Pa /kernel/drv/amd64/vioscsi
x86 device driver.
.El
.Sh SEE ALSO
.Xr sd 4D ,
.Xr ses 4D ,
.Xr st 4D ,
.Xr vioblk 4D ,
.Xr virtio 4D ,
.Xr iport 9 ,
.Xr scsi_abort 9F ,
.Xr scsi_reset 9F ,
.Xr scsi_pkt 9S
.Rs
.%T Virtual I/O Device (VIRTIO) Version 1.1
.%D April, 2019
.%U https://docs.oasis-open.org/virtio/virtio/v1.1/virtio-v1.1.html
.Re
