illumos/illumos-gate/usr/src/man/man9s/usb_cfg_descr.9s
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH usb_cfg_descr 9S "5 Jan 2004" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
usb_cfg_descr \- USB configuration descriptor
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h> 
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBusb_cfg_descr_t\fR configuration descriptor defines attributes of a
configuration. A configuration contains one or more interfaces. A configuration
descriptor acts as a header for the group of other descriptors describing the
subcomponents (for example, interfaces and endpoints) of a configuration.
Please refer to Section \fI9.6.3\fR of the \fIUSB 2.0\fR specification. The
\fIUSB 2.0\fR specification is available at \fIwww.usb.org\fR.
.sp
.LP
One or more configuration descriptors are retrieved from a USB device during
device enumeration. They can be accessed via \fBusb_get_dev_data\fR(9F).
.sp
.LP
A configuration descriptor has the following fields:
.sp
.in +2
.nf
uint8_t         bLength                 Size of this descriptor
                                        in bytes.

uint8_t         bDescriptorType         Set to USB_DESCR_TYPE_CFG.

uint16_t        wTotalLength            Total length of data returned
                                        including this and all other
                                        descriptors in this configuration.

uint8_t         bNumInterfaces          Number of interfaces in this
                                        configuration.

uint8_t         bConfigurationValue     ID of this configuration
                                        (1-based).

uint8_t         iConfiguration          Index of optional configuration
                                        string. Valid if > 0.

uint8_t         bmAttributes            Configuration characteristics
                                        (See below).

uint8_t         bMaxPower               Maximum power consumption, in
                                        2mA units.

Configuration descriptors define the following bmAttributes:
     USB_CFG_ATTR_SELFPWR       -      Set if config not using bus power.
     USB_CFG_ATTR_REMOTE_WAKEUP -      Set if config supports rem wakeup.
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBusb_get_alt_if\fR(9F), \fBusb_get_cfg\fR(9F),
\fBusb_get_dev_data\fR(9F), \fBusb_get_string_descr\fR(9F),
\fBusb_parse_data\fR(9F), \fBusb_ctrl_request\fR(9S), \fBusb_dev_descr\fR(9S),
\fBusb_dev_qlf_descr\fR(9S), \fBusb_ep_descr\fR(9S), \fBusb_if_descr\fR(9S),
\fBusb_other_speed_cfg_descr\fR(9S), \fBusb_string_descr\fR(9S)
