illumos/illumos-gate/usr/src/man/man9s/usb_dev_qlf_descr.9s
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH USB_DEV_QLF_DESCR 9S "Jan 5, 2004"
.SH NAME
usb_dev_qlf_descr \- USB device qualifier descriptor
.SH SYNOPSIS
.nf
#include <sys/usb/usba.h>
.fi

.SH INTERFACE LEVEL
illumos DDI specific (illumos DDI)
.SH DESCRIPTION
The device qualifier descriptor \fBusb_dev_qlf_descr_t\fR defines how fields of
a high speed device's device descriptor would look if that device is run at a
different speed.  If a high-speed device is running currently at full/high
speed, fields of this descriptor reflect how device descriptor fields would
look if speed was changed to high/full. Please refer to section \fI9.6.2\fR of
the \fIUSB 2.0\fR specification. The \fIUSB 2.0\fR specification is available
at \fIwww.usb.org\fR.
.sp
.LP
A device descriptor contains the following fields:
.sp
.in +2
.nf
uint8_t     bLength             Size of this descriptor.

uint8_t     bDescriptorType     Set to USB_DESCR_TYPE_DEV_QLF.

uint16_t    bcdUSB              USB specification release
                                number in binary coded decimal.

uint8_t     bDeviceClass        Device class code.
                                (See \fBusb_dev_descr(9s)\fR.)

uint8_t     bDeviceSubClass     Device subclass code.(See
                                USB 2.0 specification of
                                applicable device class for
                                information.)

uint8_t     bDeviceProtocol     Protocol code.(See
                                USB 2.0 specification of
                                applicable device class for
                                information.)

uint8_t     bMaxPacketSize0     Maximum packet size of
                                endpoint 0.

uint8_t     bNumConfigurations  Number of available
                                configurations.

uint8_t     bReserved           Reserved.
.fi
.in -2

.SH ATTRIBUTES
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Architecture	PCI-based systems
_
Interface stability	Committed
.TE

.SH SEE ALSO
.BR attributes (7),
.BR usb_get_alt_if (9F),
.BR usb_get_cfg (9F),
.BR usb_get_dev_data (9F),
.BR usb_get_string_descr (9F),
.BR usb_parse_data (9F),
.BR usb_cfg_descr (9S),
.BR usb_ctrl_request (9S),
.BR usb_dev_descr (9S),
.BR usb_ep_descr (9S),
.BR usb_if_descr (9S),
.BR usb_other_speed_cfg_descr (9S),
.BR usb_string_descr (9S)
