illumos/illumos-gate/usr/src/man/man4/alias.4
'\" te
.\"  Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ALIAS 4 "Oct 2, 2001"
.SH NAME
alias \- alias table file of encoding names
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/iconv/alias\fR
.fi

.SH DESCRIPTION
.sp
.LP
This file contains the alias table of encoding names for \fBiconv_open\fR(3C).
.sp
.LP
The format of the alias table is as follows:
.sp
.in +2
.nf
"%s %s\en", <variant encoding name>, <canonical encoding name>
.fi
.in -2

.sp
.LP
The string specified for the variant encoding name is case-insensitive. A line
beginning with '#' is treated as a comment.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
\fBiconv\fR(3C), \fBiconv_close\fR(3C), \fBiconv_open\fR(3C),
\fBattributes\fR(5)
