illumos/illumos-gate/usr/src/man/man4/dacf.conf.4
'\" te
.\"  Copyright (c) 2001 Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DACF.CONF 4 "May 15, 2001"
.SH NAME
dacf.conf \- device auto-configuration configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/dacf.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The kernel uses the \fBdacf.conf\fR file to automatically configure hot plugged
devices. Because the \fBdacf.conf\fR file contains important kernel state
information, it should not be modified.
.sp
.LP
The format of the \fB/etc/dacf.conf\fR file is not public and might change in
versions of the Solaris operating environment that are not compatible with
Solaris 8.
.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5)
.SH NOTES
.sp
.LP
 This document does not constitute an \fBAPI\fR. The \fB/etc/dacf.conf\fR file
might not exist or might contain different contents or interpretations in
versions of the Solaris operating environment that are not compatible with
Solaris 8. The existence of this notice does not imply that any other
documentation lacking this notice constitutes an \fBAPI\fR.
