illumos/illumos-gate/usr/src/man/man4/dfstab.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH DFSTAB 4 "Aug 15, 2008"
.SH NAME
dfstab \- file containing commands for sharing resources across a network
.SH DESCRIPTION
.sp
.LP
\fBdfstab\fR resides in directory \fB/etc/dfs\fR and contains commands for
sharing resources across a network. \fBdfstab\fR gives a system administrator a
uniform method of controlling the automatic sharing of local resources.
.sp
.LP
Each line of the \fBdfstab\fR file consists of a \fBshare\fR(1M) command. The
\fBdfstab\fR file can be read by the shell to share all resources. System
administrators can also prepare their own shell scripts to execute particular
lines from \fBdfstab\fR.
.sp
.LP
The contents of \fBdfstab\fR put into effect when the command shown below is
run. See \fBsvcadm\fR(1M).
.sp
.in +2
.nf
/usr/sbin/svcadm enable network/nfs/server
.fi
.in -2

.SH SEE ALSO
.sp
.LP
\fBshare\fR(1M), \fBshareall\fR(1M), \fBsharemgr\fR(1M), \fBsvcadm\fR(1M)
.SH NOTES
.sp
.LP
Do not modify this file directly. This file is reconstructed and only
maintained for backwards compatibility. Configuration lines could be lost.
.sp
.LP
Use the \fBsharemgr\fR(1M) command for all share management.
