illumos/illumos-gate/usr/src/man/man4/ftphosts.4
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH FTPHOSTS 4 "May 1, 2003"
.SH NAME
ftphosts \- FTP Server individual user host access file
.SH SYNOPSIS
.LP
.nf
\fB/etc/ftpd/ftphosts\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBftphosts\fR file is used to allow or deny access to accounts from
specified hosts. The following access capabilities are supported:
.sp
.ne 2
.na
\fB\fBallow \fIusername\fR \fIaddrglob\fR [\fIaddrglob\fR...]\fR\fR
.ad
.sp .6
.RS 4n
Only allow users to login as \fIusername\fR from host(s) that match
\fIaddrglob\fR.
.RE

.sp
.ne 2
.na
\fB\fBdeny \fIusername\fR \fIaddrglob\fR [\fIaddrglob\fR...]\fR\fR
.ad
.sp .6
.RS 4n
Do not allow users to login as \fIusername\fR from host(s) that match
\fIaddrglob\fR.
.RE

.sp
.LP
A \fIusername\fR of \fB*\fR matches all users. A \fIusername\fR of
\fBanonymous\fR or \fBftp\fR specifies the anonymous user.
.sp
.LP
\fIaddrglob\fR is a regular expression that is matched against hostnames or IP
addresses. \fIaddrglob\fR may also be in the form \fBaddress:netmask\fR or
\fBaddress/CIDR\fR, or be the name of a file that starts with a slash
('\fB/\fR') and contains additional address globs. An exclamation mark
(`\fB!\fR') placed before the \fBaddrglob\fR negates the test.
.sp
.LP
The first \fBallow\fR or \fBdeny\fR entry in the \fBftphosts\fR file that
matches a \fIusername\fR and host is used. If no entry exists for a
\fIusername\fR, then access is allowed. Otherwise, a matching allow entry is
required to permit access.
.SH EXAMPLES
.sp
.LP
You can use the following \fBftphosts\fR file to allow anonymous access from
any host except those on the class A network 10, with the exception of
\fB10.0.0.*\fR IP addresses, which are allowed access:
.sp
.in +2
.nf
allow   ftp   10.0.0.*
deny    ftp   10.*.*.*
allow   ftp   *
.fi
.in -2

.sp
.LP
\fB10.0.0.*\fR can be written as \fB10.0.0.0:255.255.255.0\fR or
\fB10.0.0.0/24\fR.
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/ftpd/ftphosts\fR\fR
.ad
.RS 22n

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	External
.TE

.SH SEE ALSO
.sp
.LP
 \fBin.ftpd\fR(1M), \fBftpaccess\fR(4), \fBattributes\fR(5)
