illumos/illumos-gate/usr/src/man/man4/ftpservers.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ftpservers 4 "1 May 2003" "SunOS 5.11" "File Formats"
.SH NAME
ftpservers \- FTP Server virtual hosting configuration file
.SH SYNOPSIS
.LP
.nf
/etc/ftpd/ftpservers
.fi

.SH DESCRIPTION
.sp
.LP
The \fBftpservers\fR file is used to configure complete virtual hosting. In
contrast to limited virtual hosting, complete virtual hosting allows separate
configuration files to be specified for each virtual host.
.sp
.LP
The set of configuration files for each virtual host are placed in their own
directory. The \fBftpservers\fR file associates the address of each virtual
host with the directory its configuration files are stored in. The virtual host
configuration files must be named:
.sp
.ne 2
.mk
.na
\fB\fBftpaccess\fR\fR
.ad
.RS 18n
.rt  
Virtual host's access file
.RE

.sp
.ne 2
.mk
.na
\fB\fBftpusers\fR\fR
.ad
.RS 18n
.rt  
Restricts the accounts that can use the virtual host
.RE

.sp
.ne 2
.mk
.na
\fB\fBftpgroups\fR\fR
.ad
.RS 18n
.rt  
Virtual hosts enhanced group access file
.RE

.sp
.ne 2
.mk
.na
\fB\fBftphosts\fR\fR
.ad
.RS 18n
.rt  
Allow or deny usernames access to the virtual host
.RE

.sp
.ne 2
.mk
.na
\fB\fBftpconversions\fR\fR
.ad
.RS 18n
.rt  
Customize conversions available from the virtual host
.RE

.sp
.LP
You do not need to put every file in each virtual host directory. If you want a
virtual host to use the master copy of a file, then do not include it in the
virtual host directory. If the file is not included, the master copy from the
\fB/etc/ftpd\fR directory will be used.
.sp
.LP
The file names must match exactly. If you misspell any of  them or name them
differently, the server will not find them, and the server will use the master
copy instead.
.sp
.LP
The \fBftpaddhost\fR utility is an administrative tool to configure virtual
hosts. See \fBftpaddhost\fR(1M).
.SS "File Format"
.sp
.LP
There are two fields to each entry in the \fBftpservers\fR file:
.sp
.in +2
.nf
address   directory-containing-configuration-files
.fi
.in -2

.sp
.LP
For example:
.sp
.in +2
.nf
10.196.145.10    /etc/ftpd/virtual-ftpd/10.196.145.10 
10.196.145.200   /etc/ftpd//virtual-ftpd/10.196.145.200
some.domain      INTERNAL
.fi
.in -2

.sp
.LP
When an FTP client connects to the FTP Server, \fBin.ftpd\fR(1M) tries to match
the IP address to which the FTP client connected with one found in the
\fBftpservers\fR file.
.sp
.LP
The \fBaddress\fR can be an IPv4 or IPv6 address, or a hostname.
.sp
.LP
If a match is found, The FTP server uses any configuration files found in the
associated directory.
.sp
.LP
If a match is not found,  or an invalid directory path is encountered,  the
default paths to the configuration files are used. The use of \fBINTERNAL\fR in
the example above fails the check for a specific directory, and the master
configuration files will be used.
.sp
.LP
Either the actual IP address or a specific hostname can be used to specify the
virtual host. It is better to specify the actual IP of the virtual host, as it
reduces the need for a domain lookup and eliminates DNS security related naming
issues, for example:
.sp
.in +2
.nf
10.196.145.20     /etc/ftpd/config/faqs.org/
ftp.some.domain   /etc/ftpd/config/faqs.org/
.fi
.in -2

.sp
.LP
Lines that begin with a \fB#\fR sign are treated as comment lines and are
ignored.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/ftpd/ftpservers\fR
.ad
.RS 24n
.rt  
 
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
\fBftpaddhost\fR(1M), \fBin.ftpd\fR(1M), \fBftpaccess\fR(4),
\fBftpconversions\fR(4), \fBftpgroups\fR(4), \fBftphosts\fR(4),
\fBftpusers\fR(4), \fBattributes\fR(5)
