illumos/illumos-gate/usr/src/man/man4/ipaddrsel.conf.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH ipaddrsel.conf 4 "6 Mar 2003" "SunOS 5.11" "File Formats"
.SH NAME
ipaddrsel.conf \- IPv6 default address selection policy
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/ipaddrsel.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBipaddrsel.conf\fR file contains the IPv6 default address selection
policy table used for IPv6 source address selection and the sorting of
\fBAF_INET6\fR addresses returned from name to address resolution. The
mechanism for loading the file, the file format, and the meaning of the
contents are described in \fBipaddrsel\fR(1M).
.SH EXAMPLES
.LP
\fBExample 1 \fRDefault \fB/etc/inet/ipaddrsel.conf\fR File
.sp
.LP
The following is the default \fB/etc/inet/ipaddrsel.conf\fR file:

.sp
.in +2
.nf
#
#ident	"@(#)ipv6das.conf	1.1	02/07/28 SMI"
#
# Copyright 2002 Sun Microsystems, Inc.  All rights reserved.
# Use is subject to license terms.
#
# Prefix                  Precedence Label
::1/128                           50     0
::/0                              40     1
2002::/16                         30     2
::/96                             20     3
::ffff:0.0.0.0/96                 10     4
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBipaddrsel\fR(1M), \fBattributes\fR(5)
