illumos/illumos-gate/usr/src/man/man4/meddb.4
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH MEDDB 4 "Sep 20, 2000"
.SH NAME
meddb \- mediator data file
.SH SYNOPSIS
.LP
.nf
\fB/etc/lvm/meddb\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file \fB/etc/lvm/meddb\fR is a data file used by \fBrpc.metamedd\fR(1M) to
store the mediator data used in 2-string HA configurations.
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/lvm/meddb\fR \fR
.ad
.RS 19n

.RE

.SH SEE ALSO
.sp
.LP
\fBrpc.metamedd\fR(1M)
.sp
.LP
\fISun Cluster 3.0 Collection\fR
.sp
.LP
\fISolaris Volume Manager Administration Guide\fR
