illumos/illumos-gate/usr/src/man/man4/note.4
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH note 4 "17 Jan 1995" "SunOS 5.11" "File Formats"
.SH NAME
note \- specify legal annotations
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/note\fR
.fi

.SH DESCRIPTION
.sp
.LP
Each file in this directory contains the \fBNOTE\fR (also \fB_NOTE\fR)
annotations legal for a single tool.  The name of the file, by convention,
should be the tool vendor's stock name, followed by a hyphen, followed by the
tool name. For example, for Sun's \fBlock_lint\fR tool the filename should be
\fBSUNW-lock_lint\fR.
.sp
.LP
The file should contain the names of the annotations understood by the tool,
one per line.  For example, if a tool understands the following annotations:
.sp
.in +2
.nf
NOTE(NOT_REACHED)
NOTE(MUTEX_PROTECTS_DATA(list_lock, list_head))
.fi
.in -2
.sp

.sp
.LP
then its file in \fB/usr/lib/note\fR should contain the entries:
.sp
.in +2
.nf
\fBNOT_REACHED
MUTEX_PROTECTS_DATA\fR
.fi
.in -2
.sp

.sp
.LP
Blank lines, and lines beginning with a pound (#), are ignored.
.sp
.LP
While \fB/usr/lib/note\fR is the default directory tools search for such files,
they can be made to search other directories instead simply by setting
environment variable \fBNOTE\fR\fBPATH\fR to contain the paths, separated by
colons, of directories to be searched, e.g.,
\fB/usr/mytool/note:/usr/lib/note\fR.
.SH USAGE
.sp
.LP
These files are used by such tools whenever they encounter \fBNOTE\fRs they do
not understand.  If a file in \fB/usr/lib/note\fR contains the annotation, then
it is valid. If no such file contains the annotation, then the tool should
issue a warning complaining that it might be invalid.
.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
\fB\fBNOTE\fR\fBPATH\fR\fR
.ad
.RS 12n
.rt  
specify paths to be searched for annotation files. Paths are separated by
colons (":").
.RE

.SH SEE ALSO
.sp
.LP
\fBNOTE\fR(3EXT)
