illumos/illumos-gate/usr/src/man/man4/nss.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.
.\" All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH NSS 4 "Nov 20, 2003"
.SH NAME
nss \- configuration file for initgroups
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/nss\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/default/nss\fR configuration file provides methods for
\fBinitgroups\fR(3C) lookup method. The file also provides a method to disable
address sorting by name lookup functions. The file controls the behavior of the
name service switch routines outside of the source database mappings provided
by the \fB/etc/nsswitch.conf\fR file.
.sp
.LP
\fB/etc/default/nss\fR supports the following options:
.sp
.ne 2
.na
\fB\fBNETID_AUTHORITATIVE\fR\fR
.ad
.RS 23n
Changes the behavior of the name service lookups to use the \fBnetid\fR table
in response to the \fBinitgroups()\fR call. The \fBnetid\fR table is provided
by the \fBLOCAL\fR entries of the NIS+ \fBcred.org_dir\fR table. By default,
\fBinitgroups()\fR uses the \fBgroup\fR table. When \fBNETID_AUTHORITATIVE\fR
is set to TRUE, \fBinitgroups()\fR uses \fBnetid\fR as the source for
supplementary groups rather than the \fBgroup\fR table.
.sp
The name service administrator must ensure that the \fBnetid\fR table contains
valid supplementary group information for users. Not all name services can
automatically keep the members listed in the \fBgroup\fR table in sync with the
\fBnetid\fR table.
.RE

.sp
.ne 2
.na
\fB\fBSORT_ADDRS\fR\fR
.ad
.RS 23n
If this option is set to FALSE, the sorting of addresses is disabled on
addresses that are returned by name lookup functions such as
\fBinitgroups()\fR, \fBgethostbyname\fR(3NSL), \fBnetdir_getbyname\fR(3NSL),
\fBgetaddrinfo\fR(3SOCKET), and \fBgetipnodebyname\fR(3SOCKET). Setting this
option to FALSE is useful when the order of addresses returned by the
nameserver needs to be maintained. To use the DNS round robin feature, for
example, address sorting by name lookup functions should be disabled.
.sp
By default, address sorting is enabled.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Evolving
.TE

.SH SEE ALSO
.sp
.LP
\fBgetaddrinfo\fR(3SOCKET), \fBgethostbyname\fR(3NSL),
\fBgetipnodebyname\fR(3SOCKET), \fBinitgroups\fR(3C),
\fBnetdir_getbyname\fR(3NSL), \fBnsswitch.conf\fR(4), \fBattributes\fR(5)
