illumos/illumos-gate/usr/src/man/man4/path_to_inst.4
'\" te
.\"  Copyright 1992 Sun Microsystems Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH PATH_TO_INST 4 "May 18, 2007"
.SH NAME
path_to_inst \- device instance number file
.SH SYNOPSIS
.LP
.nf
\fB/etc/path_to_inst\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fB/etc/path_to_inst\fR records mappings of physical device names to instance
numbers.
.sp
.LP
The instance number of a device is encoded in its minor number, and is the way
that a device driver determines which of the possible devices that it may drive
is referred to by a given special file.
.sp
.LP
In order to keep instance numbers persistent across reboots, the system records
them in \fB/etc/path_to_inst\fR.
.sp
.LP
This file is read only at boot time, and is updated by \fBadd_drv\fR(1M) and
\fBdevfsadm\fR(1M).
.sp
.LP
Note that it is generally not necessary for the system administrator to change
this file, as the system will maintain it.
.sp
.LP
The system administrator can change the assignment of instance numbers by
editing this file and doing a reconfiguration reboot. However, any changes made
in this file will be lost if \fBadd_drv\fR(1M) or \fBdevfsadm\fR(1M) is run
before the system is rebooted.
.sp
.LP
Each instance entry is a single line of the form:
.sp
.in +2
.nf
\fB"\fR\fIphysical name\fR\fB"\fR \fIinstance\fR \fInumber\fR \fB"\fR\fIdriver binding name\fR\fB"\fR
.fi
.in -2

.sp
.LP
where
.sp
.ne 2
.na
\fB\fIphysical\fR \fIname\fR\fR
.ad
.RS 23n
is the absolute physical pathname of a device. This pathname must be enclosed
in double quotes.
.RE

.sp
.ne 2
.na
\fB\fIinstance number\fR\fR
.ad
.RS 23n
is a decimal or hexadecimal number.
.RE

.sp
.ne 2
.na
\fB\fIdriver binding name\fR\fR
.ad
.RS 23n
is the name used to determine the driver for the device. This name may be a
driver alias or a driver name. The driver binding name must be enclosed in
double quotes.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSample \fBpath_to_inst\fR Entries
.sp
.LP
Here are some sample \fBpath_to_inst\fR entries:

.sp
.in +2
.nf
"/iommu@f,e0000000" 0 "iommu"
"/iommu@f,e0000000/sbus@f,e0001000" 0 "sbus"
"/iommu@f,e0000000/sbus@f,e0001000/sbusmem@e,0" 14 "sbusmem"
"/iommu@f,e0000000/sbus@f,e0001000/sbusmem@f,0" 15 "sbusmem"
"/iommu@f,e0000000/sbus@f,e0001000/ledma@f,400010" 0 "ledma"
"/obio/serial@0,100000" 0 "zs"
"/SUNW,sx@f,80000000" 0 "SUNW,sx"
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/path_to_inst\fR\fR
.ad
.RS 21n
Mapping of physical device names to instance numbers.
.RE

.SH SEE ALSO
.sp
.LP
\fBadd_drv\fR(1M), \fBboot\fR(1M), \fBdevfsadm\fR(1M), \fBmknod\fR(1M)
.SH WARNINGS
.sp
.LP
If the file is removed the system may not be bootable (as it may rely on
information found in this file to find the root, usr or swap device). If it
does successfully boot, it will regenerate the file, but after rebooting
devices may end up having different minor numbers than they did before, and
special files created via \fBmknod\fR(1M) may refer to different devices than
expected.
.sp
.LP
For the same reasons, changes should not be made to this file without careful
consideration.
.SH NOTES
.sp
.LP
This document does not constitute an API. \fBpath_to_inst\fR may not exist or
may have a different content or interpretation in a future release. The
existence of this notice does not imply that any other documentation that lacks
this notice constitutes an API.
