illumos/illumos-gate/usr/src/man/man4/phones.4
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH PHONES 4 "Jan 14, 1992"
.SH NAME
phones \- remote host phone number database
.SH SYNOPSIS
.LP
.nf
\fB/etc/phones\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file \fB/etc/phones\fR contains the system-wide private phone numbers for
the \fBtip\fR(1) program. \fB/etc/phones\fR is normally unreadable, and so may
contain privileged information.  The format of \fB/etc/phones\fR is a series of
lines of the form:
.sp
.in +2
.nf
\fB<\fR\fIsystem-name\fR\fB>[ \et]*<\fR\fIphone-number\fR\fB>.\fR
.fi
.in -2

.sp
.LP
The system name is one of those defined in the \fBremote\fR(4) file and the
phone number is constructed from \fB[0123456789\(mi=*%]\fR. The `\fB=\fR' and
`\fB*\fR' characters are indicators to the auto call units to pause and wait
for a second dial tone (when going through an exchange).  The `\fB=\fR' is
required by the \fBDF02-AC\fR and the `\fB*\fR' is required by the
\fBBIZCOMP\fR 1030.
.sp
.LP
Comment lines are lines containing a `\fB#\fR' sign in the first column of the
line.
.sp
.LP
Only one phone number per line is permitted. However, if more than one line in
the file contains the same system name \fBtip\fR(1) will attempt to dial each
one in turn, until it establishes a connection.
.SH FILES
.sp
.ne 2
.na
\fB\fB/etc/phones\fR\fR
.ad
.RS 15n

.RE

.SH SEE ALSO
.sp
.LP
\fBtip\fR(1), \fBremote\fR(4)
