illumos/illumos-gate/usr/src/man/man4/rdc.cf.4
'\" te
.\" Copyright (C) 2007 Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH rdc.cf 4 "08 Jun 2007" "SunOS 5.11" "File Formats"
.SH NAME
rdc.cf \- Availability Suite Remote  Mirror  software  configuration file
.SH DESCRIPTION
.sp
.LP
The \fBrdc.cf\fR is an optional configuration file that supplies the
\fBsndradm\fR(1M) command with details of the volume sets to be operated on.
Inrdc.cf, the volume sets and  their host locations are defined in the
following format:
.sp
.in +2
.nf
post pdevice pbitmap shost sdevice sbitmap protocol mode options
.fi
.in -2

.sp
.LP
The \fBrdc.cf\fR fields are:
.sp
.ne 2
.mk
.na
\fBphost (primary host)\fR
.ad
.sp .6
.RS 4n
Server on which the primary volume resides.
.RE

.sp
.ne 2
.mk
.na
\fBpdevice (primary device)\fR
.ad
.sp .6
.RS 4n
Primary volume partition to be copied. Specify only full path names (for
example, /dev/rdsk/c0t1d0s2).
.RE

.sp
.ne 2
.mk
.na
\fBpbitmap (primary bitmap)\fR
.ad
.sp .6
.RS 4n
Volume partition in which the bitmap  (scoreboard  logs) of  the primary
partition is stored. Specify only full path names (for example,
/dev/rdsk/c0t1d0s3).
.RE

.sp
.ne 2
.mk
.na
\fBshost (secondary host)\fR
.ad
.sp .6
.RS 4n
Server on which the secondary volume resides.
.RE

.sp
.ne 2
.mk
.na
\fBsdevice (secondary device)\fR
.ad
.sp .6
.RS 4n
Secondary volume partition. Specify only full path names (for
example,\fB/dev/rdsk/c0t1d0s4\fR).
.RE

.sp
.ne 2
.mk
.na
\fBsbitmap (secondary bitmap)\fR
.ad
.sp .6
.RS 4n
Volume partition in which the bitmap  (scoreboard  logs) of  the secondary file
is stored. Specify only full path names (for example,
\fB/dev/rdsk/c0t1d0s5\fR).
.RE

.sp
.ne 2
.mk
.na
\fBprotocol\fR
.ad
.sp .6
.RS 4n
Network transfer protocol. Specify IP.
.RE

.sp
.ne 2
.mk
.na
\fBmode\fR
.ad
.sp .6
.RS 4n
Remote Mirror operating mode. Sync is the Remote Mirror mode where  the  I/O
operation is not confirmed as complete until the remote volume has been
updated. Async is the  other Remote Mirror mode, in which the primary host I/O
operation is confirmed as complete  before  updating the remote volume.
.RE

.sp
.ne 2
.mk
.na
\fBoptions\fR
.ad
.sp .6
.RS 4n
A consistency group name can be specified using the  g character. A disk queue
volume partition can be specified using the q character, using full  path  name
only (/dev/rdsk/c0t1d0s5). Without the q character set will default  to  memory
base  queue.  When  running on a clustered system, a cluster resource group tag
can be specified using the C character.
.sp
These options have the following syntax:
.sp
.in +2
.nf
[g io_groupname] [q queue_volume][C ctag]
.fi
.in -2

.LP
Note -
.sp
.RS 2
When running on a cluster configuration, the cluster resource group tag is
appended to the Remote Mirror set by default.
.RE
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBsndradm\fR(1M), \fBsndrd\fR(1M), \fBattributes\fR(5)
