illumos/illumos-gate/usr/src/man/man4/services.4
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1983 Regents of the University of California.  All rights reserved.  The Berkeley software License Agreement  specifies the terms and conditions for redistribution.
.\" Copyright (C) 2000, Sun Microsystems, Inc. All Rights Reserved
.TH SERVICES 4 "Feb 25, 2017"
.SH NAME
services \- Internet services and aliases
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/services\fR
.fi

.LP
.nf
\fB/etc/services\fR
.fi

.SH DESCRIPTION
.LP
The \fBservices\fR file  is a local source of information regarding each
service available through the Internet. The \fBservices\fR file can be used in
conjunction with or instead of other services sources, including the \fBNIS\fR
map "services.byname".  Programs use the
\fBgetservbyname\fR(3SOCKET) routines to access this information.
.sp
.LP
The \fBservices\fR file contains an entry for each service. Each entry has the
form:
.sp
.in +2
.nf
\fIservice-name   port\fR/\fIprotocol   aliases\fR
.fi
.in -2

.sp
.ne 2
.na
\fB\fIservice-name\fR\fR
.ad
.RS 17n
This is the official Internet service name.
.RE

.sp
.ne 2
.na
\fB\fIport\fR/\fIprotocol\fR\fR
.ad
.RS 17n
This field is composed of the port number and protocol through which the
service is provided, for instance, \fB512/tcp\fR.
.RE

.sp
.ne 2
.na
\fB\fIaliases\fR\fR
.ad
.RS 17n
This is a list of alternate names by which the service might be requested.
.RE

.sp
.LP
Fields can be separated by any number of \fBSPACE\fR and/or \fBTAB\fR
characters. A number sign (\fB#\fR) indicates the beginning of a comment; any
characters that follow the comment character up to the end of the line are not
interpreted by routines which search the file.
.sp
.LP
Service names may contain any printable character other than a field delimiter,
a \fBNEWLINE\fR, or a comment character.
.sp
.LP
Any changes to a port assignment do not affect the actual port registration of
the service.
.SH FILES
.ne 2
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 22n
configuration file for name-service switch
.RE

.SH SEE ALSO
.LP
\fBgetservbyname\fR(3SOCKET), \fBinetd.conf\fR(4), \fBnsswitch.conf\fR(4)
.SH NOTES
.LP
\fB/etc/inet/services\fR is the official SVR4 name of the \fBservices\fR file.
The symbolic link \fB/etc/services\fR exists for \fBBSD\fR compatibility.
