illumos/illumos-gate/usr/src/man/man4/slpd.reg.4
'\" te
.\" Copyright (C) 2000, Sun Microsystems, Inc. All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SLPD.REG 4 "Nov 17, 1999"
.SH NAME
slpd.reg \- serialized registration file for the service location protocol
daemon (slpd)
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/slpd.reg\fR
.fi

.SH DESCRIPTION
.LP
The serialized registration file contains a group of registrations that
\fBslpd\fR(1M) registers when it starts. These registrations are primarily for
older service programs that do not internally support \fBSLP\fR and cannot be
converted. The character format of the registration file is required to be
\fBASCII\fR. To use serialized registrations, set the
\fBnet.slp.serializedRegURL\fR property  in \fBslp.conf\fR(4) to point at a
valid \fBslpd.reg\fR file. The syntax of the serialized registration file, in
\fBABNF\fR format (see \fIRFC 2234\fR), is as follows:
.sp
.in +2
.nf
ser-file      =  reg-list
reg-list      =  reg / reg reg-list
reg           =  creg / ser-reg
creg          =  comment-line ser-reg
comment-line  =  ( "#" / ";" ) 1*allchar newline
ser-reg       =  url-props [slist] [attr-list] newline
url-props     =  surl "," lang "," ltime [ "," type ] newline
surl          =  ;The registration's URL. See
                 ; [8] for syntax.
lang          =  1*8ALPHA [ "-" 1*8ALPHA ]
                 ;RFC 1766 Language Tag see [6].
ltime         =  1*5DIGIT
                 ; A positive 16-bit integer
                 ; giving the lifetime
                 ; of the registration.
type          =  ; The service type name, see [7]
                 ; and [8] for syntax.
slist         =  "scopes" "=" scope-list newline
scope-list    =  scope-name / scope-name "," scope-list
scope         =  ; See grammar of [7] for
                 ; scope-name syntax.
attr-list     =  attr-def / attr-def attr-list
attr-def      =  ( attr / keyword ) newline
keyword       =  attr-id
attr          =  attr-id "=" attr-val-list
attr-id       =  ;Attribute id, see [7] for syntax.
attr-val-list =  attr-val / attr-val "," attr-val-list
attr-val      =  ;Attribute value, see [7] for syntax
allchar       =  char / WSP
char          =  DIGIT / ALPHA / other
other         =  %x21-%x2f / %x3a-%x40 /
                 %x5b-%x60 / %7b-%7e
                  ; All printable, nonwhitespace US-ASCII
                  ; characters.
newline       =  CR / ( CRLF )
.fi
.in -2

.sp
.LP
The syntax for attributes and attribute values requires that you use a
backslash to escape special characters, in addition to non-\fBASCII\fR
characters, as specified in \fIRFC 2608\fR. The \fBslpd\fR command handles
serialized registrations exactly as if they were registered by an \fBSA\fR. In
the \fBurl-props\fR production, the type token is optional. If the type token
is present for a service: \fBURL\fR, a warning is signalled, and the type name
is ignored. If the maximum lifetime of \fB65535\fR seconds is specified, the
registration is taken to be permanent, and it is continually refreshed by the
\fBDA\fR or \fBSA\fR server until it exits.
.sp
.LP
Scopes can be included in a registration by including an attribute definition
with tag \fBscopes\fR followed by a comma-separated list of scope names
immediately after the \fBurl-props\fR production. If the optional
\fBscope-list\fR is present, the registrations are made in the indicated scopes;
otherwise, they are registered in the scopes with which the \fBDA\fR or
\fBSA\fR server was configured through the \fBnet.slp.useScopes\fR property. If
any conflicts occur between the scope list and the \fBnet.slp.useScopes\fR
property, an error message is issued by way of \fBsyslog\fR(3C). Refer to
information regarding \fBLOG_INFO\fR in \fBsyslog\fR(3C).
.sp
.LP
Service advertisements are separated by a single blank line. Additionally, the
file must end with a single blank line.
.SH EXAMPLES
.LP
\fBExample 1 \fRUsing a Serialized Registration File
.sp
.LP
The following serialized registration file shows an instance of the service
type  \fBfoo\fR, with a lifetime of \fB65535\fR seconds, in the \fBen\fR
locale, with scope \fBsomescope\fR:

.sp
.in +2
.nf
# register foo
service:foo://fooserver/foopath,en,65535
scopes=somescope
description=bogus
security=kerberos_v5
location=headquarters

# next registration...
.fi
.in -2

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
CSI	Enabled
_
Interface Stability	Standard
.TE

.SH SEE ALSO
.LP
\fBslpd\fR(1M), \fBslp_api\fR(3SLP), \fBsyslog\fR(3C), \fBslp.conf\fR(4),
\fBattributes\fR(5)
.sp
.LP
Crocker, D. and Overell, P., \fIRFC 2234, Augmented BNF for Syntax
Specifications: ABNF\fR, The Internet Society, November 1997.
.sp
.LP
Guttman, E.,  Perkins, C., Veizades, J., and Day, M., \fIRFC 2608, Service
Location Protocol, Version 2\fR, The Internet Society, June 1999.
.sp
.LP
Kempf, J. and Guttman, E., \fIRFC 2614, An API for Service Location\fR, The
Internet Society, June 1999.
