illumos/illumos-gate/usr/src/man/man4/smbautohome.4
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH SMBAUTOHOME 4 "Feb 25, 2017"
.SH NAME
smbautohome \- CIFS autohome configuration
.SH SYNOPSIS
.LP
.nf
\fBsmbautohome\fR
.fi

.SH DESCRIPTION
.LP
The Solaris CIFS service can automatically share home directories when a CIFS
client connects. The autohome map file, \fB/etc/smbautohome\fR, uses the search
options and rules to determine whether to share a home directory when a CIFS
client connects to the server.
.sp
.LP
For example, the following entries specify the autohome rules for a particular
environment:
.sp
.in +2
.nf
+nsswitch	    dn=ad,dn=sun,dn=com,ou=users
jane    /home/?/&    dn=ad,dn=sun,dn=com,ou=users
.fi
.in -2
.sp

.sp
.LP
The \fBnsswitch\fR autohome entry uses the naming service to match users to
home directories. The second autohome entry specifies that the home directory
for user \fBjane\fR is \fB/home/j/jane\fR.
.SS "autohome Map Entry Format"
.LP
A map entry, which is also referred to as a mapping, uses the following format:
.sp
.in +2
.nf
\fIkey\fR \fIlocation\fR [ \fIoptions\fR ]
.fi
.in -2
.sp

.sp
.LP
\fIkey\fR is a user name, \fIlocation\fR is the fully qualified path for the
user's home directory, and \fIoptions\fR specifies the share options, for
example, an AD container or description. See \fBsharemgr\fR(1M) for information
on share options.
.sp
.LP
If you intend to publish the share in Active Directory (AD), you \fBmust\fR
specify an AD container name, which is specified as a comma-separated list of
attribute name-value pairs. The attributes use the LDAP distinguished name (DN)
or relative distinguished name (RDN) format.
.sp
.LP
The DN or RDN must be specified in LDAP format by using the following attribute
types:
.RS +4
.TP
.ie t \(bu
.el o
\fBcn=\fR represents the common name
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBou=\fR represents the organizational unit
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBdc=\fR represents the domain component
.RE
.sp
.LP
The attribute type that is used to describe an object's RDN is called a
\fBnaming attribute\fR. AD uses the naming attributes as follows:
.RS +4
.TP
.ie t \(bu
.el o
\fBcn\fR for the \fBuser\fR object class
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBou\fR for the \fBOU\fR (organizational unit) object class
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBdc\fR for the \fBdomainDns\fR object class
.RE
.SS "autohome Map Key Substitution"
.LP
The autohome feature supports the following wildcard substitutions for the
value of the key field:
.RS +4
.TP
.ie t \(bu
.el o
The ampersand character (\fB&\fR) is expanded to the value of the key field for
the entry in which it occurs. In the following example, \fB&\fR expands to
\fBjane\fR:
.sp
.in +2
.nf
jane /home/&
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
The question mark character (\fB?\fR) is expanded to the value of the first
character in the key field for the entry in which it occurs. In the following
example, \fB?\fR expands to \fBj\fR:
.sp
.in +2
.nf
jane /home/?/&
.fi
.in -2

.RE
.SS "Wildcard Rule"
.LP
When supplied in the key field, the asterisk character (\fB*\fR) is recognized
as the "catch-all" entry. Such an entry matches any key not previously matched.
.sp
.LP
For example, the following entry would map any user to a home directory in
\fB/home\fR in which the home directory name was the same as the user name:
.sp
.in +2
.nf
*    /home/&
.fi
.in -2

.sp
.LP
The wildcard rule is \fBonly\fR applied if an appropriate rule is not matched
by another map entry.
.SS "NSSwitch Map"
.LP
The \fBnsswitch\fR map is used to request that the home directory be obtained
from a password database, such as the local, NIS, or LDAP databases. If
an AD path is appended, it is used to publish shares.
.sp
.in +2
.nf
+nsswitch
.fi
.in -2

.sp
.LP
Like the "catch-all" entry, the \fBnsswitch\fR map is \fBonly\fR searched if an
appropriate rule is not matched by another map entry.
.sp
.LP
The wildcard and \fBnsswitch\fR rules are mutually exclusive. Do not include an
\fBnsswitch\fR rule if a wildcard rule has already been defined.
.SH FILES
.LP
\fB/etc/smbautohome\fR
.SH ATTRIBUTES
.LP
See the \fBattributes\fR(5) man page for descriptions of the following
attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Interface Stability	Uncommitted
.TE

.SH SEE ALSO
.LP
\fBsharectl\fR(1M), \fBsharemgr\fR(1M), \fBsmbadm\fR(1M), \fBsmbd\fR(1M),
\fBsmbstat\fR(1M), \fBsmb\fR(4), \fBattributes\fR(5)
