illumos/illumos-gate/usr/src/man/man4/ttydefs.4
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH TTYDEFS 4 "Jan 27, 1994"
.SH NAME
ttydefs \- file contains terminal line settings information for ttymon
.SH DESCRIPTION
.sp
.LP
\fB/etc/ttydefs\fR is an administrative file that contains records divided into
fields by colons (":").   This information used by \fBttymon\fR to set up the
speed and terminal settings for a TTY port.
.sp
.LP
The \fBttydefs\fR file contains the following fields:
.sp
.ne 2
.na
\fB\fIttylabel\fR\fR
.ad
.RS 17n
The string \fBttymon\fR tries to match against the TTY port's \fIttylabel\fR
field in the port monitor administrative file. It often describes the speed at
which the terminal is supposed to run, for example, \fB1200\fR.
.RE

.sp
.ne 2
.na
\fB\fIinitial-flags\fR\fR
.ad
.RS 17n
Contains the initial  \fBtermio\fR(7I) settings to which the terminal is to be
set. For example, the system administrator will be able to specify what the
default erase and kill characters will be. \fIinitial-flags\fR must be
specified in the syntax recognized by the \fBstty\fR command.
.RE

.sp
.ne 2
.na
\fB\fIfinal-flags\fR\fR
.ad
.RS 17n
\fIfinal-flags\fR must be specified in the same format as \fIinitial-flags\fR.
\fBttymon\fR sets these final settings after a connection request has been made
and immediately prior to invoking a port's service.
.RE

.sp
.ne 2
.na
\fB\fIautobaud\fR\fR
.ad
.RS 17n
If the autobaud field contains the character 'A,' autobaud will  be enabled.
Otherwise, autobaud will be disabled. \fBttymon\fR determines what line speed
to set the TTY port to by analyzing the carriage returns entered. If autobaud
has been disabled, the hunt sequence is used for baud rate determination.
.RE

.sp
.ne 2
.na
\fB\fInextlabel\fR\fR
.ad
.RS 17n
If the user indicates that the current terminal setting is not appropriate by
sending a BREAK, \fBttymon\fR searchs for a \fBttydefs\fR entry whose
\fIttylabel\fR field matches  the \fInextlabel\fR field. If a match is found,
\fBttymon\fR uses that field as its \fIttylabel\fR field. A series of speeds is
often linked together in this way into a closed set called a hunt sequence. For
example, \fB4800\fR may be linked to \fB1200\fR, which in turn is linked to
\fB2400\fR, which is finally linked to \fB4800\fR.
.RE

.SH SEE ALSO
.sp
.LP
\fBsttydefs\fR(1M), \fBttymon\fR(1M), \fBtermio\fR(7I)
.sp
.LP
\fISystem Administration Guide: Basic Administration\fR
