illumos/illumos-gate/usr/src/man/man4/utmp.4
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH UTMP 4 "Feb 22, 1999"
.SH NAME
utmp, wtmp \- utmp and wtmp database entry formats
.SH SYNOPSIS
.LP
.nf
\fB#include <utmp.h>\fR
\fB/var/adm/utmp\fR
\fB/var/adm/wtmp\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fButmp\fR and \fBwtmp\fR database files are obsolete and are no longer
present on the system.  They have been superseded by the extended database
contained in the \fButmpx\fR and \fBwtmpx\fR database files.  See
\fButmpx\fR(4).
.sp
.LP
It is possible for \fB/var/adm/utmp\fR to reappear on the system. This would
most likely occur if a third party application that still uses \fButmp\fR
recreates the file if it finds it missing. This file should not be allowed to
remain on the system. The user should investigate to determine which
application is recreating this file.
.SH SEE ALSO
.sp
.LP
\fButmpx\fR(4)
