illumos/illumos-gate/usr/src/man/man9e/identify.9e
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.TH IDENTIFY 9E "Apr 11, 2003"
.SH NAME
identify \- determine if a driver is associated with a device
.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This entry point is no longer supported.
\fBnulldev\fR(9F) must be specified in the  \fBdev_ops\fR(9S) structure.
.SH SEE ALSO
.sp
.LP
\fBnulldev\fR(9F), \fBdev_ops\fR(9S)
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
box;
c | c
l | l .
ATTRIBUTE TYPE	ATTRIBUTE VALUE
_
Stability Level	Obsolete
.TE

.SH WARNING
.sp
.LP
For Solaris 10 and later versions, drivers must remove the \fBidentify(9e)\fR
implementation to recompile. Otherwise, the compiler generates errors about
DDI_IDENTIFIED and DDI_NOT_IDENTIFIED.
