illumos/illumos-gate/usr/src/man/man4fs/udfs.4fs
.\"
.\" Copyright (c) 1999 Sun Microsystems, Inc.
.\" All Rights Reserved.
.\" Copyright 2021 Oxide Computer Company
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.Dd June 20, 2021
.Dt UDFS 4FS
.Os
.Sh NAME
.Nm udfs
.Nd universal disk format file system
.Sh DESCRIPTION
The
.Nm
file system is a file system type that allows user access to files on Universal
Disk Format (UDF) disks from within illumos.
Once mounted, a
.Nm
file system provides standard file system operations and semantics.
That is, users can read files, write files, and list files in a directory on a
UDF device and applications can use standard UNIX system calls on these files
and directories.
.Pp
Because
.Nm
is a platform-independent file system, the same media can be written to and read
from by any operating system or vendor.
.Ss "Mounting File Systems"
.Nm
file systems are mounted using:
.Bd -literal -offset indent
mount -F udfs -o rw/ro device-special
.Ed
.Pp
Use:
.Bd -literal -offset indent
mount /udfs
.Ed
if the
.Nm
and device special file
.Pa /dev/dsk/c0t6d0s0
are valid and the following line
.Pq or similar line
appears in your
Pa /etc/vfstab
file:
.Bd -literal -offset indent
/dev/dsk/c0t6d0s0 - /udfs udfs - no ro
.Ed
.Pp
The
.Nm
file system provides read-only support for ROM, RAM, and sequentially-recordable
media and read-write support on RAM media.
.Pp
The
.Nm
file system also supports regular files, directories, and symbolic links, as
well as device nodes such as block, character, FIFO, and Socket.
.Sh SEE ALSO
.Xr vfstab 5 ,
.Xr mount 8 ,
.Xr mount_udfs 8
.Sh NOTES
Invalid characters such as
.Dq \e0
and
.Dq /
and invalid file names
such as
.Dq \ .
.Dq \&.
and
.Dq \&.\&.
will be translated according to the following rule:
.Pp
Replace the invalid character with an
.Dq _ ,
then append the file name with
.Dq #
followed by a 4 digit hex representation of the 16-bit CRC of the original
.Sy FileIdentifier .
For example, the file name
.Dq \&.\&.
will become
.Dq __#4C05 .
