/*
 *
 *	  O.S	: Solaris
 *	FILE NAME  : arcmsr.h
 *	  BY	: Erich Chen
 *	Description: SCSI RAID Device Driver for
 *			ARECA RAID Host adapter
 *
 * Copyright (C) 2002,2007 Areca Technology Corporation All rights reserved.
 * Copyright (C) 2002,2007 Erich Chen
 *		Web site: www.areca.com.tw
 *		E-mail: erich@areca.com.tw
 *
 *	Redistribution and use in source and binary forms, with or without
 *	modification, are permitted provided that the following conditions
 *	are met:
 *	1. Redistributions of source code must retain the above copyright
 *	 notice, this list of conditions and the following disclaimer.
 *	2. Redistributions in binary form must reproduce the above copyright
 *	 notice, this list of conditions and the following disclaimer in the
 *	 documentation and/or other materials provided with the distribution.
 *	3. The party using or redistributing the source code and binary forms
 *	 agrees to the disclaimer below and the terms and conditions set forth
 *	 herein.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 *  ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 *  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 *  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS

	/* bit 2: 0(Data in) / 1(Data out)	*/
#define	ARCMSR_CDB_FLAG_WRITE			0x04
	/* bit 4/3 ,00 : simple Q,01 : head of Q,10 : ordered Q */
#define	ARCMSR_CDB_FLAG_SIMPLEQ			0x00
#define	ARCMSR_CDB_FLAG_HEADQ			0x08
#define	ARCMSR_CDB_FLAG_ORDEREDQ		0x10

	uint8_t		Reserved1;

	uint32_t	Context;	/* Address of this request */
	uint32_t	DataLength;	/* currently unused */

	uint8_t		Cdb[16];	/* SCSI CDB */
	/*
	 * Device Status : the same from SCSI bus if error occur
	 * SCSI bus status codes.
	 */
	uint8_t		DeviceStatus;

#define	SCSISTAT_GOOD				0x00
#define	SCSISTAT_CHECK_CONDITION		0x02
#define	SCSISTAT_CONDITION_MET			0x04
#define	SCSISTAT_BUSY				0x08
#define	SCSISTAT_INTERMEDIATE			0x10
#define	SCSISTAT_INTERMEDIATE_COND_MET		0x14
#define	SCSISTAT_RESERVATION_CONFLICT		0x18
#define	SCSISTAT_COMMAND_TERMINATED		0x22
#define	SCSISTAT_QUEUE_FULL			0x28

#define	ARCMSR_DEV_SELECT_TIMEOUT		0xF0
#define	ARCMSR_DEV_ABORTED			0xF1
#define	ARCMSR_DEV_INIT_FAIL			0xF2

	uint8_t		SenseData[15];

	/* Scatter gather address */
	union {
		struct SG32ENTRY	sg32entry[ARCMSR_MAX_SG_ENTRIES];
		struct SG64ENTRY	sg64entry[ARCMSR_MAX_SG_ENTRIES];
	} sgu;
};


struct HBA_msgUnit {
	uint32_t	resrved0[4];
	uint32_t	inbound_msgaddr0;
	uint32_t	inbound_msgaddr1;
	uint32_t	outbound_msgaddr0;
	uint32_t	outbound_msgaddr1;
	uint32_t	inbound_doorbell;
	uint32_t	inbound_intstatus;
	uint32_t	inbound_intmask;
	uint32_t	outbound_doorbell;
	uint32_t	outbound_intstatus;
	uint32_t	outbound_intmask;
	uint32_t	reserved1[2];
	uint32_t	inbound_queueport;
	uint32_t	outbound_queueport;
	uint32_t	reserved2[2];
	/* ......local_buffer */
	uint32_t	reserved3[492];
	uint32_t	reserved4[128];
	uint32_t	msgcode_rwbuffer[256];
	uint32_t	message_wbuffer[32];
	uint32_t	reserved5[32];
	uint32_t	message_rbuffer[32];
	uint32_t	reserved6[32];
};


struct HBB_DOORBELL {
	uint8_t		doorbell_reserved[132096];
	/*
	 * offset 0x00020400:00,01,02,03: window of "instruction flags"
	 * from driver to iop
	 */
	uint32_t	drv2iop_doorbell;
	/* 04,05,06,07: doorbell mask */
	uint32_t	drv2iop_doorbell_mask;
	/* 08,09,10,11: window of "instruction flags" from iop to driver */
	uint32_t	iop2drv_doorbell;
	/* 12,13,14,15: doorbell mask */
	uint32_t	iop2drv_doorbell_mask;
};


struct HBB_RWBUFFER {
	uint8_t		message_reserved0[64000];
	/* offset 0x0000fa00:	0..1023: message code read write 1024bytes */
	uint32_t	msgcode_rwbuffer[256];
	/* offset 0x0000fe00:1024...1151: user space data to iop 128bytes */
	uint32_t	message_wbuffer[32];
	/* 1152...1279: message reserved */
	uint32_t	message_reserved1[32];
	/* offset 0x0000ff00:1280...1407: iop data to user space 128bytes */
	uint32_t	message_rbuffer[32];
};

struct HBB_msgUnit {
	uint32_t		post_qbuffer[ARCMSR_MAX_HBB_POSTQUEUE];
	uint32_t		done_qbuffer[ARCMSR_MAX_HBB_POSTQUEUE];

	int32_t			postq_index;	/* post queue index */
	int32_t			doneq_index;	/* done queue index */
	struct HBB_DOORBELL	*hbb_doorbell;
	struct HBB_RWBUFFER	*hbb_rwbuffer;
};

struct HBC_msgUnit {
	uint32_t	message_unit_status;			/* 0000 0003 */
	uint32_t	slave_error_attribute;			/* 0004 0007 */
	uint32_t	slave_error_address;			/* 0008 000B */
	uint32_t	posted_outbound_doorbell;		/* 000C 000F */
	uint32_t	master_error_attribute;			/* 0010 0013 */
	uint32_t	master_error_address_low;		/* 0014 0017 */
	uint32_t	master_error_address_high;		/* 0018 001B */
	uint32_t	hcb_size;				/* 001C 001F */
	uint32_t	inbound_doorbell;			/* 0020 0023 */
	uint32_t	diagnostic_rw_data;			/* 0024 0027 */
	uint32_t	diagnostic_rw_address_low;		/* 0028 002B */
	uint32_t	diagnostic_rw_address_high;		/* 002C 002F */
	uint32_t	host_int_status;			/* 0030 0033 */
	uint32_t	host_int_mask;				/* 0034 0037 */
	uint32_t	dcr_data;				/* 0038 003B */
	uint32_t	dcr_address;				/* 003C 003F */
	uint32_t	inbound_queueport;			/* 0040 0043 */
	uint32_t	outbound_queueport;			/* 0044 0047 */
	uint32_t	hcb_pci_address_low;			/* 0048 004B */
	uint32_t	hcb_pci_address_high;			/* 004C 004F */
	uint32_t	iop_int_status;				/* 0050 0053 */
	uint32_t	iop_int_mask;				/* 0054 0057 */
	uint32_t	iop_inbound_queue_port;			/* 0058 005B */
	uint32_t	iop_outbound_queue_port;		/* 005C 005F */
	uint32_t	inbound_free_list_index;		/* 0060 0063 */
	uint32_t	inbound_post_list_index;		/* 0064 0067 */
	uint32_t	outbound_free_list_index;		/* 0068 006B */
	uint32_t	outbound_post_list_index;		/* 006C 006F */
	uint32_t	inbound_doorbell_clear;			/* 0070 0073 */
	uint32_t	i2o_message_unit_control;		/* 0074 0077 */
	uint32_t	last_used_message_source_address_low;	/* 0078 007B */
	uint32_t	last_used_message_source_address_high;	/* 007C 007F */
	uint32_t	pull_mode_data_byte_count[4];		/* 0080 008F */
	uint32_t	message_dest_address_index;		/* 0090 0093 */
	uint32_t	done_queue_not_empty_int_counter_timer;	/* 0094 0097 */
	uint32_t	utility_A_int_counter_timer;		/* 0098 009B */
	uint32_t	outbound_doorbell;			/* 009C 009F */
	uint32_t	outbound_doorbell_clear;		/* 00A0 00A3 */
	uint32_t	message_source_address_index;		/* 00A4 00A7 */
	uint32_t	message_done_queue_index;		/* 00A8 00AB */
	uint32_t	reserved0;				/* 00AC 00AF */
	uint32_t	inbound_msgaddr0;			/* 00B0 00B3 */
	uint32_t	inbound_msgaddr1;			/* 00B4 00B7 */
	uint32_t	outbound_msgaddr0;			/* 00B8 00BB */
	uint32_t	outbound_msgaddr1;			/* 00BC 00BF */
	uint32_t	inbound_queueport_low;			/* 00C0 00C3 */
	uint32_t	inbound_queueport_high;			/* 00C4 00C7 */
	uint32_t	outbound_queueport_low;			/* 00C8 00CB */
	uint32_t	outbound_queueport_high;		/* 00CC 00CF */
	uint32_t	iop_inbound_queue_port_low;		/* 00D0 00D3 */
	uint32_t	iop_inbound_queue_port_high;		/* 00D4 00D7 */
	uint32_t	iop_outbound_queue_port_low;		/* 00D8 00DB */
	uint32_t	iop_outbound_queue_port_high;		/* 00DC 00DF */
	uint32_t	message_dest_queue_port_low;		/* 00E0 00E3 */
	uint32_t	message_dest_queue_port_high;		/* 00E4 00E7 */
	uint32_t	last_used_message_dest_address_low;	/* 00E8 00EB */
	uint32_t	last_used_message_dest_address_high;	/* 00EC 00EF */
	uint32_t	message_done_queue_base_address_low;	/* 00F0 00F3 */
	uint32_t	message_done_queue_base_address_high;	/* 00F4 00F7 */
	uint32_t	host_diagnostic;			/* 00F8 00FB */
	uint32_t	write_sequence;				/* 00FC 00FF */
	uint32_t	reserved1[34];				/* 0100 0187 */
	uint32_t	reserved2[1950];			/* 0188 1FFF */
	uint32_t	message_wbuffer[32];			/* 2000 207F */
	uint32_t	reserved3[32];				/* 2080 20FF */
	uint32_t	message_rbuffer[32];			/* 2100 217F */
	uint32_t	reserved4[32];				/* 2180 21FF */
	uint32_t	msgcode_rwbuffer[256];			/* 2200 23FF */
};

struct msgUnit {
	union	{
		struct HBA_msgUnit	hbamu;
		struct HBB_msgUnit	hbbmu;
		struct HBC_msgUnit	hbcmu;
	} muu;
};


/*
 * Adapter Control Block
 */
struct ACB {
	uint32_t		adapter_type; /* A/B/C/D */

#define	ACB_ADAPTER_TYPE_A	0x00000001	/* hba (Intel) IOP */
#define	ACB_ADAPTER_TYPE_B	0x00000002	/* hbb (Marvell) IOP */
#define	ACB_ADAPTER_TYPE_C	0x00000004	/* hbc (Lsi) IOP */
#define	ACB_ADAPTER_TYPE_D	0x00000008	/* hbd A IOP */

	scsi_hba_tran_t		*scsi_hba_transport;
	dev_info_t		*dev_info;
	ddi_acc_handle_t	reg_mu_acc_handle0;
	ddi_acc_handle_t	reg_mu_acc_handle1;
	ddi_acc_handle_t	ccbs_acc_handle;
	ddi_dma_handle_t	ccbs_pool_handle;
	ddi_dma_cookie_t	ccb_cookie;
